{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\logfiles\AdvMathIncRankQuantFinalDatasetInstruments.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Aug 2022, 11:20:46
{txt}
{com}. 
. *Define the directory
. global PATH "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles"
{txt}
{com}. cd $PATH
{res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles
{txt}
{com}. 
. use "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles\AdvMathIncRankQuantFinalDatasetNoInstruments.dta"
{txt}
{com}. 
. *Create matrices for each cohorts enrollment from 1983-2016
. matrix ninetyfour = (0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ninetyfour
{res}
{txt}ninetyfour[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix ninetyfive = (0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ninetyfive
{res}
{txt}ninetyfive[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix ninetysix = (0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ninetysix
{res}
{txt}ninetysix[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix ninetyseven = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ninetyseven
{res}
{txt}ninetyseven[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix ninetyeight = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ninetyeight
{res}
{txt}ninetyeight[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *create instruments by state and cohort
. 
. *AL
. 
. matrix AL = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list AL
{res}
{txt}AL[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix ALrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,100,100,100,100,100,100,100,176.25,176.25,176.25,176.25,176.25,100,100,100,100)
{txt}
{com}. 
. matrix list ALrec
{res}
{txt}ALrec[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0     100     100     100     100     100     100     100  176.25  176.25  176.25

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 176.25  176.25     100     100     100     100
{reset}
{com}. 
. matrix ALexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,508000,508000,508000,508000,508000,508000,508000,846651.75,846651.75,846651.75,846651.75,846651.75,508000,508000,508000,508000)
{txt}
{com}. 
. matrix list ALexp
{res}
{txt}ALexp[1,34]
           c1         c2         c3         c4         c5         c6         c7         c8         c9        c10
r1 {res}         0          0          0          0          0          0          0          0          0          0

{txt}          c11        c12        c13        c14        c15        c16        c17        c18        c19        c20
r1 {res}         0          0          0          0          0          0          0          0     508000     508000

{txt}          c21        c22        c23        c24        c25        c26        c27        c28        c29        c30
r1 {res}    508000     508000     508000     508000     508000  846651.75  846651.75  846651.75  846651.75  846651.75

{txt}          c31        c32        c33        c34
r1 {res}    508000     508000     508000     508000
{reset}
{com}. 
. *AK
. 
. matrix AK = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list AK
{res}
{txt}AK[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix AKrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list AKrec
{res}
{txt}AKrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix AKexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list AKexp
{res}
{txt}AKexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *AZ 
. 
. matrix AZ = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list AZ
{res}
{txt}AZ[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    1    1    1    1    0    0
{reset}
{com}. 
. matrix AZrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,36,36,36,36,0,0)
{txt}
{com}. 
. matrix list AZrec
{res}
{txt}AZrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0   36   36   36   36    0    0
{reset}
{com}. 
. matrix AZexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,193676.73,193676.73,193676.73,193676.73,0,0)
{txt}
{com}. 
. matrix list AZexp
{res}
{txt}AZexp[1,34]
           c1         c2         c3         c4         c5         c6         c7         c8         c9        c10
r1 {res}         0          0          0          0          0          0          0          0          0          0

{txt}          c11        c12        c13        c14        c15        c16        c17        c18        c19        c20
r1 {res}         0          0          0          0          0          0          0          0          0          0

{txt}          c21        c22        c23        c24        c25        c26        c27        c28        c29        c30
r1 {res}         0          0          0          0          0          0          0          0  193676.73  193676.73

{txt}          c31        c32        c33        c34
r1 {res} 193676.73  193676.73          0          0
{reset}
{com}. 
. *AR
. 
. matrix AR = (0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list AR
{res}
{txt}AR[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix ARrec = (0,0,0,0,0,0,0,0,0,0,0,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,60.7647058823529,378.514705882353,378.514705882353,378.514705882353,378.514705882353,378.514705882353,826.514705882353,826.514705882353,826.514705882353,826.514705882353,448,448,0,0)
{txt}
{com}. 
. matrix list ARrec
{res}
{txt}ARrec[1,34]
           c1         c2         c3         c4         c5         c6         c7         c8         c9        c10
r1 {res}         0          0          0          0          0          0          0          0          0          0

{txt}          c11        c12        c13        c14        c15        c16        c17        c18        c19        c20
r1 {res}         0  60.764706  60.764706  60.764706  60.764706  60.764706  60.764706  60.764706  60.764706  60.764706

{txt}          c21        c22        c23        c24        c25        c26        c27        c28        c29        c30
r1 {res} 60.764706  378.51471  378.51471  378.51471  378.51471  378.51471  826.51471  826.51471  826.51471  826.51471

{txt}          c31        c32        c33        c34
r1 {res}       448        448          0          0
{reset}
{com}. 
. matrix ARexp = (0,0,0,0,0,0,0,0,0,0,0,337577.926470588,337577.926470588,337577.926470588,337577.926470588,337577.926470588,337577.926470588,337577.926470588,337577.926470588,337577.926470588,337577.926470588,1724092.87272059,1724092.87272059,1724092.87272059,1724092.87272059,1724092.87272059,3104066.48872059,3104066.48872059,3104066.48872059,3104066.48872059,1379973.616,1379973.616,0,0)
{txt}
{com}. 
. matrix list ARexp
{res}
{txt}ARexp[1,34]
           c1         c2         c3         c4         c5         c6         c7         c8         c9        c10
r1 {res}         0          0          0          0          0          0          0          0          0          0

{txt}          c11        c12        c13        c14        c15        c16        c17        c18        c19        c20
r1 {res}         0  337577.93  337577.93  337577.93  337577.93  337577.93  337577.93  337577.93  337577.93  337577.93

{txt}          c21        c22        c23        c24        c25        c26        c27        c28        c29        c30
r1 {res} 337577.93  1724092.9  1724092.9  1724092.9  1724092.9  1724092.9  3104066.5  3104066.5  3104066.5  3104066.5

{txt}          c31        c32        c33        c34
r1 {res} 1379973.6  1379973.6          0          0
{reset}
{com}. 
. *CA
. 
. matrix CA = (1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list CA
{res}
{txt}CA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix CArec = (4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788,4788)
{txt}
{com}. 
. matrix list CArec
{res}
{txt}CArec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res} 4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788  4788
{reset}
{com}. 
. matrix CAexp = (16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672,16591672)
{txt}
{com}. 
. matrix list CAexp
{res}
{txt}CAexp[1,34]
          c1        c2        c3        c4        c5        c6        c7        c8        c9       c10       c11
r1 {res} 16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672

{txt}         c12       c13       c14       c15       c16       c17       c18       c19       c20       c21       c22
r1 {res} 16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672

{txt}         c23       c24       c25       c26       c27       c28       c29       c30       c31       c32       c33
r1 {res} 16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672  16591672

{txt}         c34
r1 {res} 16591672
{reset}
{com}. 
. *CO
. 
. matrix CO = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list CO
{res}
{txt}CO[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix COrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,248,248,248,248,248,248,248,248,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list COrec 
{res}
{txt}COrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  248  248  248  248  248

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 248  248  248    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix COexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,443040,443040,443040,443040,443040,443040,443040,443040,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list COexp 
{res}
{txt}COexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0  443040  443040  443040  443040  443040  443040  443040  443040       0       0

{txt}       c29     c30     c31     c32     c33     c34
r1 {res}      0       0       0       0       0       0
{reset}
{com}. 
. *CT 
. 
. matrix CT = (1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list CT
{res}
{txt}CT[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix CTrec = (300,300,300,300,300,300,300,300,0,0,0,0,0,0,0,0,0,0,0,83,83,83,83,83,83,83,83,83,83,83,83,83,0,0)
{txt}
{com}. 
. matrix list CTrec
{res}
{txt}CTrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res} 300  300  300  300  300  300  300  300    0    0    0    0    0    0    0    0    0    0    0   83   83   83   83

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  83   83   83   83   83   83   83   83   83    0    0
{reset}
{com}. 
. matrix CTexp = (2712000,2712000,2712000,2712000,2712000,2712000,2712000,2712000,0,0,0,0,0,0,0,0,0,0,0,347283,347283,347283,347283,347283,347283,347283,347283,347283,347283,347283,347283,347283,0,0)
{txt}
{com}. 
. matrix list CTexp
{res}
{txt}CTexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res} 2712000  2712000  2712000  2712000  2712000  2712000  2712000  2712000        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0        0        0        0        0   347283   347283   347283   347283   347283

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res}  347283   347283   347283   347283   347283   347283   347283   347283        0        0
{reset}
{com}. 
. *DE
. 
. matrix DE = (0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list DE
{res}
{txt}DE[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix DErec = (0,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,34,34,34,34,34,34,34,34,34,34,34,34,8,8)
{txt}
{com}. 
. matrix list DErec
{res}
{txt}DErec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    8    8    8    8    8    8    8    8    8    8    8    8    8    8    8    8    8    8    8   34   34   34

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  34   34   34   34   34   34   34   34   34    8    8
{reset}
{com}. 
. matrix DEexp = (0,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,216000,395875,395875,395875,395875,395875,395875,395875,395875,395875,395875,395875,395875,216000,216000)
{txt}
{com}. 
. matrix list DEexp
{res}
{txt}DEexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 216000  216000  216000  216000  216000  216000  395875  395875  395875  395875  395875  395875  395875  395875

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 395875  395875  395875  395875  216000  216000
{reset}
{com}. 
. *DC
. 
. matrix DC = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list DC
{res}
{txt}DC[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix DCrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list DCrec
{res}
{txt}DCrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix DCexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list DEexp
{res}
{txt}DEexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000  216000

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 216000  216000  216000  216000  216000  216000  395875  395875  395875  395875  395875  395875  395875  395875

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 395875  395875  395875  395875  216000  216000
{reset}
{com}. 
. *FL
. 
. matrix FL = (0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list FL
{res}
{txt}FL[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix FLrec = (0,0,0,0,0,0,0,0,867,867,2538,2538,2538,2538,2538,2538,2538,2538,2538,3109,3109,3109,3109,3109,3109,3109,3109,3109,571,571,571,571,0,0)
{txt}
{com}. 
. matrix list FLrec
{res}
{txt}FLrec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0     0     0     0     0     0     0     0   867   867  2538  2538  2538  2538  2538  2538  2538  2538  2538

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 3109  3109  3109  3109  3109  3109  3109  3109  3109   571   571   571   571     0     0
{reset}
{com}. 
. matrix FLexp = (0,0,0,0,0,0,0,0,203447,203447,2638548,2638548,2638548,2638548,2638548,2638548,2638548,2638548,2638548,4580539,4580539,4580539,4580539,4580539,4580539,4580539,4580539,4580539,1941991,1941991,1941991,1941991,0,0)
{txt}
{com}. 
. matrix list FLexp
{res}
{txt}FLexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0   203447   203447  2638548  2638548

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 2638548  2638548  2638548  2638548  2638548  2638548  2638548  4580539  4580539  4580539  4580539  4580539

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 4580539  4580539  4580539  4580539  1941991  1941991  1941991  1941991        0        0
{reset}
{com}. 
. *GA
. 
. matrix GA = (0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0)
{txt}
{com}. 
. matrix list GA
{res}
{txt}GA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    0    0    0    0    0
{reset}
{com}. 
. matrix GArec = (0,0,0,0,0,0,0,0,0,0,0,0,1931,1931,1931,1931,1931,1931,3551,3551,3551,3551,3551,3551,3551,3551,3551,3551,1931,0,0,0,0,0)
{txt}
{com}. 
. matrix list GArec
{res}
{txt}GArec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0     0     0     0     0     0     0     0     0     0     0     0  1931  1931  1931  1931  1931  1931  3551

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 3551  3551  3551  3551  3551  3551  3551  3551  3551  1931     0     0     0     0     0
{reset}
{com}. 
. matrix GAexp = (0,0,0,0,0,0,0,0,0,0,0,0,5062142,5062142,5062142,5062142,5062142,5062142,9365375,9365375,9365375,9365375,9365375,9365375,9365375,9365375,9365375,9365375,5062142,0,0,0,0,0)
{txt}
{com}. 
. matrix list GAexp
{res}
{txt}GAexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 5062142  5062142  5062142  5062142  5062142  5062142  9365375  9365375  9365375  9365375  9365375  9365375

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 9365375  9365375  9365375  9365375  5062142        0        0        0        0        0
{reset}
{com}. 
. *HI
. 
. matrix HI = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list HI
{res}
{txt}HI[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix HIrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,23,23,23,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list HIrec
{res}
{txt}HIrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0   23   23   23    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix HIexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,119000,119000,119000,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list HIexp
{res}
{txt}HIexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0       0  119000  119000  119000       0       0       0       0       0       0

{txt}       c29     c30     c31     c32     c33     c34
r1 {res}      0       0       0       0       0       0
{reset}
{com}. 
. *ID
. 
. matrix ID = (0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ID
{res}
{txt}ID[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    1    1    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix IDrec = (0,0,0,0,0,0,0,0,0,28,28,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list IDrec
{res}
{txt}IDrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0   28   28    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix IDexp = (0,0,0,0,0,0,0,0,0,84864,84864,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list IDexp
{res}
{txt}IDexp[1,34]
       c1     c2     c3     c4     c5     c6     c7     c8     c9    c10    c11    c12    c13    c14    c15    c16
r1 {res}     0      0      0      0      0      0      0      0      0  84864  84864      0      0      0      0      0

{txt}      c17    c18    c19    c20    c21    c22    c23    c24    c25    c26    c27    c28    c29    c30    c31    c32
r1 {res}     0      0      0      0      0      0      0      0      0      0      0      0      0      0      0      0

{txt}      c33    c34
r1 {res}     0      0
{reset}
{com}. 
. *IL
. 
. matrix IL = (0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list IL 
{res}
{txt}IL[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix ILrec = (0,0,0,274,274,274,274,274,709,709,709,709,1115,1115,1115,1115,1115,1115,1115,1207,1207,1207,1207,1207,1207,1207,1207,1207,1207,1207,801,801,274,274)
{txt}
{com}. 
. matrix list ILrec
{res}
{txt}ILrec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0     0     0   274   274   274   274   274   709   709   709   709  1115  1115  1115  1115  1115  1115  1115

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 1207  1207  1207  1207  1207  1207  1207  1207  1207  1207  1207   801   801   274   274
{reset}
{com}. 
. matrix ILexp = (0,0,0,2928217,2928217,2928217,2928217,2928217,5351653,5351653,5351653,5351653,8219266,8219266,8219266,8219266,8219266,8219266,8219266,8652812,8652812,8652812,8652812,8652812,8652812,8652812,8652812,8652812,8652812,8652812,5785199,5785199,2928217,2928217)
{txt}
{com}. 
. matrix list ILexp
{res}
{txt}ILexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0  2928217  2928217  2928217  2928217  2928217  5351653  5351653  5351653  5351653

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 8219266  8219266  8219266  8219266  8219266  8219266  8219266  8652812  8652812  8652812  8652812  8652812

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 8652812  8652812  8652812  8652812  8652812  8652812  5785199  5785199  2928217  2928217
{reset}
{com}. 
. *IN
. 
. matrix IN = (0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list IN
{res}
{txt}IN[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix INrec = (0,0,0,0,0,0,0,0,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,214,0,0)
{txt}
{com}. 
. matrix list INrec
{res}
{txt}INrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0  214  214  214  214  214  214  214  214  214  214  214  214  214  214  214

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 214  214  214  214  214  214  214  214  214    0    0
{reset}
{com}. 
. matrix INexp = (0,0,0,0,0,0,0,0,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,317478,0,0)
{txt}
{com}. 
. matrix list INexp
{res}
{txt}INexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0  317478  317478  317478  317478  317478  317478

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 317478  317478  317478  317478  317478  317478  317478  317478  317478  317478  317478  317478  317478  317478

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 317478  317478  317478  317478       0       0
{reset}
{com}. 
. *IA
. 
. matrix IA = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list IA
{res}
{txt}IA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix IArec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,290,314,314,314,314,314,314,314,314,314,314,314,314,639,325,325)
{txt}
{com}. 
. matrix list IArec
{res}
{txt}IArec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  290  314  314  314  314

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 314  314  314  314  314  314  314  314  639  325  325
{reset}
{com}. 
. matrix IAexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,949974,15649974,15649974,15649974,15649974,15649974,15649974,15649974,15649974,15649974,15649974,15649974,15649974,16884974,1235000,1235000)
{txt}
{com}. 
. matrix list IAexp 
{res}
{txt}IAexp[1,34]
          c1        c2        c3        c4        c5        c6        c7        c8        c9       c10       c11
r1 {res}        0         0         0         0         0         0         0         0         0         0         0

{txt}         c12       c13       c14       c15       c16       c17       c18       c19       c20       c21       c22
r1 {res}        0         0         0         0         0         0         0    949974  15649974  15649974  15649974

{txt}         c23       c24       c25       c26       c27       c28       c29       c30       c31       c32       c33
r1 {res} 15649974  15649974  15649974  15649974  15649974  15649974  15649974  15649974  15649974  16884974   1235000

{txt}         c34
r1 {res}  1235000
{reset}
{com}. 
. *KS
. 
. matrix KS = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list KS
{res}
{txt}KS[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix KSrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,36,36,36,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list KSrec
{res}
{txt}KSrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0   36

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  36   36    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix KSexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,191500,191500,191500,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list KSexp
{res}
{txt}KSexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0       0       0       0       0  191500  191500  191500       0       0       0

{txt}       c29     c30     c31     c32     c33     c34
r1 {res}      0       0       0       0       0       0
{reset}
{com}. 
. *KY
. 
. matrix KY = (0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list KY
{res}
{txt}KY[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix KYrec = (0,0,0,0,0,0,0,0,447,447,447,447,447,447,447,447,447,447,447,1550,1550,1550,1550,1550,1550,1550,1550,1550,1550,1550,1550,1550,0,0)
{txt}
{com}. 
. matrix list KYrec
{res}
{txt}KYrec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0     0     0     0     0     0     0     0   447   447   447   447   447   447   447   447   447   447   447

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 1550  1550  1550  1550  1550  1550  1550  1550  1550  1550  1550  1550  1550     0     0
{reset}
{com}. 
. matrix KYexp = (0,0,0,0,0,0,0,0,2040163,2040163,2040163,2040163,2040163,2040163,2040163,2040163,2040163,2040163,2040163,4623649,4623649,4623649,4623649,4623649,4623649,4623649,4623649,4623649,4623649,4623649,4623649,4623649,0,0)
{txt}
{com}. 
. matrix list KYexp
{res}
{txt}KYexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0  2040163  2040163  2040163  2040163

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 2040163  2040163  2040163  2040163  2040163  2040163  2040163  4623649  4623649  4623649  4623649  4623649

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 4623649  4623649  4623649  4623649  4623649  4623649  4623649  4623649        0        0
{reset}
{com}. 
. *LA
. 
. matrix LA = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list LA
{res}
{txt}LA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix LArec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,33,33,33,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list LArec
{res}
{txt}LArec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0   33   33   33

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix LAexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,244000,244000,244000,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list LAexp
{res}
{txt}LAexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0       0       0  244000  244000  244000       0       0       0       0       0

{txt}       c29     c30     c31     c32     c33     c34
r1 {res}      0       0       0       0       0       0
{reset}
{com}. 
. *ME
. 
. matrix ME = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list ME
{res}
{txt}ME[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix MErec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,340,340,340,340,340,340,340,340,340,340,340,340,340,340,340,340,340,0,0)
{txt}
{com}. 
. matrix list MErec
{res}
{txt}MErec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  340  340  340  340  340  340  340  340

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 340  340  340  340  340  340  340  340  340    0    0
{reset}
{com}. 
. matrix MEexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,1099799,0,0)
{txt}
{com}. 
. matrix list MEexp
{res}
{txt}MEexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0  1099799  1099799  1099799  1099799  1099799  1099799  1099799  1099799  1099799

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 1099799  1099799  1099799  1099799  1099799  1099799  1099799  1099799        0        0
{reset}
{com}. 
. *MD
. 
. matrix MD = (0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list MD
{res}
{txt}MD[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix MDrec = (0,0,0,0,0,0,0,0,94,94,94,94,94,94,94,94,94,94,94,94,433,433,433,433,433,433,433,433,339,339,339,339,0,0)
{txt}
{com}. 
. matrix list MDrec
{res}
{txt}MDrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0   94   94   94   94   94   94   94   94   94   94   94   94  433  433  433

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 433  433  433  433  433  339  339  339  339    0    0
{reset}
{com}. 
. matrix MDexp = (0,0,0,0,0,0,0,0,607751,607751,607751,607751,607751,607751,607751,607751,607751,607751,607751,607751,2027210,2027210,2027210,2027210,2027210,2027210,2027210,2027210,1419459,1419459,1419459,1419459,0,0)
{txt}
{com}. 
. matrix list MDexp
{res}
{txt}MDexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0   607751   607751   607751   607751

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}  607751   607751   607751   607751   607751   607751   607751   607751  2027210  2027210  2027210  2027210

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 2027210  2027210  2027210  2027210  1419459  1419459  1419459  1419459        0        0
{reset}
{com}. 
. *MA
. 
. matrix MA = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list MA
{res}
{txt}MA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix MArec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,807,807,807,807,807,807,807,807,807,807,807,807,807,807,807,807,807,807)
{txt}
{com}. 
. matrix list MArec
{res}
{txt}MArec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  807  807  807  807  807  807  807

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 807  807  807  807  807  807  807  807  807  807  807
{reset}
{com}. 
. matrix MAexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656,6403656)
{txt}
{com}. 
. matrix list MAexp 
{res}
{txt}MAexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0        0  6403656  6403656  6403656  6403656  6403656  6403656  6403656  6403656

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 6403656  6403656  6403656  6403656  6403656  6403656  6403656  6403656  6403656  6403656
{reset}
{com}. 
. *MI
. 
. matrix MI = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list MI
{res}
{txt}MI[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix MIrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list MIrec
{res}
{txt}MIrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix MIexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list MIexp
{res}
{txt}MIexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *MN
. 
. matrix MN = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list MN
{res}
{txt}MN[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix MNrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list MNrec
{res}
{txt}MNrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix MNexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list MNexp
{res}
{txt}MNexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *MS
. 
. matrix MS = (0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list MS
{res}
{txt}MS[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix MSrec = (0,0,0,0,0,0,0,0,2177,2177,2177,2177,2177,2177,2177,2426,2426,2426,2426,2426,2426,2426,2426,2432,2432,2432,2613,2613,2613,2613,2686,2686,79,73)
{txt}
{com}. 
. matrix list MSrec
{res}
{txt}MSrec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0     0     0     0     0     0     0     0  2177  2177  2177  2177  2177  2177  2177  2426  2426  2426  2426

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 2426  2426  2426  2426  2432  2432  2432  2613  2613  2613  2613  2686  2686    79    73
{reset}
{com}. 
. matrix MSexp = (0,0,0,0,0,0,0,0,6682898,6682898,6682898,6682898,6682898,6682898,6682898,8955922,8955922,8955922,8955922,8955922,8955922,8955922,8955922,9023330,9023330,9023330,9540238,9540238,9540238,9540238,9713505,9713505,240675,173268)
{txt}
{com}. 
. matrix list MSexp 
{res}
{txt}MSexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0  6682898  6682898  6682898  6682898

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 6682898  6682898  6682898  8955922  8955922  8955922  8955922  8955922  8955922  8955922  8955922  9023330

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 9023330  9023330  9540238  9540238  9540238  9540238  9713505  9713505   240675   173268
{reset}
{com}. 
. *MO
. 
. matrix MO = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list MO
{res}
{txt}MO[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix MOrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,275,275,275,275,300,300,300,78,78,78,78,78,25,0)
{txt}
{com}. 
. matrix list MOrec
{res}
{txt}MOrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  275  275  275

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 275  300  300  300   78   78   78   78   78   25    0
{reset}
{com}. 
. matrix MOexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,356598,356598,356598,356598,538598,538598,538598,293840,293840,293840,293840,293840,182000,0)
{txt}
{com}. 
. matrix list MOexp
{res}
{txt}MOexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0       0       0  356598  356598  356598  356598  538598  538598  538598  293840

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 293840  293840  293840  293840  182000       0
{reset}
{com}. 
. *MT
. 
. matrix MT = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list MT
{res}
{txt}MT[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix MTrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,120,120,120,120,120,120,120,120,120,120)
{txt}
{com}. 
. matrix list MTrec
{res}
{txt}MTrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0  120  120  120  120  120  120  120  120  120  120
{reset}
{com}. 
. matrix MTexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,364000,364000,364000,364000,364000,364000,364000,364000,364000,364000)
{txt}
{com}. 
. matrix list MTexp
{res}
{txt}MTexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0       0       0       0       0       0       0  364000  364000  364000  364000

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 364000  364000  364000  364000  364000  364000
{reset}
{com}. 
. *NE
. 
. matrix NE = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0)
{txt}
{com}. 
. matrix list NE
{res}
{txt}NE[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    0    0    0    0
{reset}
{com}. 
. matrix NErec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NErec
{res}
{txt}NErec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NEexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3429000,3429000,3429000,3429000,3429000,3429000,3429000,3429000,3429000,3429000,3429000,3429000,3429000,0,0,0,0)
{txt}
{com}. 
. matrix list NEexp 
{res}
{txt}NEexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0        0        0  3429000  3429000  3429000  3429000  3429000  3429000  3429000

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 3429000  3429000  3429000  3429000  3429000  3429000        0        0        0        0
{reset}
{com}. 
. *NV
. 
. matrix NV = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NV
{res}
{txt}NV[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NVrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NVrec
{res}
{txt}NVrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NVexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NVexp
{res}
{txt}NVexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *NH 
. 
. matrix NH = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NH
{res}
{txt}NH[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NHrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NHrec
{res}
{txt}NHrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NHexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NHexp
{res}
{txt}NHexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *NJ
. 
. matrix NJ = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NJ
{res}
{txt}NJ[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NJrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NJrec
{res}
{txt}NJrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix NJexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list NJexp
{res}
{txt}NJexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *NM
. 
. matrix NM = (0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list NM
{res}
{txt}NM[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix NMrec = (0,0,0,0,0,0,0,0,0,0,0,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,40,40,40,40)
{txt}
{com}. 
. matrix list NMrec
{res}
{txt}NMrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0   30   30   30   30   30   30   30   30   30   30   30   30

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  30   30   30   30   30   30   30   40   40   40   40
{reset}
{com}. 
. matrix NMexp = (0,0,0,0,0,0,0,0,0,0,0,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,115550,144050,144050,144050,144050)
{txt}
{com}. 
. matrix list NMexp 
{res}
{txt}NMexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0  115550  115550  115550

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 115550  115550  115550  115550  115550  115550  115550  115550  115550  115550  115550  115550  115550  115550

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 115550  115550  144050  144050  144050  144050
{reset}
{com}. 
. *NY
. 
. matrix NY = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list NY 
{res}
{txt}NY[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix NYrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12055,12055,12055,12055,12055,12055,12229,12229,12229,12229,12229,12229,12229,12229,12229,12055,12055)
{txt}
{com}. 
. matrix list NYrec
{res}
{txt}NYrec[1,34]
       c1     c2     c3     c4     c5     c6     c7     c8     c9    c10    c11    c12    c13    c14    c15    c16
r1 {res}     0      0      0      0      0      0      0      0      0      0      0      0      0      0      0      0

{txt}      c17    c18    c19    c20    c21    c22    c23    c24    c25    c26    c27    c28    c29    c30    c31    c32
r1 {res}     0  12055  12055  12055  12055  12055  12055  12229  12229  12229  12229  12229  12229  12229  12229  12229

{txt}      c33    c34
r1 {res} 12055  12055
{reset}
{com}. 
. matrix NYexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,44265501,44265501,44265501,44265501,44265501,44265501,45119421,45119421,45119421,45119421,45119421,45119421,45119421,45119421,45119421,44265501,44265501)
{txt}
{com}. 
. matrix list NYexp
{res}
{txt}NYexp[1,34]
          c1        c2        c3        c4        c5        c6        c7        c8        c9       c10       c11
r1 {res}        0         0         0         0         0         0         0         0         0         0         0

{txt}         c12       c13       c14       c15       c16       c17       c18       c19       c20       c21       c22
r1 {res}        0         0         0         0         0         0  44265501  44265501  44265501  44265501  44265501

{txt}         c23       c24       c25       c26       c27       c28       c29       c30       c31       c32       c33
r1 {res} 44265501  45119421  45119421  45119421  45119421  45119421  45119421  45119421  45119421  45119421  44265501

{txt}         c34
r1 {res} 44265501
{reset}
{com}. 
. *NC
. 
. matrix NC = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list NC
{res}
{txt}NC[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix NCrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1507,2477,3325,3325,2006,2014,2014,2014,2014,2006,2006,3791,3791,2877,0,0)
{txt}
{com}. 
. matrix list NCrec
{res}
{txt}NCrec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0     0     0     0     0     0     0     0     0     0     0     0     0     0     0     0     0     0  1507

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 2477  3325  3325  2006  2014  2014  2014  2014  2006  2006  3791  3791  2877     0     0
{reset}
{com}. 
. matrix NCexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,183000,10907431,13921247,13921247,15989358,16123758,16123758,16123758,16123758,15989358,15989358,27345319,27345319,23900393,0,0)
{txt}
{com}. 
. matrix list NCexp
{res}
{txt}NCexp[1,34]
          c1        c2        c3        c4        c5        c6        c7        c8        c9       c10       c11
r1 {res}        0         0         0         0         0         0         0         0         0         0         0

{txt}         c12       c13       c14       c15       c16       c17       c18       c19       c20       c21       c22
r1 {res}        0         0         0         0         0         0         0    183000  10907431  13921247  13921247

{txt}         c23       c24       c25       c26       c27       c28       c29       c30       c31       c32       c33
r1 {res} 15989358  16123758  16123758  16123758  16123758  15989358  15989358  27345319  27345319  23900393         0

{txt}         c34
r1 {res}        0
{reset}
{com}. 
. *ND
. 
. matrix ND = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list ND
{res}
{txt}ND[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix NDrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,285,285,285,285,285,285,285,285,285,285,285,285,285,285,0,0)
{txt}
{com}. 
. matrix list NDrec
{res}
{txt}NDrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  285  285  285  285  285

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 285  285  285  285  285  285  285  285  285    0    0
{reset}
{com}. 
. matrix NDexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,298125,298125,298125,298125,298125,298125,298125,298125,298125,298125,298125,298125,298125,298125,0,0)
{txt}
{com}. 
. matrix list NDexp
{res}
{txt}NDexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0  298125  298125  298125  298125  298125  298125  298125  298125  298125  298125

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 298125  298125  298125  298125       0       0
{reset}
{com}. 
. *OH
. 
. matrix OH = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list OH
{res}
{txt}OH[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix OHrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list OHrec
{res}
{txt}OHrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix OHexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6825000,6825000,4200000,4200000,4200000,4200000,4200000,4200000)
{txt}
{com}. 
. matrix list OHexp 
{res}
{txt}OHexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res}       0        0  6825000  6825000  4200000  4200000  4200000  4200000  4200000  4200000
{reset}
{com}. 
. *OK
. 
. matrix OK = (0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list OK
{res}
{txt}OK[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix OKrec = (0,0,101,101,101,101,101,101,101,101,101,101,101,101,101,101,101,136,136,136,136,136,136,136,136,136,136,136,136,136,136,136,136,136)
{txt}
{com}. 
. matrix list OKrec
{res}
{txt}OKrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0  101  101  101  101  101  101  101  101  101  101  101  101  101  101  101  136  136  136  136  136  136

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 136  136  136  136  136  136  136  136  136  136  136
{reset}
{com}. 
. matrix OKexp = (0,0,116325,116325,116325,116325,116325,116325,116325,116325,116325,116325,116325,116325,116325,116325,116325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325,494325)
{txt}
{com}. 
. matrix list OKexp
{res}
{txt}OKexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0  116325  116325  116325  116325  116325  116325  116325  116325  116325  116325  116325  116325

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 116325  116325  116325  494325  494325  494325  494325  494325  494325  494325  494325  494325  494325  494325

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 494325  494325  494325  494325  494325  494325
{reset}
{com}. 
. *OR
. 
. matrix OR = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list OR
{res}
{txt}OR[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix ORrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ORrec
{res}
{txt}ORrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix ORexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list ORexp 
{res}
{txt}ORexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *PA
. 
. matrix PA = (0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list PA 
{res}
{txt}PA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix PArec = (0,138,138,138,138,2168,2168,2168,2168,2168,2168,2168,2168,2168,2168,138,138,138,138,138,138,138,138,138,138,138,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list PArec
{res}
{txt}PArec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0   138   138   138   138  2168  2168  2168  2168  2168  2168  2168  2168  2168  2168   138   138   138   138

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res}  138   138   138   138   138   138   138     0     0     0     0     0     0     0     0
{reset}
{com}. 
. matrix PAexp = (0,432630,432630,432630,432630,6576526,6576526,6576526,6576526,6576526,6576526,6576526,6576526,6576526,6576526,432630,432630,432630,432630,432630,432630,432630,432630,432630,432630,432630,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list PAexp 
{res}
{txt}PAexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0   432630   432630   432630   432630  6576526  6576526  6576526  6576526  6576526  6576526  6576526

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 6576526  6576526  6576526   432630   432630   432630   432630   432630   432630   432630   432630   432630

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res}  432630   432630        0        0        0        0        0        0        0        0
{reset}
{com}. 
. *RI
. 
. matrix RI = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list RI
{res}
{txt}RI[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix RIrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list RIrec
{res}
{txt}RIrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix RIexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list RIexp 
{res}
{txt}RIexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *SC
. 
. matrix SC = (0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list SC
{res}
{txt}SC[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix SCrec = (0,1130,1130,1130,1130,1130,1130,1130,1130,1130,1130,1130,1130,1130,1130,1130,1305,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405,1405)
{txt}
{com}. 
. matrix list SCrec
{res}
{txt}SCrec[1,34]
      c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11   c12   c13   c14   c15   c16   c17   c18   c19
r1 {res}    0  1130  1130  1130  1130  1130  1130  1130  1130  1130  1130  1130  1130  1130  1130  1130  1305  1405  1405

{txt}     c20   c21   c22   c23   c24   c25   c26   c27   c28   c29   c30   c31   c32   c33   c34
r1 {res} 1405  1405  1405  1405  1405  1405  1405  1405  1405  1405  1405  1405  1405  1405  1405
{reset}
{com}. 
. matrix SCexp = (0,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,5367500,6785000,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061,8651061)
{txt}
{com}. 
. matrix list SCexp 
{res}
{txt}SCexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0  5367500  5367500  5367500  5367500  5367500  5367500  5367500  5367500  5367500  5367500  5367500

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res} 5367500  5367500  5367500  5367500  6785000  8651061  8651061  8651061  8651061  8651061  8651061  8651061

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 8651061  8651061  8651061  8651061  8651061  8651061  8651061  8651061  8651061  8651061
{reset}
{com}. 
. *SD
. 
. matrix SD = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list SD
{res}
{txt}SD[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix SDrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,73,73,73,73,73,73,73,73,73,73,117,117,117,117)
{txt}
{com}. 
. matrix list SDrec 
{res}
{txt}SDrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0   73   73   73

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  73   73   73   73   73   73   73  117  117  117  117
{reset}
{com}. 
. matrix SDexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,434350,434350,434350,434350,434350,434350,434350,434350,434350,434350,1859350,1859350,1859350,1859350)
{txt}
{com}. 
. matrix list SDexp 
{res}
{txt}SDexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0        0        0        0        0        0   434350   434350   434350   434350

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res}  434350   434350   434350   434350   434350   434350  1859350  1859350  1859350  1859350
{reset}
{com}. 
. *TN
. 
. matrix TN = (0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list TN
{res}
{txt}TN[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix TNrec = (0,0,0,0,0,0,0,0,98,98,98,98,98,98,98,98,98,98,274,274,274,274,274,274,293,293,293,293,293,293,293,293,0,0)
{txt}
{com}. 
. matrix list TNrec
{res}
{txt}TNrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0   98   98   98   98   98   98   98   98   98   98  274  274  274  274  274

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 274  293  293  293  293  293  293  293  293    0    0
{reset}
{com}. 
. matrix TNexp = (0,0,0,0,0,0,0,0,502387,502387,502387,502387,502387,502387,502387,502387,502387,502387,1252392,1252392,1252392,1252392,1252392,1252392,1290925,1290925,1290925,1290925,1290925,1290925,1290925,1290925,0,0)
{txt}
{com}. 
. matrix list TNexp 
{res}
{txt}TNexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0   502387   502387   502387   502387

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}  502387   502387   502387   502387   502387   502387  1252392  1252392  1252392  1252392  1252392  1252392

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 1290925  1290925  1290925  1290925  1290925  1290925  1290925  1290925        0        0
{reset}
{com}. 
. *TX
. 
. matrix TX = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list TX
{res}
{txt}TX[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix TXrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,820,820,820,820,820,820,820,820,820,820,820,820,820,0,0)
{txt}
{com}. 
. matrix list TXrec 
{res}
{txt}TXrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  820  820  820  820

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 820  820  820  820  820  820  820  820  820    0    0
{reset}
{com}. 
. matrix TXexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3899257,3899257,3899257,3899257,3899257,3899257,3899257,3899257,3899257,3899257,3899257,3899257,3899257,0,0)
{txt}
{com}. 
. matrix list TXexp 
{res}
{txt}TXexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0        0        0        0        0        0        0  3899257  3899257  3899257  3899257  3899257

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 3899257  3899257  3899257  3899257  3899257  3899257  3899257  3899257        0        0
{reset}
{com}. 
. *UT
. 
. matrix UT = (0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list UT
{res}
{txt}UT[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix UTrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,419,419,419,419,419,465,465,465,465,465,465,465,465,465,465,465,465,465,465,46,46)
{txt}
{com}. 
. matrix list UTrec
{res}
{txt}UTrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0  419  419  419  419  419  465  465  465  465  465

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 465  465  465  465  465  465  465  465  465   46   46
{reset}
{com}. 
. matrix UTexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,1411229,1411229,1411229,1411229,1411229,2331229,2331229,2331229,2331229,2331229,2331229,2331229,8426077,8426077,8426077,8426077,8426077,8426077,8426077,7014848,7014848)
{txt}
{com}. 
. matrix list UTexp 
{res}
{txt}UTexp[1,34]
         c1       c2       c3       c4       c5       c6       c7       c8       c9      c10      c11      c12
r1 {res}       0        0        0        0        0        0        0        0        0        0        0        0

{txt}        c13      c14      c15      c16      c17      c18      c19      c20      c21      c22      c23      c24
r1 {res}       0  1411229  1411229  1411229  1411229  1411229  2331229  2331229  2331229  2331229  2331229  2331229

{txt}        c25      c26      c27      c28      c29      c30      c31      c32      c33      c34
r1 {res} 2331229  8426077  8426077  8426077  8426077  8426077  8426077  8426077  7014848  7014848
{reset}
{com}. 
. *VT
. 
. matrix VT = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list VT
{res}
{txt}VT[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix VTrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list VTrec
{res}
{txt}VTrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. matrix VTexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)
{txt}
{com}. 
. matrix list VTexp
{res}
{txt}VTexp[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   0    0    0    0    0    0    0    0    0    0    0
{reset}
{com}. 
. *VA
. 
. matrix VA = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list VA
{res}
{txt}VA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix VArec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,277,277,277,277,277,277,277,277,277,277,277,277,277,0,0)
{txt}
{com}. 
. matrix list VArec 
{res}
{txt}VArec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0  277  277  277  277

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res} 277  277  277  277  277  277  277  277  277    0    0
{reset}
{com}. 
. matrix VAexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,928490,928490,928490,928490,928490,928490,928490,928490,928490,928490,928490,928490,928490,0,0)
{txt}
{com}. 
. matrix list VAexp 
{res}
{txt}VAexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0       0       0       0       0  928490  928490  928490  928490  928490  928490  928490  928490  928490

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 928490  928490  928490  928490       0       0
{reset}
{com}. 
. *WA 
. 
. matrix WA = (1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list WA
{res}
{txt}WA[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix WArec = (0,0,0,0,0,0,0,0,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,87,0,0)
{txt}
{com}. 
. matrix list WArec 
{res}
{txt}WArec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0   87   87   87   87   87   87   87   87   87   87   87   87   87   87   87

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  87   87   87   87   87   87   87   87   87    0    0
{reset}
{com}. 
. matrix WAexp = (0,0,0,0,0,0,0,0,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,386308,0,0)
{txt}
{com}. 
. matrix list WAexp 
{res}
{txt}WAexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0  386308  386308  386308  386308  386308  386308

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 386308  386308  386308  386308  386308  386308  386308  386308  386308  386308  386308  386308  386308  386308

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 386308  386308  386308  386308       0       0
{reset}
{com}. 
. *WV
. 
. matrix WV = (0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list WV
{res}
{txt}WV[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix WVrec = (0,0,0,0,0,0,0,0,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,64,0,0)
{txt}
{com}. 
. matrix list WVrec
{res}
{txt}WVrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0   64   64   64   64   64   64   64   64   64   64   64   64   64   64   64

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  64   64   64   64   64   64   64   64   64    0    0
{reset}
{com}. 
. matrix WVexp = (0,0,0,0,0,0,0,0,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,269828,0,0)
{txt}
{com}. 
. matrix list WVexp 
{res}
{txt}WVexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0  269828  269828  269828  269828  269828  269828

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 269828  269828  269828  269828  269828  269828  269828  269828  269828  269828  269828  269828  269828  269828

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 269828  269828  269828  269828       0       0
{reset}
{com}. 
. *WI
. 
. matrix WI = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0)
{txt}
{com}. 
. matrix list WI
{res}
{txt}WI[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    0    0
{reset}
{com}. 
. matrix WIrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,91,91,91,91,91,91,91,91,91,91,91,91,91,91,91,91,91,0,0)
{txt}
{com}. 
. matrix list WIrec
{res}
{txt}WIrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0   91   91   91   91   91   91   91   91

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  91   91   91   91   91   91   91   91   91    0    0
{reset}
{com}. 
. matrix WIexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,244258,0,0)
{txt}
{com}. 
. matrix list WIexp 
{res}
{txt}WIexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res}      0  244258  244258  244258  244258  244258  244258  244258  244258  244258  244258  244258  244258  244258

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 244258  244258  244258  244258       0       0
{reset}
{com}. 
. *WY
. 
. matrix WY = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1)
{txt}
{com}. 
. matrix list WY
{res}
{txt}WY[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1    1    1    1    1    1    1    1

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}   1    1    1    1    1    1    1    1    1    1    1
{reset}
{com}. 
. matrix WYrec = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,0)
{txt}
{com}. 
. matrix list WYrec
{res}
{txt}WYrec[1,34]
     c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18  c19  c20  c21  c22  c23
r1 {res}   0    0    0    0    0    0    0    0    0    0    0    0    0    0   24   24   24   24   24   24   24   24   24

{txt}    c24  c25  c26  c27  c28  c29  c30  c31  c32  c33  c34
r1 {res}  24   24   24   24   24   24   24   24   24   24    0
{reset}
{com}. 
. matrix WYexp = (0,0,0,0,0,0,0,0,0,0,0,0,0,0,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,864000,0)
{txt}
{com}. 
. matrix list WYexp 
{res}
{txt}WYexp[1,34]
        c1      c2      c3      c4      c5      c6      c7      c8      c9     c10     c11     c12     c13     c14
r1 {res}      0       0       0       0       0       0       0       0       0       0       0       0       0       0

{txt}       c15     c16     c17     c18     c19     c20     c21     c22     c23     c24     c25     c26     c27     c28
r1 {res} 864000  864000  864000  864000  864000  864000  864000  864000  864000  864000  864000  864000  864000  864000

{txt}       c29     c30     c31     c32     c33     c34
r1 {res} 864000  864000  864000  864000  864000       0
{reset}
{com}. 
. *****create instruments*****
. 
. generate exp = 0
{txt}
{com}. 
. generate rec = 0
{txt}
{com}. 
. generate expend = 0 
{txt}
{com}. 
. *AL|01-16:1
. 
. matrix al94 = ninetyfour * AL'
{txt}
{com}. 
. matrix alrec94 = ninetyfour * ALrec'
{txt}
{com}. 
. matrix alexp94 = ninetyfour * ALexp'
{txt}
{com}. 
. 
. scalar AL94 = al94[1,1]
{txt}
{com}. 
. scalar ALrec94 = alrec94[1,1]
{txt}
{com}. 
. scalar ALexp94 = alexp94[1,1]
{txt}
{com}. 
. 
. replace exp = AL94 if highschoolstate == 1 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = ALrec94 if highschoolstate == 1 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = ALexp94 if highschoolstate == 1 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix al95 = ninetyfive * AL'
{txt}
{com}. 
. matrix alrec95 = ninetyfive * ALrec'
{txt}
{com}. 
. matrix alexp95 = ninetyfive * ALexp'
{txt}
{com}. 
. 
. scalar AL95 = al95[1,1]
{txt}
{com}. 
. scalar ALrec95 = alrec95[1,1]
{txt}
{com}. 
. scalar ALexp95 = alexp95[1,1]
{txt}
{com}. 
. 
. replace exp = AL95 if highschoolstate == 1 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = ALrec95 if highschoolstate == 1 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = ALexp95 if highschoolstate == 1 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix al96 = ninetysix * AL'
{txt}
{com}. 
. matrix alrec96 = ninetysix * ALrec'
{txt}
{com}. 
. matrix alexp96 = ninetysix * ALexp'
{txt}
{com}. 
. 
. scalar AL96 = al96[1,1]
{txt}
{com}. 
. scalar ALrec96 = alrec96[1,1]
{txt}
{com}. 
. scalar ALexp96 = alexp96[1,1]
{txt}
{com}. 
. 
. replace exp = AL96 if highschoolstate == 1 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = ALrec96 if highschoolstate == 1 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = ALexp96 if highschoolstate == 1 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix al97 = ninetyseven * AL'
{txt}
{com}. 
. matrix alrec97 = ninetyseven * ALrec'
{txt}
{com}. 
. matrix alexp97 = ninetyseven * ALexp'
{txt}
{com}. 
. 
. scalar AL97 = al97[1,1]
{txt}
{com}. 
. scalar ALrec97 = alrec97[1,1]
{txt}
{com}. 
. scalar ALexp97 = alexp97[1,1]
{txt}
{com}. 
. 
. replace exp = AL97 if highschoolstate == 1 & cohort == 1997
{txt}(14 real changes made)

{com}. 
. replace rec = ALrec97 if highschoolstate == 1 & cohort == 1997
{txt}(14 real changes made)

{com}. 
. replace expend = ALexp97 if highschoolstate == 1 & cohort == 1997
{txt}(14 real changes made)

{com}. 
. 
. matrix al98 = ninetyeight * AL'
{txt}
{com}. 
. matrix alrec98 = ninetyeight * ALrec'
{txt}
{com}. 
. matrix alexp98 = ninetyeight * ALexp'
{txt}
{com}. 
. 
. scalar AL98 = al98[1,1]
{txt}
{com}. 
. scalar ALrec98 = alrec98[1,1]
{txt}
{com}. 
. scalar ALexp98 = alexp98[1,1]
{txt}
{com}. 
. 
. replace exp = AL98 if highschoolstate == 1 & cohort == 1998
{txt}(14 real changes made)

{com}. 
. replace rec = ALrec98 if highschoolstate == 1 & cohort == 1998
{txt}(14 real changes made)

{com}. 
. replace expend = ALexp98 if highschoolstate == 1 & cohort == 1998
{txt}(14 real changes made)

{com}. 
. *AK|None:2
. 
. *AZ|11-14:3
. 
. matrix az94 = ninetyfour * AZ'
{txt}
{com}. 
. matrix azrec94 = ninetyfour * AZrec'
{txt}
{com}. 
. matrix azexp94 = ninetyfour * AZexp'
{txt}
{com}. 
. 
. scalar AZ94 = az94[1,1]
{txt}
{com}. 
. scalar AZrec94 = azrec94[1,1]
{txt}
{com}. 
. scalar AZexp94 = azexp94[1,1]
{txt}
{com}. 
. 
. replace exp = AZ94 if highschoolstate == 3 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = AZrec94 if highschoolstate == 3 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = AZexp94 if highschoolstate == 3 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix az95 = ninetyfive * AZ'
{txt}
{com}. 
. matrix azrec95 = ninetyfive * AZrec'
{txt}
{com}. 
. matrix azexp95 = ninetyfive * AZexp'
{txt}
{com}. 
. 
. scalar AZ95 = az95[1,1]
{txt}
{com}. 
. scalar AZrec95 = azrec95[1,1]
{txt}
{com}. 
. scalar AZexp95 = azexp95[1,1]
{txt}
{com}. 
. 
. replace exp = AZ95 if highschoolstate == 3 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = AZrec95 if highschoolstate == 3 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = AZexp95 if highschoolstate == 3 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix az96 = ninetysix * AZ'
{txt}
{com}. 
. matrix azrec96 = ninetysix * AZrec'
{txt}
{com}. 
. matrix azexp96 = ninetysix * AZexp'
{txt}
{com}. 
. 
. scalar AZ96 = az96[1,1]
{txt}
{com}. 
. scalar AZrec96 = azrec96[1,1]
{txt}
{com}. 
. scalar AZexp96 = azexp96[1,1]
{txt}
{com}. 
. 
. replace exp = AZ96 if highschoolstate == 3 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = AZrec96 if highschoolstate == 3 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = AZexp96 if highschoolstate == 3 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix az97 = ninetyseven * AZ'
{txt}
{com}. 
. matrix azrec97 = ninetyseven * AZrec'
{txt}
{com}. 
. matrix azexp97 = ninetyseven * AZexp'
{txt}
{com}. 
. 
. scalar AZ97 = az97[1,1]
{txt}
{com}. 
. scalar AZrec97 = azrec97[1,1]
{txt}
{com}. 
. scalar AZexp97 = azexp97[1,1]
{txt}
{com}. 
. 
. replace exp = AZ97 if highschoolstate == 3 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = AZrec97 if highschoolstate == 3 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = AZexp97 if highschoolstate == 3 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix az98 = ninetyeight * AZ'
{txt}
{com}. 
. matrix azrec98 = ninetyeight * AZrec'
{txt}
{com}. 
. matrix azexp98 = ninetyeight * AZexp'
{txt}
{com}. 
. 
. scalar AZ98 = az98[1,1]
{txt}
{com}. 
. scalar AZrec98 = azrec98[1,1]
{txt}
{com}. 
. scalar AZexp98 = azexp98[1,1]
{txt}
{com}. 
. 
. replace exp = AZ98 if highschoolstate == 3 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = AZrec98 if highschoolstate == 3 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = AZexp98 if highschoolstate == 3 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *AR|94-14:4
. 
. matrix ar94 = ninetyfour * AR'
{txt}
{com}. 
. matrix arrec94 = ninetyfour * ARrec'
{txt}
{com}. 
. matrix arexp94 = ninetyfour * ARexp'
{txt}
{com}. 
. 
. scalar AR94 = ar94[1,1]
{txt}
{com}. 
. scalar ARrec94 = arrec94[1,1]
{txt}
{com}. 
. scalar ARexp94 = arexp94[1,1]
{txt}
{com}. 
. 
. replace exp = AR94 if highschoolstate == 4 & cohort == 1994
{txt}(6 real changes made)

{com}. 
. replace rec = ARrec94 if highschoolstate == 4 & cohort == 1994
{txt}(6 real changes made)

{com}. 
. replace expend = ARexp94 if highschoolstate == 4 & cohort == 1994
{txt}(6 real changes made)

{com}. 
. 
. matrix ar95 = ninetyfive * AR'
{txt}
{com}. 
. matrix arrec95 = ninetyfive * ARrec'
{txt}
{com}. 
. matrix arexp95 = ninetyfive * ARexp'
{txt}
{com}. 
. 
. scalar AR95 = ar95[1,1]
{txt}
{com}. 
. scalar ARrec95 = arrec95[1,1]
{txt}
{com}. 
. scalar ARexp95 = arexp95[1,1]
{txt}
{com}. 
. 
. replace exp = AR95 if highschoolstate == 4 & cohort == 1995
{txt}(7 real changes made)

{com}. 
. replace rec = ARrec95 if highschoolstate == 4 & cohort == 1995
{txt}(7 real changes made)

{com}. 
. replace expend = ARexp95 if highschoolstate == 4 & cohort == 1995
{txt}(7 real changes made)

{com}. 
. 
. matrix ar96 = ninetysix * AR'
{txt}
{com}. 
. matrix arrec96 = ninetysix * ARrec'
{txt}
{com}. 
. matrix arexp96 = ninetysix * ARexp'
{txt}
{com}. 
. 
. scalar AR96 = ar96[1,1]
{txt}
{com}. 
. scalar ARrec96 = arrec96[1,1]
{txt}
{com}. 
. scalar ARexp96 = arexp96[1,1]
{txt}
{com}. 
. 
. replace exp = AR96 if highschoolstate == 4 & cohort == 1996
{txt}(5 real changes made)

{com}. 
. replace rec = ARrec96 if highschoolstate == 4 & cohort == 1996
{txt}(5 real changes made)

{com}. 
. replace expend = ARexp96 if highschoolstate == 4 & cohort == 1996
{txt}(5 real changes made)

{com}. 
. 
. matrix ar97 = ninetyseven * AR'
{txt}
{com}. 
. matrix arrec97 = ninetyseven * ARrec'
{txt}
{com}. 
. matrix arexp97 = ninetyseven * ARexp'
{txt}
{com}. 
. 
. scalar AR97 = ar97[1,1]
{txt}
{com}. 
. scalar ARrec97 = arrec97[1,1]
{txt}
{com}. 
. scalar ARexp97 = arexp97[1,1]
{txt}
{com}. 
. 
. replace exp = AR97 if highschoolstate == 4 & cohort == 1997
{txt}(5 real changes made)

{com}. 
. replace rec = ARrec97 if highschoolstate == 4 & cohort == 1997
{txt}(5 real changes made)

{com}. 
. replace expend = ARexp97 if highschoolstate == 4 & cohort == 1997
{txt}(5 real changes made)

{com}. 
. 
. matrix ar98 = ninetyeight * AR'
{txt}
{com}. 
. matrix arrec98 = ninetyeight * ARrec'
{txt}
{com}. 
. matrix arexp98 = ninetyeight * ARexp'
{txt}
{com}. 
. 
. scalar AR98 = ar98[1,1]
{txt}
{com}. 
. scalar ARrec98 = arrec98[1,1]
{txt}
{com}. 
. scalar ARexp98 = arexp98[1,1]
{txt}
{com}. 
. 
. replace exp = AR98 if highschoolstate == 4 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace rec = ARrec98 if highschoolstate == 4 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace expend = ARexp98 if highschoolstate == 4 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. *CA|83-16:5
. 
. matrix ca94 = ninetyfour * CA'
{txt}
{com}. 
. matrix carec94 = ninetyfour * CArec'
{txt}
{com}. 
. matrix caexp94 = ninetyfour * CAexp'
{txt}
{com}. 
. 
. scalar CA94 = ca94[1,1]
{txt}
{com}. 
. scalar CArec94 = carec94[1,1]
{txt}
{com}. 
. scalar CAexp94 = caexp94[1,1]
{txt}
{com}. 
. 
. replace exp = CA94 if highschoolstate == 5 & cohort == 1994
{txt}(107 real changes made)

{com}. 
. replace rec = CArec94 if highschoolstate == 5 & cohort == 1994
{txt}(107 real changes made)

{com}. 
. replace expend = CAexp94 if highschoolstate == 5 & cohort == 1994
{txt}(107 real changes made)

{com}. 
. 
. matrix ca95 = ninetyfive * CA'
{txt}
{com}. 
. matrix carec95 = ninetyfive * CArec'
{txt}
{com}. 
. matrix caexp95 = ninetyfive * CAexp'
{txt}
{com}. 
. 
. scalar CA95 = ca95[1,1]
{txt}
{com}. 
. scalar CArec95 = carec95[1,1]
{txt}
{com}. 
. scalar CAexp95 = caexp95[1,1]
{txt}
{com}. 
. 
. replace exp = CA95 if highschoolstate == 5 & cohort == 1995
{txt}(95 real changes made)

{com}. 
. replace rec = CArec95 if highschoolstate == 5 & cohort == 1995
{txt}(95 real changes made)

{com}. 
. replace expend = CAexp95 if highschoolstate == 5 & cohort == 1995
{txt}(95 real changes made)

{com}. 
. 
. matrix ca96 = ninetysix * CA'
{txt}
{com}. 
. matrix carec96 = ninetysix * CArec'
{txt}
{com}. 
. matrix caexp96 = ninetysix * CAexp'
{txt}
{com}. 
. 
. scalar CA96 = ca96[1,1]
{txt}
{com}. 
. scalar CArec96 = carec96[1,1]
{txt}
{com}. 
. scalar CAexp96 = caexp96[1,1]
{txt}
{com}. 
. 
. replace exp = CA96 if highschoolstate == 5 & cohort == 1996
{txt}(71 real changes made)

{com}. 
. replace rec = CArec96 if highschoolstate == 5 & cohort == 1996
{txt}(71 real changes made)

{com}. 
. replace expend = CAexp96 if highschoolstate == 5 & cohort == 1996
{txt}(71 real changes made)

{com}. 
. 
. matrix ca97 = ninetyseven * CA'
{txt}
{com}. 
. matrix carec97 = ninetyseven * CArec'
{txt}
{com}. 
. matrix caexp97 = ninetyseven * CAexp'
{txt}
{com}. 
. 
. scalar CA97 = ca97[1,1]
{txt}
{com}. 
. scalar CArec97 = carec97[1,1]
{txt}
{com}. 
. scalar CAexp97 = caexp97[1,1]
{txt}
{com}. 
. 
. replace exp = CA97 if highschoolstate == 5 & cohort == 1997
{txt}(70 real changes made)

{com}. 
. replace rec = CArec97 if highschoolstate == 5 & cohort == 1997
{txt}(70 real changes made)

{com}. 
. replace expend = CAexp97 if highschoolstate == 5 & cohort == 1997
{txt}(70 real changes made)

{com}. 
. 
. matrix ca98 = ninetyeight * CA'
{txt}
{com}. 
. matrix carec98 = ninetyeight * CArec'
{txt}
{com}. 
. matrix caexp98 = ninetyeight * CAexp'
{txt}
{com}. 
. 
. scalar CA98 = ca98[1,1]
{txt}
{com}. 
. scalar CArec98 = carec98[1,1]
{txt}
{com}. 
. scalar CAexp98 = caexp98[1,1]
{txt}
{com}. 
. 
. replace exp = CA98 if highschoolstate == 5 & cohort == 1998
{txt}(71 real changes made)

{com}. 
. replace rec = CArec98 if highschoolstate == 5 & cohort == 1998
{txt}(71 real changes made)

{com}. 
. replace expend = CAexp98 if highschoolstate == 5 & cohort == 1998
{txt}(71 real changes made)

{com}. 
. *CO|01-08:6
. 
. matrix co94 = ninetyfour * CO'
{txt}
{com}. 
. matrix corec94 = ninetyfour * COrec'
{txt}
{com}. 
. matrix coexp94 = ninetyfour * COexp'
{txt}
{com}. 
. 
. scalar CO94 = co94[1,1]
{txt}
{com}. 
. scalar COrec94 = corec94[1,1]
{txt}
{com}. 
. scalar COexp94 = coexp94[1,1]
{txt}
{com}. 
. 
. replace exp = CO94 if highschoolstate == 6 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = COrec94 if highschoolstate == 6 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = COexp94 if highschoolstate == 6 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix co95 = ninetyfive * CO'
{txt}
{com}. 
. matrix corec95 = ninetyfive * COrec'
{txt}
{com}. 
. matrix coexp95 = ninetyfive * COexp'
{txt}
{com}. 
. 
. scalar CO95 = co95[1,1]
{txt}
{com}. 
. scalar COrec95 = corec95[1,1]
{txt}
{com}. 
. scalar COexp95 = coexp95[1,1]
{txt}
{com}. 
. 
. replace exp = CO95 if highschoolstate == 6 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = COrec95 if highschoolstate == 6 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = COexp95 if highschoolstate == 6 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix co96 = ninetysix * CO'
{txt}
{com}. 
. matrix corec96 = ninetysix * COrec'
{txt}
{com}. 
. matrix coexp96 = ninetysix * COexp'
{txt}
{com}. 
. 
. scalar CO96 = co96[1,1]
{txt}
{com}. 
. scalar COrec96 = corec96[1,1]
{txt}
{com}. 
. scalar COexp96 = coexp96[1,1]
{txt}
{com}. 
. 
. replace exp = CO96 if highschoolstate == 6 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = COrec96 if highschoolstate == 6 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = COexp96 if highschoolstate == 6 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix co97 = ninetyseven * CO'
{txt}
{com}. 
. matrix corec97 = ninetyseven * COrec'
{txt}
{com}. 
. matrix coexp97 = ninetyseven * COexp'
{txt}
{com}. 
. 
. scalar CO97 = co97[1,1]
{txt}
{com}. 
. scalar COrec97 = corec97[1,1]
{txt}
{com}. 
. scalar COexp97 = coexp97[1,1]
{txt}
{com}. 
. 
. replace exp = CO97 if highschoolstate == 6 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace rec = COrec97 if highschoolstate == 6 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace expend = COexp97 if highschoolstate == 6 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. 
. matrix co98 = ninetyeight * CO'
{txt}
{com}. 
. matrix corec98 = ninetyeight * COrec'
{txt}
{com}. 
. matrix coexp98 = ninetyeight * COexp'
{txt}
{com}. 
. 
. scalar CO98 = co98[1,1]
{txt}
{com}. 
. scalar COrec98 = corec98[1,1]
{txt}
{com}. 
. scalar COexp98 = coexp98[1,1]
{txt}
{com}. 
. 
. replace exp = CO98 if highschoolstate == 6 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. replace rec = COrec98 if highschoolstate == 6 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. replace expend = COexp98 if highschoolstate == 6 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. *CT| 83-14:7
. 
. matrix ct94 = ninetyfour * CT'
{txt}
{com}. 
. matrix ctrec94 = ninetyfour * CTrec'
{txt}
{com}. 
. matrix ctexp94 = ninetyfour * CTexp'
{txt}
{com}. 
. 
. scalar CT94 = ct94[1,1]
{txt}
{com}. 
. scalar CTrec94 = ctrec94[1,1]
{txt}
{com}. 
. scalar CTexp94 = ctexp94[1,1]
{txt}
{com}. 
. 
. replace exp = CT94 if highschoolstate == 7 & cohort == 1994
{txt}(11 real changes made)

{com}. 
. replace rec = CTrec94 if highschoolstate == 7 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = CTexp94 if highschoolstate == 7 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ct95 = ninetyfive * CT'
{txt}
{com}. 
. matrix ctrec95 = ninetyfive * CTrec'
{txt}
{com}. 
. matrix ctexp95 = ninetyfive * CTexp'
{txt}
{com}. 
. 
. scalar CT95 = ct95[1,1]
{txt}
{com}. 
. scalar CTrec95 = ctrec95[1,1]
{txt}
{com}. 
. scalar CTexp95 = ctexp95[1,1]
{txt}
{com}. 
. 
. replace exp = CT95 if highschoolstate == 7 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. replace rec = CTrec95 if highschoolstate == 7 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = CTexp95 if highschoolstate == 7 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix ct96 = ninetysix * CT'
{txt}
{com}. 
. matrix ctrec96 = ninetysix * CTrec'
{txt}
{com}. 
. matrix ctexp96 = ninetysix * CTexp'
{txt}
{com}. 
. 
. scalar CT96 = ct96[1,1]
{txt}
{com}. 
. scalar CTrec96 = ctrec96[1,1]
{txt}
{com}. 
. scalar CTexp96 = ctexp96[1,1]
{txt}
{com}. 
. 
. replace exp = CT96 if highschoolstate == 7 & cohort == 1996
{txt}(6 real changes made)

{com}. 
. replace rec = CTrec96 if highschoolstate == 7 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = CTexp96 if highschoolstate == 7 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix ct97 = ninetyseven * CT'
{txt}
{com}. 
. matrix ctrec97 = ninetyseven * CTrec'
{txt}
{com}. 
. matrix ctexp97 = ninetyseven * CTexp'
{txt}
{com}. 
. 
. scalar CT97 = ct97[1,1]
{txt}
{com}. 
. scalar CTrec97 = ctrec97[1,1]
{txt}
{com}. 
. scalar CTexp97 = ctexp97[1,1]
{txt}
{com}. 
. 
. replace exp = CT97 if highschoolstate == 7 & cohort == 1997
{txt}(8 real changes made)

{com}. 
. replace rec = CTrec97 if highschoolstate == 7 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = CTexp97 if highschoolstate == 7 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix ct98 = ninetyeight * CT'
{txt}
{com}. 
. matrix ctrec98 = ninetyeight * CTrec'
{txt}
{com}. 
. matrix ctexp98 = ninetyeight * CTexp'
{txt}
{com}. 
. 
. scalar CT98 = ct98[1,1]
{txt}
{com}. 
. scalar CTrec98 = ctrec98[1,1]
{txt}
{com}. 
. scalar CTexp98 = ctexp98[1,1]
{txt}
{com}. 
. 
. replace exp = CT98 if highschoolstate == 7 & cohort == 1998
{txt}(8 real changes made)

{com}. 
. replace rec = CTrec98 if highschoolstate == 7 & cohort == 1998
{txt}(8 real changes made)

{com}. 
. replace expend = CTexp98 if highschoolstate == 7 & cohort == 1998
{txt}(8 real changes made)

{com}. 
. *DE|84-16:8
. 
. matrix de94 = ninetyfour * DE'
{txt}
{com}. 
. matrix derec94 = ninetyfour * DErec'
{txt}
{com}. 
. matrix deexp94 = ninetyfour * DEexp'
{txt}
{com}. 
. 
. scalar DE94 = de94[1,1]
{txt}
{com}. 
. scalar DErec94 = derec94[1,1]
{txt}
{com}. 
. scalar DEexp94 = deexp94[1,1]
{txt}
{com}. 
. 
. replace exp = DE94 if highschoolstate == 8 & cohort == 1994
{txt}(7 real changes made)

{com}. 
. replace rec = DErec94 if highschoolstate == 8 & cohort == 1994
{txt}(7 real changes made)

{com}. 
. replace expend = DEexp94 if highschoolstate == 8 & cohort == 1994
{txt}(7 real changes made)

{com}. 
. 
. matrix de95 = ninetyfive * DE'
{txt}
{com}. 
. matrix derec95 = ninetyfive * DErec'
{txt}
{com}. 
. matrix deexp95 = ninetyfive * DEexp'
{txt}
{com}. 
. 
. scalar DE95 = de95[1,1]
{txt}
{com}. 
. scalar DErec95 = derec95[1,1]
{txt}
{com}. 
. scalar DEexp95 = deexp95[1,1]
{txt}
{com}. 
. 
. replace exp = DE95 if highschoolstate == 8 & cohort == 1995
{txt}(3 real changes made)

{com}. 
. replace rec = DErec95 if highschoolstate == 8 & cohort == 1995
{txt}(3 real changes made)

{com}. 
. replace expend = DEexp95 if highschoolstate == 8 & cohort == 1995
{txt}(3 real changes made)

{com}. 
. 
. matrix de96 = ninetysix * DE'
{txt}
{com}. 
. matrix derec96 = ninetysix * DErec'
{txt}
{com}. 
. matrix deexp96 = ninetysix * DEexp'
{txt}
{com}. 
. 
. scalar DE96 = de96[1,1]
{txt}
{com}. 
. scalar DErec96 = derec96[1,1]
{txt}
{com}. 
. scalar DEexp96 = deexp96[1,1]
{txt}
{com}. 
. 
. replace exp = DE96 if highschoolstate == 8 & cohort == 1996
{txt}(3 real changes made)

{com}. 
. replace rec = DErec96 if highschoolstate == 8 & cohort == 1996
{txt}(3 real changes made)

{com}. 
. replace expend = DEexp96 if highschoolstate == 8 & cohort == 1996
{txt}(3 real changes made)

{com}. 
. 
. matrix de97 = ninetyseven * DE'
{txt}
{com}. 
. matrix derec97 = ninetyseven * DErec'
{txt}
{com}. 
. matrix deexp97 = ninetyseven * DEexp'
{txt}
{com}. 
. 
. scalar DE97 = de97[1,1]
{txt}
{com}. 
. scalar DErec97 = derec97[1,1]
{txt}
{com}. 
. scalar DEexp97 = deexp97[1,1]
{txt}
{com}. 
. 
. replace exp = DE97 if highschoolstate == 8 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. replace rec = DErec97 if highschoolstate == 8 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. replace expend = DEexp97 if highschoolstate == 8 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. 
. matrix de98 = ninetyeight * DE'
{txt}
{com}. 
. matrix derec98 = ninetyeight * DErec'
{txt}
{com}. 
. matrix deexp98 = ninetyeight * DEexp'
{txt}
{com}. 
. 
. scalar DE98 = de98[1,1]
{txt}
{com}. 
. scalar DErec98 = derec98[1,1]
{txt}
{com}. 
. scalar DEexp98 = deexp98[1,1]
{txt}
{com}. 
. 
. replace exp = DE98 if highschoolstate == 8 & cohort == 1998
{txt}(2 real changes made)

{com}. 
. replace rec = DErec98 if highschoolstate == 8 & cohort == 1998
{txt}(2 real changes made)

{com}. 
. replace expend = DEexp98 if highschoolstate == 8 & cohort == 1998
{txt}(2 real changes made)

{com}. 
. *DC|None:9
. 
. *FL|91-14:10
. 
. matrix fl94 = ninetyfour * FL'
{txt}
{com}. 
. matrix flrec94 = ninetyfour * FLrec'
{txt}
{com}. 
. matrix flexp94 = ninetyfour * FLexp'
{txt}
{com}. 
. 
. scalar FL94 = fl94[1,1]
{txt}
{com}. 
. scalar FLrec94 = flrec94[1,1]
{txt}
{com}. 
. scalar FLexp94 = flexp94[1,1]
{txt}
{com}. 
. 
. replace exp = FL94 if highschoolstate == 10 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. replace rec = FLrec94 if highschoolstate == 10 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. replace expend = FLexp94 if highschoolstate == 10 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. 
. matrix fl95 = ninetyfive * FL'
{txt}
{com}. 
. matrix flrec95 = ninetyfive * FLrec'
{txt}
{com}. 
. matrix flexp95 = ninetyfive * FLexp'
{txt}
{com}. 
. 
. scalar FL95 = fl95[1,1]
{txt}
{com}. 
. scalar FLrec95 = flrec95[1,1]
{txt}
{com}. 
. scalar FLexp95 = flexp95[1,1]
{txt}
{com}. 
. 
. replace exp = FL95 if highschoolstate == 10 & cohort == 1995
{txt}(20 real changes made)

{com}. 
. replace rec = FLrec95 if highschoolstate == 10 & cohort == 1995
{txt}(20 real changes made)

{com}. 
. replace expend = FLexp95 if highschoolstate == 10 & cohort == 1995
{txt}(20 real changes made)

{com}. 
. 
. matrix fl96 = ninetysix * FL'
{txt}
{com}. 
. matrix flrec96 = ninetysix * FLrec'
{txt}
{com}. 
. matrix flexp96 = ninetysix * FLexp'
{txt}
{com}. 
. 
. scalar FL96 = fl96[1,1]
{txt}
{com}. 
. scalar FLrec96 = flrec96[1,1]
{txt}
{com}. 
. scalar FLexp96 = flexp96[1,1]
{txt}
{com}. 
. 
. replace exp = FL96 if highschoolstate == 10 & cohort == 1996
{txt}(21 real changes made)

{com}. 
. replace rec = FLrec96 if highschoolstate == 10 & cohort == 1996
{txt}(21 real changes made)

{com}. 
. replace expend = FLexp96 if highschoolstate == 10 & cohort == 1996
{txt}(21 real changes made)

{com}. 
. 
. matrix fl97 = ninetyseven * FL'
{txt}
{com}. 
. matrix flrec97 = ninetyseven * FLrec'
{txt}
{com}. 
. matrix flexp97 = ninetyseven * FLexp'
{txt}
{com}. 
. 
. scalar FL97 = fl97[1,1]
{txt}
{com}. 
. scalar FLrec97 = flrec97[1,1]
{txt}
{com}. 
. scalar FLexp97 = flexp97[1,1]
{txt}
{com}. 
. 
. replace exp = FL97 if highschoolstate == 10 & cohort == 1997
{txt}(16 real changes made)

{com}. 
. replace rec = FLrec97 if highschoolstate == 10 & cohort == 1997
{txt}(16 real changes made)

{com}. 
. replace expend = FLexp97 if highschoolstate == 10 & cohort == 1997
{txt}(16 real changes made)

{com}. 
. 
. matrix fl98 = ninetyeight * FL'
{txt}
{com}. 
. matrix flrec98 = ninetyeight * FLrec'
{txt}
{com}. 
. matrix flexp98 = ninetyeight * FLexp'
{txt}
{com}. 
. 
. scalar FL98 = fl98[1,1]
{txt}
{com}. 
. scalar FLrec98 = flrec98[1,1]
{txt}
{com}. 
. scalar FLexp98 = flexp98[1,1]
{txt}
{com}. 
. 
. replace exp = FL98 if highschoolstate == 10 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. replace rec = FLrec98 if highschoolstate == 10 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. replace expend = FLexp98 if highschoolstate == 10 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. *GA|95-11:11
. 
. matrix ga94 = ninetyfour * GA'
{txt}
{com}. 
. matrix garec94 = ninetyfour * GArec'
{txt}
{com}. 
. matrix gaexp94 = ninetyfour * GAexp'
{txt}
{com}. 
. 
. scalar GA94 = ga94[1,1]
{txt}
{com}. 
. scalar GArec94 = garec94[1,1]
{txt}
{com}. 
. scalar GAexp94 = gaexp94[1,1]
{txt}
{com}. 
. 
. replace exp = GA94 if highschoolstate == 11 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. replace rec = GArec94 if highschoolstate == 11 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. replace expend = GAexp94 if highschoolstate == 11 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. 
. matrix ga95 = ninetyfive * GA'
{txt}
{com}. 
. matrix garec95 = ninetyfive * GArec'
{txt}
{com}. 
. matrix gaexp95 = ninetyfive * GAexp'
{txt}
{com}. 
. 
. scalar GA95 = ga95[1,1]
{txt}
{com}. 
. scalar GArec95 = garec95[1,1]
{txt}
{com}. 
. scalar GAexp95 = gaexp95[1,1]
{txt}
{com}. 
. 
. replace exp = GA95 if highschoolstate == 11 & cohort == 1995
{txt}(13 real changes made)

{com}. 
. replace rec = GArec95 if highschoolstate == 11 & cohort == 1995
{txt}(13 real changes made)

{com}. 
. replace expend = GAexp95 if highschoolstate == 11 & cohort == 1995
{txt}(13 real changes made)

{com}. 
. 
. matrix ga96 = ninetysix * GA'
{txt}
{com}. 
. matrix garec96 = ninetysix * GArec'
{txt}
{com}. 
. matrix gaexp96 = ninetysix * GAexp'
{txt}
{com}. 
. 
. scalar GA96 = ga96[1,1]
{txt}
{com}. 
. scalar GArec96 = garec96[1,1]
{txt}
{com}. 
. scalar GAexp96 = gaexp96[1,1]
{txt}
{com}. 
. 
. replace exp = GA96 if highschoolstate == 11 & cohort == 1996
{txt}(14 real changes made)

{com}. 
. replace rec = GArec96 if highschoolstate == 11 & cohort == 1996
{txt}(14 real changes made)

{com}. 
. replace expend = GAexp96 if highschoolstate == 11 & cohort == 1996
{txt}(14 real changes made)

{com}. 
. 
. matrix ga97 = ninetyseven * GA'
{txt}
{com}. 
. matrix garec97 = ninetyseven * GArec'
{txt}
{com}. 
. matrix gaexp97 = ninetyseven * GAexp'
{txt}
{com}. 
. 
. scalar GA97 = ga97[1,1]
{txt}
{com}. 
. scalar GArec97 = garec97[1,1]
{txt}
{com}. 
. scalar GAexp97 = gaexp97[1,1]
{txt}
{com}. 
. 
. replace exp = GA97 if highschoolstate == 11 & cohort == 1997
{txt}(10 real changes made)

{com}. 
. replace rec = GArec97 if highschoolstate == 11 & cohort == 1997
{txt}(10 real changes made)

{com}. 
. replace expend = GAexp97 if highschoolstate == 11 & cohort == 1997
{txt}(10 real changes made)

{com}. 
. 
. matrix ga98 = ninetyeight * GA'
{txt}
{com}. 
. matrix garec98 = ninetyeight * GArec'
{txt}
{com}. 
. matrix gaexp98 = ninetyeight * GAexp'
{txt}
{com}. 
. 
. scalar GA98 = ga98[1,1]
{txt}
{com}. 
. scalar GArec98 = garec98[1,1]
{txt}
{com}. 
. scalar GAexp98 = gaexp98[1,1]
{txt}
{com}. 
. 
. replace exp = GA98 if highschoolstate == 11 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. replace rec = GArec98 if highschoolstate == 11 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. replace expend = GAexp98 if highschoolstate == 11 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. *HI|02-04:12
. 
. matrix hi94 = ninetyfour * HI'
{txt}
{com}. 
. matrix hirec94 = ninetyfour * HIrec'
{txt}
{com}. 
. matrix hiexp94 = ninetyfour * HIexp'
{txt}
{com}. 
. 
. scalar HI94 = hi94[1,1]
{txt}
{com}. 
. scalar HIrec94 = hirec94[1,1]
{txt}
{com}. 
. scalar HIexp94 = hiexp94[1,1]
{txt}
{com}. 
. 
. replace exp = HI94 if highschoolstate == 12 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = HIrec94 if highschoolstate == 12 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = HIexp94 if highschoolstate == 12 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix hi95 = ninetyfive * HI'
{txt}
{com}. 
. matrix hirec95 = ninetyfive * HIrec'
{txt}
{com}. 
. matrix hiexp95 = ninetyfive * HIexp'
{txt}
{com}. 
. 
. scalar HI95 = hi95[1,1]
{txt}
{com}. 
. scalar HIrec95 = hirec95[1,1]
{txt}
{com}. 
. scalar HIexp95 = hiexp95[1,1]
{txt}
{com}. 
. 
. replace exp = HI95 if highschoolstate == 12 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = HIrec95 if highschoolstate == 12 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = HIexp95 if highschoolstate == 12 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix hi96 = ninetysix * HI'
{txt}
{com}. 
. matrix hirec96 = ninetysix * HIrec'
{txt}
{com}. 
. matrix hiexp96 = ninetysix * HIexp'
{txt}
{com}. 
. 
. scalar HI96 = hi96[1,1]
{txt}
{com}. 
. scalar HIrec96 = hirec96[1,1]
{txt}
{com}. 
. scalar HIexp96 = hiexp96[1,1]
{txt}
{com}. 
. 
. replace exp = HI96 if highschoolstate == 12 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = HIrec96 if highschoolstate == 12 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = HIexp96 if highschoolstate == 12 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix hi97 = ninetyseven * HI'
{txt}
{com}. 
. matrix hirec97 = ninetyseven * HIrec'
{txt}
{com}. 
. matrix hiexp97 = ninetyseven * HIexp'
{txt}
{com}. 
. 
. scalar HI97 = hi97[1,1]
{txt}
{com}. 
. scalar HIrec97 = hirec97[1,1]
{txt}
{com}. 
. scalar HIexp97 = hiexp97[1,1]
{txt}
{com}. 
. 
. replace exp = HI97 if highschoolstate == 12 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = HIrec97 if highschoolstate == 12 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = HIexp97 if highschoolstate == 12 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix hi98 = ninetyeight * HI'
{txt}
{com}. 
. matrix hirec98 = ninetyeight * HIrec'
{txt}
{com}. 
. matrix hiexp98 = ninetyeight * HIexp'
{txt}
{com}. 
. 
. scalar HI98 = hi98[1,1]
{txt}
{com}. 
. scalar HIrec98 = hirec98[1,1]
{txt}
{com}. 
. scalar HIexp98 = hiexp98[1,1]
{txt}
{com}. 
. 
. replace exp = HI98 if highschoolstate == 12 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = HIrec98 if highschoolstate == 12 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = HIexp98 if highschoolstate == 12 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *ID|92-93:13
. 
. matrix id94 = ninetyfour * ID'
{txt}
{com}. 
. matrix idrec94 = ninetyfour * IDrec'
{txt}
{com}. 
. matrix idexp94 = ninetyfour * IDexp'
{txt}
{com}. 
. 
. scalar ID94 = id94[1,1]
{txt}
{com}. 
. scalar IDrec94 = idrec94[1,1]
{txt}
{com}. 
. scalar IDexp94 = idexp94[1,1]
{txt}
{com}. 
. 
. replace exp = ID94 if highschoolstate == 13 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = IDrec94 if highschoolstate == 13 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = IDexp94 if highschoolstate == 13 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix id95 = ninetyfive * ID'
{txt}
{com}. 
. matrix idrec95 = ninetyfive * IDrec'
{txt}
{com}. 
. matrix idexp95 = ninetyfive * IDexp'
{txt}
{com}. 
. 
. scalar ID95 = id95[1,1]
{txt}
{com}. 
. scalar IDrec95 = idrec95[1,1]
{txt}
{com}. 
. scalar IDexp95 = idexp95[1,1]
{txt}
{com}. 
. 
. replace exp = ID95 if highschoolstate == 13 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = IDrec95 if highschoolstate == 13 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = IDexp95 if highschoolstate == 13 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix id96 = ninetysix * ID'
{txt}
{com}. 
. matrix idrec96 = ninetysix * IDrec'
{txt}
{com}. 
. matrix idexp96 = ninetysix * IDexp'
{txt}
{com}. 
. 
. scalar ID96 = id96[1,1]
{txt}
{com}. 
. scalar IDrec96 = idrec96[1,1]
{txt}
{com}. 
. scalar IDexp96 = idexp96[1,1]
{txt}
{com}. 
. 
. replace exp = ID96 if highschoolstate == 13 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = IDrec96 if highschoolstate == 13 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = IDexp96 if highschoolstate == 13 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix id97 = ninetyseven * ID'
{txt}
{com}. 
. matrix idrec97 = ninetyseven * IDrec'
{txt}
{com}. 
. matrix idexp97 = ninetyseven * IDexp'
{txt}
{com}. 
. 
. scalar ID97 = id97[1,1]
{txt}
{com}. 
. scalar IDrec97 = idrec97[1,1]
{txt}
{com}. 
. scalar IDexp97 = idexp97[1,1]
{txt}
{com}. 
. 
. replace exp = ID97 if highschoolstate == 13 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = IDrec97 if highschoolstate == 13 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = IDexp97 if highschoolstate == 13 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix id98 = ninetyeight * ID'
{txt}
{com}. 
. matrix idrec98 = ninetyeight * IDrec'
{txt}
{com}. 
. matrix idexp98 = ninetyeight * IDexp'
{txt}
{com}. 
. 
. scalar ID98 = id98[1,1]
{txt}
{com}. 
. scalar IDrec98 = idrec98[1,1]
{txt}
{com}. 
. scalar IDexp98 = idexp98[1,1]
{txt}
{com}. 
. 
. replace exp = ID98 if highschoolstate == 13 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = IDrec98 if highschoolstate == 13 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = IDexp98 if highschoolstate == 13 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *IL|86-16:14
. 
. matrix il94 = ninetyfour * IL'
{txt}
{com}. 
. matrix ilrec94 = ninetyfour * ILrec'
{txt}
{com}. 
. matrix ilexp94 = ninetyfour * ILexp'
{txt}
{com}. 
. 
. scalar IL94 = il94[1,1]
{txt}
{com}. 
. scalar ILrec94 = ilrec94[1,1]
{txt}
{com}. 
. scalar ILexp94 = ilexp94[1,1]
{txt}
{com}. 
. 
. replace exp = IL94 if highschoolstate == 14 & cohort == 1994
{txt}(43 real changes made)

{com}. 
. replace rec = ILrec94 if highschoolstate == 14 & cohort == 1994
{txt}(43 real changes made)

{com}. 
. replace expend = ILexp94 if highschoolstate == 14 & cohort == 1994
{txt}(43 real changes made)

{com}. 
. 
. matrix il95 = ninetyfive * IL'
{txt}
{com}. 
. matrix ilrec95 = ninetyfive * ILrec'
{txt}
{com}. 
. matrix ilexp95 = ninetyfive * ILexp'
{txt}
{com}. 
. 
. scalar IL95 = il95[1,1]
{txt}
{com}. 
. scalar ILrec95 = ilrec95[1,1]
{txt}
{com}. 
. scalar ILexp95 = ilexp95[1,1]
{txt}
{com}. 
. 
. replace exp = IL95 if highschoolstate == 14 & cohort == 1995
{txt}(32 real changes made)

{com}. 
. replace rec = ILrec95 if highschoolstate == 14 & cohort == 1995
{txt}(32 real changes made)

{com}. 
. replace expend = ILexp95 if highschoolstate == 14 & cohort == 1995
{txt}(32 real changes made)

{com}. 
. 
. matrix il96 = ninetysix * IL'
{txt}
{com}. 
. matrix ilrec96 = ninetysix * ILrec'
{txt}
{com}. 
. matrix ilexp96 = ninetysix * ILexp'
{txt}
{com}. 
. 
. scalar IL96 = il96[1,1]
{txt}
{com}. 
. scalar ILrec96 = ilrec96[1,1]
{txt}
{com}. 
. scalar ILexp96 = ilexp96[1,1]
{txt}
{com}. 
. 
. replace exp = IL96 if highschoolstate == 14 & cohort == 1996
{txt}(31 real changes made)

{com}. 
. replace rec = ILrec96 if highschoolstate == 14 & cohort == 1996
{txt}(31 real changes made)

{com}. 
. replace expend = ILexp96 if highschoolstate == 14 & cohort == 1996
{txt}(31 real changes made)

{com}. 
. 
. matrix il97 = ninetyseven * IL'
{txt}
{com}. 
. matrix ilrec97 = ninetyseven * ILrec'
{txt}
{com}. 
. matrix ilexp97 = ninetyseven * ILexp'
{txt}
{com}. 
. 
. scalar IL97 = il97[1,1]
{txt}
{com}. 
. scalar ILrec97 = ilrec97[1,1]
{txt}
{com}. 
. scalar ILexp97 = ilexp97[1,1]
{txt}
{com}. 
. 
. replace exp = IL97 if highschoolstate == 14 & cohort == 1997
{txt}(28 real changes made)

{com}. 
. replace rec = ILrec97 if highschoolstate == 14 & cohort == 1997
{txt}(28 real changes made)

{com}. 
. replace expend = ILexp97 if highschoolstate == 14 & cohort == 1997
{txt}(28 real changes made)

{com}. 
. 
. matrix il98 = ninetyeight * IL'
{txt}
{com}. 
. matrix ilrec98 = ninetyeight * ILrec'
{txt}
{com}. 
. matrix ilexp98 = ninetyeight * ILexp'
{txt}
{com}. 
. 
. scalar IL98 = il98[1,1]
{txt}
{com}. 
. scalar ILrec98 = ilrec98[1,1]
{txt}
{com}. 
. scalar ILexp98 = ilexp98[1,1]
{txt}
{com}. 
. 
. replace exp = IL98 if highschoolstate == 14 & cohort == 1998
{txt}(19 real changes made)

{com}. 
. replace rec = ILrec98 if highschoolstate == 14 & cohort == 1998
{txt}(19 real changes made)

{com}. 
. replace expend = ILexp98 if highschoolstate == 14 & cohort == 1998
{txt}(19 real changes made)

{com}. 
. *IN|91-14:15
. 
. matrix in94 = ninetyfour * IN'
{txt}
{com}. 
. matrix inrec94 = ninetyfour * INrec'
{txt}
{com}. 
. matrix inexp94 = ninetyfour * INexp'
{txt}
{com}. 
. 
. scalar IN94 = in94[1,1]
{txt}
{com}. 
. scalar INrec94 = inrec94[1,1]
{txt}
{com}. 
. scalar INexp94 = inexp94[1,1]
{txt}
{com}. 
. 
. replace exp = IN94 if highschoolstate == 15 & cohort == 1994
{txt}(31 real changes made)

{com}. 
. replace rec = INrec94 if highschoolstate == 15 & cohort == 1994
{txt}(31 real changes made)

{com}. 
. replace expend = INexp94 if highschoolstate == 15 & cohort == 1994
{txt}(31 real changes made)

{com}. 
. 
. matrix in95 = ninetyfive * IN'
{txt}
{com}. 
. matrix inrec95 = ninetyfive * INrec'
{txt}
{com}. 
. matrix inexp95 = ninetyfive * INexp'
{txt}
{com}. 
. 
. scalar IN95 = in95[1,1]
{txt}
{com}. 
. scalar INrec95 = inrec95[1,1]
{txt}
{com}. 
. scalar INexp95 = inexp95[1,1]
{txt}
{com}. 
. 
. replace exp = IN95 if highschoolstate == 15 & cohort == 1995
{txt}(21 real changes made)

{com}. 
. replace rec = INrec95 if highschoolstate == 15 & cohort == 1995
{txt}(21 real changes made)

{com}. 
. replace expend = INexp95 if highschoolstate == 15 & cohort == 1995
{txt}(21 real changes made)

{com}. 
. 
. matrix in96 = ninetysix * IN'
{txt}
{com}. 
. matrix inrec96 = ninetysix * INrec'
{txt}
{com}. 
. matrix inexp96 = ninetysix * INexp'
{txt}
{com}. 
. 
. scalar IN96 = in96[1,1]
{txt}
{com}. 
. scalar INrec96 = inrec96[1,1]
{txt}
{com}. 
. scalar INexp96 = inexp96[1,1]
{txt}
{com}. 
. 
. replace exp = IN96 if highschoolstate == 15 & cohort == 1996
{txt}(17 real changes made)

{com}. 
. replace rec = INrec96 if highschoolstate == 15 & cohort == 1996
{txt}(17 real changes made)

{com}. 
. replace expend = INexp96 if highschoolstate == 15 & cohort == 1996
{txt}(17 real changes made)

{com}. 
. 
. matrix in97 = ninetyseven * IN'
{txt}
{com}. 
. matrix inrec97 = ninetyseven * INrec'
{txt}
{com}. 
. matrix inexp97 = ninetyseven * INexp'
{txt}
{com}. 
. 
. scalar IN97 = in97[1,1]
{txt}
{com}. 
. scalar INrec97 = inrec97[1,1]
{txt}
{com}. 
. scalar INexp97 = inexp97[1,1]
{txt}
{com}. 
. 
. replace exp = IN97 if highschoolstate == 15 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace rec =INrec97 if highschoolstate == 15 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace expend = INexp97 if highschoolstate == 15 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. 
. matrix in98 = ninetyeight * IN'
{txt}
{com}. 
. matrix inrec98 = ninetyeight * INrec'
{txt}
{com}. 
. matrix inexp98 = ninetyeight * INexp'
{txt}
{com}. 
. 
. scalar IN98 = in98[1,1]
{txt}
{com}. 
. scalar INrec98 = inrec98[1,1]
{txt}
{com}. 
. scalar INexp98 = inexp98[1,1]
{txt}
{com}. 
. 
. replace exp = IN98 if highschoolstate == 15 & cohort == 1998
{txt}(14 real changes made)

{com}. 
. replace rec = INrec98 if highschoolstate == 15 & cohort == 1998
{txt}(14 real changes made)

{com}. 
. replace expend = INexp98 if highschoolstate == 15 & cohort == 1998
{txt}(14 real changes made)

{com}. 
. *IA|01-16:16
. 
. matrix ia94 = ninetyfour * IA'
{txt}
{com}. 
. matrix iarec94 = ninetyfour * IArec'
{txt}
{com}. 
. matrix iaexp94 = ninetyfour * IAexp'
{txt}
{com}. 
. 
. scalar IA94 = ia94[1,1]
{txt}
{com}. 
. scalar IArec94 = iarec94[1,1]
{txt}
{com}. 
. scalar IAexp94 = iaexp94[1,1]
{txt}
{com}. 
. 
. replace exp = IA94 if highschoolstate == 16 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = IArec94 if highschoolstate == 16 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = IAexp94 if highschoolstate == 16 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ia95 = ninetyfive * IA'
{txt}
{com}. 
. matrix iarec95 = ninetyfive * IArec'
{txt}
{com}. 
. matrix iaexp95 = ninetyfive * IAexp'
{txt}
{com}. 
. 
. scalar IA95 = ia95[1,1]
{txt}
{com}. 
. scalar IArec95 = iarec95[1,1]
{txt}
{com}. 
. scalar IAexp95 = iaexp95[1,1]
{txt}
{com}. 
. 
. replace exp = IA95 if highschoolstate == 16 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = IArec95 if highschoolstate == 16 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = IAexp95 if highschoolstate == 16 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix ia96 = ninetysix * IA'
{txt}
{com}. 
. matrix iarec96 = ninetysix * IArec'
{txt}
{com}. 
. matrix iaexp96 = ninetysix * IAexp'
{txt}
{com}. 
. 
. scalar IA96 = ia96[1,1]
{txt}
{com}. 
. scalar IArec96 = iarec96[1,1]
{txt}
{com}. 
. scalar IAexp96 = iaexp96[1,1]
{txt}
{com}. 
. 
. replace exp = IA96 if highschoolstate == 16 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = IArec96 if highschoolstate == 16 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = IAexp96 if highschoolstate == 16 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix ia97 = ninetyseven * IA'
{txt}
{com}. 
. matrix iarec97 = ninetyseven * IArec'
{txt}
{com}. 
. matrix iaexp97 = ninetyseven * IAexp'
{txt}
{com}. 
. 
. scalar IA97 = ia97[1,1]
{txt}
{com}. 
. scalar IArec97 = iarec97[1,1]
{txt}
{com}. 
. scalar IAexp97 = iaexp97[1,1]
{txt}
{com}. 
. 
. replace exp = IA97 if highschoolstate == 16 & cohort == 1997
{txt}(1 real change made)

{com}. 
. replace rec = IArec97 if highschoolstate == 16 & cohort == 1997
{txt}(1 real change made)

{com}. 
. replace expend = IAexp97 if highschoolstate == 16 & cohort == 1997
{txt}(1 real change made)

{com}. 
. 
. matrix ia98 = ninetyeight * IA'
{txt}
{com}. 
. matrix iarec98 = ninetyeight * IArec'
{txt}
{com}. 
. matrix iaexp98 = ninetyeight * IAexp'
{txt}
{com}. 
. 
. scalar IA98 = ia98[1,1]
{txt}
{com}. 
. scalar IArec98 = iarec98[1,1]
{txt}
{com}. 
. scalar IAexp98 = iaexp98[1,1]
{txt}
{com}. 
. 
. replace exp = IA98 if highschoolstate == 16 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = IArec98 if highschoolstate == 16 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = IAexp98 if highschoolstate == 16 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *KS|05-07:17
. 
. matrix ks94 = ninetyfour * KS'
{txt}
{com}. 
. matrix ksrec94 = ninetyfour * KSrec'
{txt}
{com}. 
. matrix ksexp94 = ninetyfour * KSexp'
{txt}
{com}. 
. 
. scalar KS94 = ks94[1,1]
{txt}
{com}. 
. scalar KSrec94 = ksrec94[1,1]
{txt}
{com}. 
. scalar KSexp94 = ksexp94[1,1]
{txt}
{com}. 
. 
. replace exp = KS94 if highschoolstate == 17 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = KSrec94 if highschoolstate == 17 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = KSexp94 if highschoolstate == 17 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ks95 = ninetyfive * KS'
{txt}
{com}. 
. matrix ksrec95 = ninetyfive * KSrec'
{txt}
{com}. 
. matrix ksexp95 = ninetyfive * KSexp'
{txt}
{com}. 
. 
. scalar KS95 = ks95[1,1]
{txt}
{com}. 
. scalar KSrec95 = ksrec95[1,1]
{txt}
{com}. 
. scalar KSexp95 = ksexp95[1,1]
{txt}
{com}. 
. 
. replace exp = KS95 if highschoolstate == 17 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = KSrec95 if highschoolstate == 17 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = KSexp95 if highschoolstate == 17 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix ks96 = ninetysix * KS'
{txt}
{com}. 
. matrix ksrec96 = ninetysix * KSrec'
{txt}
{com}. 
. matrix ksexp96 = ninetysix * KSexp'
{txt}
{com}. 
. 
. scalar KS96 = ks96[1,1]
{txt}
{com}. 
. scalar KSrec96 = ksrec96[1,1]
{txt}
{com}. 
. scalar KSexp96 = ksexp96[1,1]
{txt}
{com}. 
. 
. replace exp = KS96 if highschoolstate == 17 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = KSrec96 if highschoolstate == 17 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = KSexp96 if highschoolstate == 17 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix ks97 = ninetyseven * KS'
{txt}
{com}. 
. matrix ksrec97 = ninetyseven * KSrec'
{txt}
{com}. 
. matrix ksexp97 = ninetyseven * KSexp'
{txt}
{com}. 
. 
. scalar KS97 = ks97[1,1]
{txt}
{com}. 
. scalar KSrec97 = ksrec97[1,1]
{txt}
{com}. 
. scalar KSexp97 = ksexp97[1,1]
{txt}
{com}. 
. 
. replace exp = KS97 if highschoolstate == 17 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = KSrec97 if highschoolstate == 17 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = KSexp97 if highschoolstate == 17 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix ks98 = ninetyeight * KS'
{txt}
{com}. 
. matrix ksrec98 = ninetyeight * KSrec'
{txt}
{com}. 
. matrix ksexp98 = ninetyeight * KSexp'
{txt}
{com}. 
. 
. scalar KS98 = ks98[1,1]
{txt}
{com}. 
. scalar KSrec98 = ksrec98[1,1]
{txt}
{com}. 
. scalar KSexp98 = ksexp98[1,1]
{txt}
{com}. 
. 
. replace exp = KS98 if highschoolstate == 17 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = KSrec98 if highschoolstate == 17 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = KSexp98 if highschoolstate == 17 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *KY|91-14:18
. 
. matrix ky94 = ninetyfour * KY'
{txt}
{com}. 
. matrix kyrec94 = ninetyfour * KYrec'
{txt}
{com}. 
. matrix kyexp94 = ninetyfour * KYexp'
{txt}
{com}. 
. 
. scalar KY94 = ky94[1,1]
{txt}
{com}. 
. scalar KYrec94 = kyrec94[1,1]
{txt}
{com}. 
. scalar KYexp94 = kyexp94[1,1]
{txt}
{com}. 
. 
. replace exp = KY94 if highschoolstate == 18 & cohort == 1994
{txt}(6 real changes made)

{com}. 
. replace rec = KYrec94 if highschoolstate == 18 & cohort == 1994
{txt}(6 real changes made)

{com}. 
. replace expend = KYexp94 if highschoolstate == 18 & cohort == 1994
{txt}(6 real changes made)

{com}. 
. 
. matrix ky95 = ninetyfive * KY'
{txt}
{com}. 
. matrix kyrec95 = ninetyfive * KYrec'
{txt}
{com}. 
. matrix kyexp95 = ninetyfive * KYexp'
{txt}
{com}. 
. 
. scalar KY95 = ky95[1,1]
{txt}
{com}. 
. scalar KYrec95 = kyrec95[1,1]
{txt}
{com}. 
. scalar KYexp95 = kyexp95[1,1]
{txt}
{com}. 
. 
. replace exp = KY95 if highschoolstate == 18 & cohort == 1995
{txt}(7 real changes made)

{com}. 
. replace rec = KYrec95 if highschoolstate == 18 & cohort == 1995
{txt}(7 real changes made)

{com}. 
. replace expend = KYexp95 if highschoolstate == 18 & cohort == 1995
{txt}(7 real changes made)

{com}. 
. 
. matrix ky96 = ninetysix * KY'
{txt}
{com}. 
. matrix kyrec96 = ninetysix * KYrec'
{txt}
{com}. 
. matrix kyexp96 = ninetysix * KYexp'
{txt}
{com}. 
. 
. scalar KY96 = ky96[1,1]
{txt}
{com}. 
. scalar KYrec96 = kyrec96[1,1]
{txt}
{com}. 
. scalar KYexp96 = kyexp96[1,1]
{txt}
{com}. 
. 
. replace exp = KY96 if highschoolstate == 18 & cohort == 1996
{txt}(5 real changes made)

{com}. 
. replace rec = KYrec96 if highschoolstate == 18 & cohort == 1996
{txt}(5 real changes made)

{com}. 
. replace expend = KYexp96 if highschoolstate == 18 & cohort == 1996
{txt}(5 real changes made)

{com}. 
. 
. matrix ky97 = ninetyseven * KY'
{txt}
{com}. 
. matrix kyrec97 = ninetyseven * KYrec'
{txt}
{com}. 
. matrix kyexp97 = ninetyseven * KYexp'
{txt}
{com}. 
. 
. scalar KY97 = ky97[1,1]
{txt}
{com}. 
. scalar KYrec97 = kyrec97[1,1]
{txt}
{com}. 
. scalar KYexp97 = kyexp97[1,1]
{txt}
{com}. 
. 
. replace exp = KY97 if highschoolstate == 18 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. replace rec = KYrec97 if highschoolstate == 18 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. replace expend = KYexp97 if highschoolstate == 18 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. 
. matrix ky98 = ninetyeight * KY'
{txt}
{com}. 
. matrix kyrec98 = ninetyeight * KYrec'
{txt}
{com}. 
. matrix kyexp98 = ninetyeight * KYexp'
{txt}
{com}. 
. 
. scalar KY98 = ky98[1,1]
{txt}
{com}. 
. scalar KYrec98 = kyrec98[1,1]
{txt}
{com}. 
. scalar KYexp98 = kyexp98[1,1]
{txt}
{com}. 
. 
. replace exp = KY98 if highschoolstate == 18 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace rec = KYrec98 if highschoolstate == 18 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace expend = KYexp98 if highschoolstate == 18 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. *LA|03-05:19
. 
. matrix la94 = ninetyfour * LA'
{txt}
{com}. 
. matrix larec94 = ninetyfour * LArec'
{txt}
{com}. 
. matrix laexp94 = ninetyfour * LAexp'
{txt}
{com}. 
. 
. scalar LA94 = la94[1,1]
{txt}
{com}. 
. scalar LArec94 = larec94[1,1]
{txt}
{com}. 
. scalar LAexp94 = laexp94[1,1]
{txt}
{com}. 
. 
. replace exp = LA94 if highschoolstate == 19 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = LArec94 if highschoolstate == 19 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = LAexp94 if highschoolstate == 19 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix la95 = ninetyfive * LA'
{txt}
{com}. 
. matrix larec95 = ninetyfive * LArec'
{txt}
{com}. 
. matrix laexp95 = ninetyfive * LAexp'
{txt}
{com}. 
. 
. scalar LA95 = la95[1,1]
{txt}
{com}. 
. scalar LArec95 = larec95[1,1]
{txt}
{com}. 
. scalar LAexp95 = laexp95[1,1]
{txt}
{com}. 
. 
. replace exp = LA95 if highschoolstate == 19 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = LArec95 if highschoolstate == 19 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = LAexp95 if highschoolstate == 19 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix la96 = ninetysix * LA'
{txt}
{com}. 
. matrix larec96 = ninetysix * LArec'
{txt}
{com}. 
. matrix laexp96 = ninetysix * LAexp'
{txt}
{com}. 
. 
. scalar LA96 = la96[1,1]
{txt}
{com}. 
. scalar LArec96 = larec96[1,1]
{txt}
{com}. 
. scalar LAexp96 = laexp96[1,1]
{txt}
{com}. 
. 
. replace exp = LA96 if highschoolstate == 19 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = LArec96 if highschoolstate == 19 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = LAexp96 if highschoolstate == 19 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix la97 = ninetyseven * LA'
{txt}
{com}. 
. matrix larec97 = ninetyseven * LArec'
{txt}
{com}. 
. matrix laexp97 = ninetyseven * LAexp'
{txt}
{com}. 
. 
. scalar LA97 = la97[1,1]
{txt}
{com}. 
. scalar LArec97 = larec97[1,1]
{txt}
{com}. 
. scalar LAexp97 = laexp97[1,1]
{txt}
{com}. 
. 
. replace exp = LA97 if highschoolstate == 19 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = LArec97 if highschoolstate == 19 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = LAexp97 if highschoolstate == 19 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix la98 = ninetyeight * LA'
{txt}
{com}. 
. matrix larec98 = ninetyeight * LArec'
{txt}
{com}. 
. matrix laexp98 = ninetyeight * LAexp'
{txt}
{com}. 
. 
. scalar LA98 = la98[1,1]
{txt}
{com}. 
. scalar LArec98 = larec98[1,1]
{txt}
{com}. 
. scalar LAexp98 = laexp98[1,1]
{txt}
{com}. 
. 
. replace exp = LA98 if highschoolstate == 19 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = LArec98 if highschoolstate == 19 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = LAexp98 if highschoolstate == 19 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *ME|98-14:20
. 
. matrix me94 = ninetyfour * ME'
{txt}
{com}. 
. matrix merec94 = ninetyfour * MErec'
{txt}
{com}. 
. matrix meexp94 = ninetyfour * MEexp'
{txt}
{com}. 
. 
. scalar ME94 = me94[1,1]
{txt}
{com}. 
. scalar MErec94 = merec94[1,1]
{txt}
{com}. 
. scalar MEexp94 = meexp94[1,1]
{txt}
{com}. 
. 
. replace exp = ME94 if highschoolstate == 20 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = MErec94 if highschoolstate == 20 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = MEexp94 if highschoolstate == 20 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix me95 = ninetyfive * ME'
{txt}
{com}. 
. matrix merec95 = ninetyfive * MErec'
{txt}
{com}. 
. matrix meexp95 = ninetyfive * MEexp'
{txt}
{com}. 
. 
. scalar ME95 = me95[1,1]
{txt}
{com}. 
. scalar MErec95 = merec95[1,1]
{txt}
{com}. 
. scalar MEexp95 = meexp95[1,1]
{txt}
{com}. 
. 
. replace exp = ME95 if highschoolstate == 20 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = MErec95 if highschoolstate == 20 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = MEexp95 if highschoolstate == 20 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix me96 = ninetysix * ME'
{txt}
{com}. 
. matrix merec96 = ninetysix * MErec'
{txt}
{com}. 
. matrix meexp96 = ninetysix * MEexp'
{txt}
{com}. 
. 
. scalar ME96 = me96[1,1]
{txt}
{com}. 
. scalar MErec96 = merec96[1,1]
{txt}
{com}. 
. scalar MEexp96 = meexp96[1,1]
{txt}
{com}. 
. 
. replace exp = ME96 if highschoolstate == 20 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = MErec96 if highschoolstate == 20 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = MEexp96 if highschoolstate == 20 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix me97 = ninetyseven * ME'
{txt}
{com}. 
. matrix merec97 = ninetyseven * MErec'
{txt}
{com}. 
. matrix meexp97 = ninetyseven * MEexp'
{txt}
{com}. 
. 
. scalar ME97 = me97[1,1]
{txt}
{com}. 
. scalar MErec97 = merec97[1,1]
{txt}
{com}. 
. scalar MEexp97 = meexp97[1,1]
{txt}
{com}. 
. 
. replace exp = ME97 if highschoolstate == 20 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = MErec97 if highschoolstate == 20 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = MEexp97 if highschoolstate == 20 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix me98 = ninetyeight * ME'
{txt}
{com}. 
. matrix merec98 = ninetyeight * MErec'
{txt}
{com}. 
. matrix meexp98 = ninetyeight * MEexp'
{txt}
{com}. 
. 
. scalar ME98 = me98[1,1]
{txt}
{com}. 
. scalar MErec98 = merec98[1,1]
{txt}
{com}. 
. scalar MEexp98 = meexp98[1,1]
{txt}
{com}. 
. 
. replace exp = ME98 if highschoolstate == 20 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = MErec98 if highschoolstate == 20 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = MEexp98 if highschoolstate == 20 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *MD|91-14:21
. 
. matrix md94 = ninetyfour * MD'
{txt}
{com}. 
. matrix mdrec94 = ninetyfour * MDrec'
{txt}
{com}. 
. matrix mdexp94 = ninetyfour * MDexp'
{txt}
{com}. 
. 
. scalar MD94 = md94[1,1]
{txt}
{com}. 
. scalar MDrec94 = mdrec94[1,1]
{txt}
{com}. 
. scalar MDexp94 = mdexp94[1,1]
{txt}
{com}. 
. 
. replace exp = MD94 if highschoolstate == 21 & cohort == 1994
{txt}(10 real changes made)

{com}. 
. replace rec = MDrec94 if highschoolstate == 21 & cohort == 1994
{txt}(10 real changes made)

{com}. 
. replace expend = MDexp94 if highschoolstate == 21 & cohort == 1994
{txt}(10 real changes made)

{com}. 
. 
. matrix md95 = ninetyfive * MD'
{txt}
{com}. 
. matrix mdrec95 = ninetyfive * MDrec'
{txt}
{com}. 
. matrix mdexp95 = ninetyfive * MDexp'
{txt}
{com}. 
. 
. scalar MD95 = md95[1,1]
{txt}
{com}. 
. scalar MDrec95 = mdrec95[1,1]
{txt}
{com}. 
. scalar MDexp95 = mdexp95[1,1]
{txt}
{com}. 
. 
. replace exp = MD95 if highschoolstate == 21 & cohort == 1995
{txt}(17 real changes made)

{com}. 
. replace rec = MDrec95 if highschoolstate == 21 & cohort == 1995
{txt}(17 real changes made)

{com}. 
. replace expend = MDexp95 if highschoolstate == 21 & cohort == 1995
{txt}(17 real changes made)

{com}. 
. 
. matrix md96 = ninetysix * MD'
{txt}
{com}. 
. matrix mdrec96 = ninetysix * MDrec'
{txt}
{com}. 
. matrix mdexp96 = ninetysix * MDexp'
{txt}
{com}. 
. 
. scalar MD96 = md96[1,1]
{txt}
{com}. 
. scalar MDrec96 = mdrec96[1,1]
{txt}
{com}. 
. scalar MDexp96 = mdexp96[1,1]
{txt}
{com}. 
. 
. replace exp = MD96 if highschoolstate == 21 & cohort == 1996
{txt}(8 real changes made)

{com}. 
. replace rec = MDrec96 if highschoolstate == 21 & cohort == 1996
{txt}(8 real changes made)

{com}. 
. replace expend = MDexp96 if highschoolstate == 21 & cohort == 1996
{txt}(8 real changes made)

{com}. 
. 
. matrix md97 = ninetyseven * MD'
{txt}
{com}. 
. matrix mdrec97 = ninetyseven * MDrec'
{txt}
{com}. 
. matrix mdexp97 = ninetyseven * MDexp'
{txt}
{com}. 
. 
. scalar MD97 = md97[1,1]
{txt}
{com}. 
. scalar MDrec97 = mdrec97[1,1]
{txt}
{com}. 
. scalar MDexp97 = mdexp97[1,1]
{txt}
{com}. 
. 
. replace exp = MD97 if highschoolstate == 21 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace rec = MDrec97 if highschoolstate == 21 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace expend = MDexp97 if highschoolstate == 21 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. 
. matrix md98 = ninetyeight * MD'
{txt}
{com}. 
. matrix mdrec98 = ninetyeight * MDrec'
{txt}
{com}. 
. matrix mdexp98 = ninetyeight * MDexp'
{txt}
{com}. 
. 
. scalar MD98 = md98[1,1]
{txt}
{com}. 
. scalar MDrec98 = mdrec98[1,1]
{txt}
{com}. 
. scalar MDexp98 = mdexp98[1,1]
{txt}
{com}. 
. 
. replace exp = MD98 if highschoolstate == 21 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. replace rec = MDrec98 if highschoolstate == 21 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. replace expend = MDexp98 if highschoolstate == 21 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. *MA|99-16:22
. 
. matrix ma94 = ninetyfour * MA'
{txt}
{com}. 
. matrix marec94 = ninetyfour * MArec'
{txt}
{com}. 
. matrix maexp94 = ninetyfour * MAexp'
{txt}
{com}. 
. 
. scalar MA94 = ma94[1,1]
{txt}
{com}. 
. scalar MArec94 = marec94[1,1]
{txt}
{com}. 
. scalar MAexp94 = maexp94[1,1]
{txt}
{com}. 
. 
. replace exp = MA94 if highschoolstate == 22 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = MArec94 if highschoolstate == 22 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = MAexp94 if highschoolstate == 22 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ma95 = ninetyfive * MA'
{txt}
{com}. 
. matrix marec95 = ninetyfive * MArec'
{txt}
{com}. 
. matrix maexp95 = ninetyfive * MAexp'
{txt}
{com}. 
. 
. scalar MA95 = ma95[1,1]
{txt}
{com}. 
. scalar MArec95 = marec95[1,1]
{txt}
{com}. 
. scalar MAexp95 = maexp95[1,1]
{txt}
{com}. 
. 
. replace exp = MA95 if highschoolstate == 22 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. replace rec = MArec95 if highschoolstate == 22 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. replace expend = MAexp95 if highschoolstate == 22 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. 
. matrix ma96 = ninetysix * MA'
{txt}
{com}. 
. matrix marec96 = ninetysix * MArec'
{txt}
{com}. 
. matrix maexp96 = ninetysix * MAexp'
{txt}
{com}. 
. 
. scalar MA96 = ma96[1,1]
{txt}
{com}. 
. scalar MArec96 = marec96[1,1]
{txt}
{com}. 
. scalar MAexp96 = maexp96[1,1]
{txt}
{com}. 
. 
. replace exp = MA96 if highschoolstate == 22 & cohort == 1996
{txt}(3 real changes made)

{com}. 
. replace rec = MArec96 if highschoolstate == 22 & cohort == 1996
{txt}(3 real changes made)

{com}. 
. replace expend = MAexp96 if highschoolstate == 22 & cohort == 1996
{txt}(3 real changes made)

{com}. 
. 
. matrix ma97 = ninetyseven * MA'
{txt}
{com}. 
. matrix marec97 = ninetyseven * MArec'
{txt}
{com}. 
. matrix maexp97 = ninetyseven * MAexp'
{txt}
{com}. 
. 
. scalar MA97 = ma97[1,1]
{txt}
{com}. 
. scalar MArec97 = marec97[1,1]
{txt}
{com}. 
. scalar MAexp97 = maexp97[1,1]
{txt}
{com}. 
. 
. replace exp = MA97 if highschoolstate == 22 & cohort == 1997
{txt}(7 real changes made)

{com}. 
. replace rec = MArec97 if highschoolstate == 22 & cohort == 1997
{txt}(7 real changes made)

{com}. 
. replace expend = MAexp97 if highschoolstate == 22 & cohort == 1997
{txt}(7 real changes made)

{com}. 
. 
. matrix ma98 = ninetyeight * MA'
{txt}
{com}. 
. matrix marec98 = ninetyeight * MArec'
{txt}
{com}. 
. matrix maexp98 = ninetyeight * MAexp'
{txt}
{com}. 
. 
. scalar MA98 = ma98[1,1]
{txt}
{com}. 
. scalar MArec98 = marec98[1,1]
{txt}
{com}. 
. scalar MAexp98 = maexp98[1,1]
{txt}
{com}. 
. 
. replace exp = MA98 if highschoolstate == 22 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace rec = MArec98 if highschoolstate == 22 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace expend = MAexp98 if highschoolstate == 22 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. *MI|None:23
. 
. *MN|None:24
. 
. *MS|91-16:25
. 
. matrix ms94 = ninetyfour * MS'
{txt}
{com}. 
. matrix msrec94 = ninetyfour * MSrec'
{txt}
{com}. 
. matrix msexp94 = ninetyfour * MSexp'
{txt}
{com}. 
. 
. scalar MS94 = ms94[1,1]
{txt}
{com}. 
. scalar MSrec94 = msrec94[1,1]
{txt}
{com}. 
. scalar MSexp94 = msexp94[1,1]
{txt}
{com}. 
. 
. replace exp = MS94 if highschoolstate == 25 & cohort == 1994
{txt}(16 real changes made)

{com}. 
. replace rec = MSrec94 if highschoolstate == 25 & cohort == 1994
{txt}(16 real changes made)

{com}. 
. replace expend = MSexp94 if highschoolstate == 25 & cohort == 1994
{txt}(16 real changes made)

{com}. 
. 
. matrix ms95 = ninetyfive * MS'
{txt}
{com}. 
. matrix msrec95 = ninetyfive * MSrec'
{txt}
{com}. 
. matrix msexp95 = ninetyfive * MSexp'
{txt}
{com}. 
. 
. scalar MS95 = ms95[1,1]
{txt}
{com}. 
. scalar MSrec95 = msrec95[1,1]
{txt}
{com}. 
. scalar MSexp95 = msexp95[1,1]
{txt}
{com}. 
. 
. replace exp = MS95 if highschoolstate == 25 & cohort == 1995
{txt}(15 real changes made)

{com}. 
. replace rec = MSrec95 if highschoolstate == 25 & cohort == 1995
{txt}(15 real changes made)

{com}. 
. replace expend = MSexp95 if highschoolstate == 25 & cohort == 1995
{txt}(15 real changes made)

{com}. 
. 
. matrix ms96 = ninetysix * MS'
{txt}
{com}. 
. matrix msrec96 = ninetysix * MSrec'
{txt}
{com}. 
. matrix msexp96 = ninetysix * MSexp'
{txt}
{com}. 
. 
. scalar MS96 = ms96[1,1]
{txt}
{com}. 
. scalar MSrec96 = msrec96[1,1]
{txt}
{com}. 
. scalar MSexp96 = msexp96[1,1]
{txt}
{com}. 
. 
. replace exp = MS96 if highschoolstate == 25 & cohort == 1996
{txt}(16 real changes made)

{com}. 
. replace rec = MSrec96 if highschoolstate == 25 & cohort == 1996
{txt}(16 real changes made)

{com}. 
. replace expend = MSexp96 if highschoolstate == 25 & cohort == 1996
{txt}(16 real changes made)

{com}. 
. 
. matrix ms97 = ninetyseven * MS'
{txt}
{com}. 
. matrix msrec97 = ninetyseven * MSrec'
{txt}
{com}. 
. matrix msexp97 = ninetyseven * MSexp'
{txt}
{com}. 
. 
. scalar MS97 = ms97[1,1]
{txt}
{com}. 
. scalar MSrec97 = msrec97[1,1]
{txt}
{com}. 
. scalar MSexp97 = msexp97[1,1]
{txt}
{com}. 
. 
. replace exp = MS97 if highschoolstate == 25 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace rec = MSrec97 if highschoolstate == 25 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. replace expend = MSexp97 if highschoolstate == 25 & cohort == 1997
{txt}(13 real changes made)

{com}. 
. 
. matrix ms98 = ninetyeight * MS'
{txt}
{com}. 
. matrix msrec98 = ninetyeight * MSrec'
{txt}
{com}. 
. matrix msexp98 = ninetyeight * MSexp'
{txt}
{com}. 
. 
. scalar MS98 = ms98[1,1]
{txt}
{com}. 
. scalar MSrec98 = msrec98[1,1]
{txt}
{com}. 
. scalar MSexp98 = msexp98[1,1]
{txt}
{com}. 
. 
. replace exp = MS98 if highschoolstate == 25 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace rec = MSrec98 if highschoolstate == 25 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace expend = MSexp98 if highschoolstate == 25 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. *MO|03-15:26
. 
. matrix mo94 = ninetyfour * MO'
{txt}
{com}. 
. matrix morec94 = ninetyfour * MOrec'
{txt}
{com}. 
. matrix moexp94 = ninetyfour * MOexp'
{txt}
{com}. 
. 
. scalar MO94 = mo94[1,1]
{txt}
{com}. 
. scalar MOrec94 = morec94[1,1]
{txt}
{com}. 
. scalar MOexp94 = moexp94[1,1]
{txt}
{com}. 
. 
. replace exp = MO94 if highschoolstate == 26 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = MOrec94 if highschoolstate == 26 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = MOexp94 if highschoolstate == 26 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix mo95 = ninetyfive * MO'
{txt}
{com}. 
. matrix morec95 = ninetyfive * MOrec'
{txt}
{com}. 
. matrix moexp95 = ninetyfive * MOexp'
{txt}
{com}. 
. 
. scalar MO95 = mo95[1,1]
{txt}
{com}. 
. scalar MOrec95 = morec95[1,1]
{txt}
{com}. 
. scalar MOexp95 = moexp95[1,1]
{txt}
{com}. 
. 
. replace exp = MO95 if highschoolstate == 26 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = MOrec95 if highschoolstate == 26 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = MOexp95 if highschoolstate == 26 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix mo96 = ninetysix * MO'
{txt}
{com}. 
. matrix morec96 = ninetysix * MOrec'
{txt}
{com}. 
. matrix moexp96 = ninetysix * MOexp'
{txt}
{com}. 
. 
. scalar MO96 = mo96[1,1]
{txt}
{com}. 
. scalar MOrec96 = morec96[1,1]
{txt}
{com}. 
. scalar MOexp96 = moexp96[1,1]
{txt}
{com}. 
. 
. replace exp = MO96 if highschoolstate == 26 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = MOrec96 if highschoolstate == 26 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = MOexp96 if highschoolstate == 26 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix mo97 = ninetyseven * MO'
{txt}
{com}. 
. matrix morec97 = ninetyseven * MOrec'
{txt}
{com}. 
. matrix moexp97 = ninetyseven * MOexp'
{txt}
{com}. 
. 
. scalar MO97 = mo97[1,1]
{txt}
{com}. 
. scalar MOrec97 = morec97[1,1]
{txt}
{com}. 
. scalar MOexp97 = moexp97[1,1]
{txt}
{com}. 
. 
. replace exp = MO97 if highschoolstate == 26 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = MOrec97 if highschoolstate == 26 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = MOexp97 if highschoolstate == 26 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix mo98 = ninetyeight * MO'
{txt}
{com}. 
. matrix morec98 = ninetyeight * MOrec'
{txt}
{com}. 
. matrix moexp98 = ninetyeight * MOexp'
{txt}
{com}. 
. 
. scalar MO98 = mo98[1,1]
{txt}
{com}. 
. scalar MOrec98 = morec98[1,1]
{txt}
{com}. 
. scalar MOexp98 = moexp98[1,1]
{txt}
{com}. 
. 
. replace exp = MO98 if highschoolstate == 26 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = MOrec98 if highschoolstate == 26 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = MOexp98 if highschoolstate == 26 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *MT|07-16:27
. 
. matrix mt94 = ninetyfour * MT'
{txt}
{com}. 
. matrix mtrec94 = ninetyfour * MTrec'
{txt}
{com}. 
. matrix mtexp94 = ninetyfour * MTexp'
{txt}
{com}. 
. 
. scalar MT94 = mt94[1,1]
{txt}
{com}. 
. scalar MTrec94 = mtrec94[1,1]
{txt}
{com}. 
. scalar MTexp94 = mtexp94[1,1]
{txt}
{com}. 
. 
. replace exp = MT94 if highschoolstate == 27 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = MTrec94 if highschoolstate == 27 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = MTexp94 if highschoolstate == 27 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix mt95 = ninetyfive * MT'
{txt}
{com}. 
. matrix mtrec95 = ninetyfive * MTrec'
{txt}
{com}. 
. matrix mtexp95 = ninetyfive * MTexp'
{txt}
{com}. 
. 
. scalar MT95 = mt95[1,1]
{txt}
{com}. 
. scalar MTrec95 = mtrec95[1,1]
{txt}
{com}. 
. scalar MTexp95 = mtexp95[1,1]
{txt}
{com}. 
. 
. replace exp = MT95 if highschoolstate == 27 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = MTrec95 if highschoolstate == 27 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = MTexp95 if highschoolstate == 27 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix mt96 = ninetysix * MT'
{txt}
{com}. 
. matrix mtrec96 = ninetysix * MTrec'
{txt}
{com}. 
. matrix mtexp96 = ninetysix * MTexp'
{txt}
{com}. 
. 
. scalar MT96 = mt96[1,1]
{txt}
{com}. 
. scalar MTrec96 = mtrec96[1,1]
{txt}
{com}. 
. scalar MTexp96 = mtexp96[1,1]
{txt}
{com}. 
. 
. replace exp = MT96 if highschoolstate == 27 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = MTrec96 if highschoolstate == 27 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = MTexp96 if highschoolstate == 27 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix mt97 = ninetyseven * MT'
{txt}
{com}. 
. matrix mtrec97 = ninetyseven * MTrec'
{txt}
{com}. 
. matrix mtexp97 = ninetyseven * MTexp'
{txt}
{com}. 
. 
. scalar MT97 = mt97[1,1]
{txt}
{com}. 
. scalar MTrec97 = mtrec97[1,1]
{txt}
{com}. 
. scalar MTexp97 = mtexp97[1,1]
{txt}
{com}. 
. 
. replace exp = MT97 if highschoolstate == 27 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = MTrec97 if highschoolstate == 27 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = MTexp97 if highschoolstate == 27 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix mt98 = ninetyeight * MT'
{txt}
{com}. 
. matrix mtrec98 = ninetyeight * MTrec'
{txt}
{com}. 
. matrix mtexp98 = ninetyeight * MTexp'
{txt}
{com}. 
. 
. scalar MT98 = mt98[1,1]
{txt}
{com}. 
. scalar MTrec98 = mtrec98[1,1]
{txt}
{com}. 
. scalar MTexp98 = mtexp98[1,1]
{txt}
{com}. 
. 
. replace exp = MT98 if highschoolstate == 27 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = MTrec98 if highschoolstate == 27 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = MTexp98 if highschoolstate == 27 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *NE|00-12:28
. 
. matrix ne94 = ninetyfour * NE'
{txt}
{com}. 
. matrix nerec94 = ninetyfour * NErec'
{txt}
{com}. 
. matrix neexp94 = ninetyfour * NEexp'
{txt}
{com}. 
. 
. scalar NE94 = ne94[1,1]
{txt}
{com}. 
. scalar NErec94 = nerec94[1,1]
{txt}
{com}. 
. scalar NEexp94 = neexp94[1,1]
{txt}
{com}. 
. 
. replace exp = NE94 if highschoolstate == 28 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = NErec94 if highschoolstate == 28 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = NEexp94 if highschoolstate == 28 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ne95 = ninetyfive * NE'
{txt}
{com}. 
. matrix nerec95 = ninetyfive * NErec'
{txt}
{com}. 
. matrix neexp95 = ninetyfive * NEexp'
{txt}
{com}. 
. 
. scalar NE95 = ne95[1,1]
{txt}
{com}. 
. scalar NErec95 = nerec95[1,1]
{txt}
{com}. 
. scalar NEexp95 = neexp95[1,1]
{txt}
{com}. 
. 
. replace exp = NE95 if highschoolstate == 28 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = NErec95 if highschoolstate == 28 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = NEexp95 if highschoolstate == 28 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix ne96 = ninetysix * NE'
{txt}
{com}. 
. matrix nerec96 = ninetysix * NErec'
{txt}
{com}. 
. matrix neexp96 = ninetysix * NEexp'
{txt}
{com}. 
. 
. scalar NE96 = ne96[1,1]
{txt}
{com}. 
. scalar NErec96 = nerec96[1,1]
{txt}
{com}. 
. scalar NEexp96 = neexp96[1,1]
{txt}
{com}. 
. 
. replace exp = NE96 if highschoolstate == 28 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = NErec96 if highschoolstate == 28 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = NEexp96 if highschoolstate == 28 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix ne97 = ninetyseven * NE'
{txt}
{com}. 
. matrix nerec97 = ninetyseven * NErec'
{txt}
{com}. 
. matrix neexp97 = ninetyseven * NEexp'
{txt}
{com}. 
. 
. scalar NE97 = ne97[1,1]
{txt}
{com}. 
. scalar NErec97 = nerec97[1,1]
{txt}
{com}. 
. scalar NEexp97 = neexp97[1,1]
{txt}
{com}. 
. 
. replace exp = NE97 if highschoolstate == 28 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = NErec97 if highschoolstate == 28 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = NEexp97 if highschoolstate == 28 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix ne98 = ninetyeight * NE'
{txt}
{com}. 
. matrix nerec98 = ninetyeight * NErec'
{txt}
{com}. 
. matrix neexp98 = ninetyeight * NEexp'
{txt}
{com}. 
. 
. scalar NE98 = ne98[1,1]
{txt}
{com}. 
. scalar NErec98 = nerec98[1,1]
{txt}
{com}. 
. scalar NEexp98 = neexp98[1,1]
{txt}
{com}. 
. 
. replace exp = NE98 if highschoolstate == 28 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = NErec98 if highschoolstate == 28 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = NEexp98 if highschoolstate == 28 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *NV|None:29
. 
. *NH|None:30
. 
. *NJ|None:31
. 
. *NM|94-16:32
. 
. matrix nm94 = ninetyfour * NM'
{txt}
{com}. 
. matrix nmrec94 = ninetyfour * NMrec'
{txt}
{com}. 
. matrix nmexp94 = ninetyfour * NMexp'
{txt}
{com}. 
. 
. scalar NM94 = nm94[1,1]
{txt}
{com}. 
. scalar NMrec94 = nmrec94[1,1]
{txt}
{com}. 
. scalar NMexp94 = nmexp94[1,1]
{txt}
{com}. 
. 
. replace exp = NM94 if highschoolstate == 32 & cohort == 1994
{txt}(2 real changes made)

{com}. 
. replace rec = NMrec94 if highschoolstate == 32 & cohort == 1994
{txt}(2 real changes made)

{com}. 
. replace expend = NMexp94 if highschoolstate == 32 & cohort == 1994
{txt}(2 real changes made)

{com}. 
. 
. matrix nm95 = ninetyfive * NM'
{txt}
{com}. 
. matrix nmrec95 = ninetyfive * NMrec'
{txt}
{com}. 
. matrix nmexp95 = ninetyfive * NMexp'
{txt}
{com}. 
. 
. scalar NM95 = nm95[1,1]
{txt}
{com}. 
. scalar NMrec95 = nmrec95[1,1]
{txt}
{com}. 
. scalar NMexp95 = nmexp95[1,1]
{txt}
{com}. 
. 
. replace exp = NM95 if highschoolstate == 32 & cohort == 1995
{txt}(6 real changes made)

{com}. 
. replace rec = NMrec95 if highschoolstate == 32 & cohort == 1995
{txt}(6 real changes made)

{com}. 
. replace expend = NMexp95 if highschoolstate == 32 & cohort == 1995
{txt}(6 real changes made)

{com}. 
. 
. matrix nm96 = ninetysix * NM'
{txt}
{com}. 
. matrix nmrec96 = ninetysix * NMrec'
{txt}
{com}. 
. matrix nmexp96 = ninetysix * NMexp'
{txt}
{com}. 
. 
. scalar NM96 = nm96[1,1]
{txt}
{com}. 
. scalar NMrec96 = nmrec96[1,1]
{txt}
{com}. 
. scalar NMexp96 = nmexp96[1,1]
{txt}
{com}. 
. 
. replace exp = NM96 if highschoolstate == 32 & cohort == 1996
{txt}(7 real changes made)

{com}. 
. replace rec = NMrec96 if highschoolstate == 32 & cohort == 1996
{txt}(7 real changes made)

{com}. 
. replace expend = NMexp96 if highschoolstate == 32 & cohort == 1996
{txt}(7 real changes made)

{com}. 
. 
. matrix nm97 = ninetyseven * NM'
{txt}
{com}. 
. matrix nmrec97 = ninetyseven * NMrec'
{txt}
{com}. 
. matrix nmexp97 = ninetyseven * NMexp'
{txt}
{com}. 
. 
. scalar NM97 = nm97[1,1]
{txt}
{com}. 
. scalar NMrec97 = nmrec97[1,1]
{txt}
{com}. 
. scalar NMexp97 = nmexp97[1,1]
{txt}
{com}. 
. 
. replace exp = NM97 if highschoolstate == 32 & cohort == 1997
{txt}(5 real changes made)

{com}. 
. replace rec = NMrec97 if highschoolstate == 32 & cohort == 1997
{txt}(5 real changes made)

{com}. 
. replace expend = NMexp97 if highschoolstate == 32 & cohort == 1997
{txt}(5 real changes made)

{com}. 
. 
. matrix nm98 = ninetyeight * NM'
{txt}
{com}. 
. matrix nmrec98 = ninetyeight * NMrec'
{txt}
{com}. 
. matrix nmexp98 = ninetyeight * NMexp'
{txt}
{com}. 
. 
. scalar NM98 = nm98[1,1]
{txt}
{com}. 
. scalar NMrec98 = nmrec98[1,1]
{txt}
{com}. 
. scalar NMexp98 = nmexp98[1,1]
{txt}
{com}. 
. 
. replace exp = NM98 if highschoolstate == 32 & cohort == 1998
{txt}(3 real changes made)

{com}. 
. replace rec = NMrec98 if highschoolstate == 32 & cohort == 1998
{txt}(3 real changes made)

{com}. 
. replace expend = NMexp98 if highschoolstate == 32 & cohort == 1998
{txt}(3 real changes made)

{com}. 
. *NY|00-16:33
. 
. matrix ny94 = ninetyfour * NY'
{txt}
{com}. 
. matrix nyrec94 = ninetyfour * NYrec'
{txt}
{com}. 
. matrix nyexp94 = ninetyfour * NYexp'
{txt}
{com}. 
. 
. scalar NY94 = ny94[1,1]
{txt}
{com}. 
. scalar NYrec94 = nyrec94[1,1]
{txt}
{com}. 
. scalar NYexp94 = nyexp94[1,1]
{txt}
{com}. 
. 
. replace exp = NY94 if highschoolstate == 33 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = NYrec94 if highschoolstate == 33 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = NYexp94 if highschoolstate == 33 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ny95 = ninetyfive * NY'
{txt}
{com}. 
. matrix nyrec95 = ninetyfive * NYrec'
{txt}
{com}. 
. matrix nyexp95 = ninetyfive * NYexp'
{txt}
{com}. 
. 
. scalar NY95 = ny95[1,1]
{txt}
{com}. 
. scalar NYrec95 = nyrec95[1,1]
{txt}
{com}. 
. scalar NYexp95 = nyexp95[1,1]
{txt}
{com}. 
. 
. replace exp = NY95 if highschoolstate == 33 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = NYrec95 if highschoolstate == 33 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = NYexp95 if highschoolstate == 33 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix ny96 = ninetysix * NY'
{txt}
{com}. 
. matrix nyrec96 = ninetysix * NYrec'
{txt}
{com}. 
. matrix nyexp96 = ninetysix * NYexp'
{txt}
{com}. 
. 
. scalar NY96 = ny96[1,1]
{txt}
{com}. 
. scalar NYrec96 = nyrec96[1,1]
{txt}
{com}. 
. scalar NYexp96 = nyexp96[1,1]
{txt}
{com}. 
. 
. replace exp = NY96 if highschoolstate == 33 & cohort == 1996
{txt}(35 real changes made)

{com}. 
. replace rec = NYrec96 if highschoolstate == 33 & cohort == 1996
{txt}(35 real changes made)

{com}. 
. replace expend = NYexp96 if highschoolstate == 33 & cohort == 1996
{txt}(35 real changes made)

{com}. 
. 
. matrix ny97 = ninetyseven * NY'
{txt}
{com}. 
. matrix nyrec97 = ninetyseven * NYrec'
{txt}
{com}. 
. matrix nyexp97 = ninetyseven * NYexp'
{txt}
{com}. 
. 
. scalar NY97 = ny97[1,1]
{txt}
{com}. 
. scalar NYrec97 = nyrec97[1,1]
{txt}
{com}. 
. scalar NYexp97 = nyexp97[1,1]
{txt}
{com}. 
. 
. replace exp = NY97 if highschoolstate == 33 & cohort == 1997
{txt}(35 real changes made)

{com}. 
. replace rec = NYrec97 if highschoolstate == 33 & cohort == 1997
{txt}(35 real changes made)

{com}. 
. replace expend = NYexp97 if highschoolstate == 33 & cohort == 1997
{txt}(35 real changes made)

{com}. 
. 
. matrix ny98 = ninetyeight * NY'
{txt}
{com}. 
. matrix nyrec98 = ninetyeight * NYrec'
{txt}
{com}. 
. matrix nyexp98 = ninetyeight * NYexp'
{txt}
{com}. 
. 
. scalar NY98 = ny98[1,1]
{txt}
{com}. 
. scalar NYrec98 = nyrec98[1,1]
{txt}
{com}. 
. scalar NYexp98 = nyexp98[1,1]
{txt}
{com}. 
. 
. replace exp = NY98 if highschoolstate == 33 & cohort == 1998
{txt}(40 real changes made)

{com}. 
. replace rec = NYrec98 if highschoolstate == 33 & cohort == 1998
{txt}(40 real changes made)

{com}. 
. replace expend = NYexp98 if highschoolstate == 33 & cohort == 1998
{txt}(40 real changes made)

{com}. 
. *NC|01-14:34
. 
. matrix nc94 = ninetyfour * NC'
{txt}
{com}. 
. matrix ncrec94 = ninetyfour * NCrec'
{txt}
{com}. 
. matrix ncexp94 = ninetyfour * NCexp'
{txt}
{com}. 
. 
. scalar NC94 = nc94[1,1]
{txt}
{com}. 
. scalar NCrec94 = ncrec94[1,1]
{txt}
{com}. 
. scalar NCexp94 = ncexp94[1,1]
{txt}
{com}. 
. 
. replace exp = NC94 if highschoolstate == 34 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = NCrec94 if highschoolstate == 34 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = NCexp94 if highschoolstate == 34 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix nc95 = ninetyfive * NC'
{txt}
{com}. 
. matrix ncrec95 = ninetyfive * NCrec'
{txt}
{com}. 
. matrix ncexp95 = ninetyfive * NCexp'
{txt}
{com}. 
. 
. scalar NC95 = nc95[1,1]
{txt}
{com}. 
. scalar NCrec95 = ncrec95[1,1]
{txt}
{com}. 
. scalar NCexp95 = ncexp95[1,1]
{txt}
{com}. 
. 
. replace exp = NC95 if highschoolstate == 34 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = NCrec95 if highschoolstate == 34 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = NCexp95 if highschoolstate == 34 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix nc96 = ninetysix * NC'
{txt}
{com}. 
. matrix ncrec96 = ninetysix * NCrec'
{txt}
{com}. 
. matrix ncexp96 = ninetysix * NCexp'
{txt}
{com}. 
. 
. scalar NC96 = nc96[1,1]
{txt}
{com}. 
. scalar NCrec96 = ncrec96[1,1]
{txt}
{com}. 
. scalar NCexp96 = ncexp96[1,1]
{txt}
{com}. 
. 
. replace exp = NC96 if highschoolstate == 34 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = NCrec96 if highschoolstate == 34 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = NCexp96 if highschoolstate == 34 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix nc97 = ninetyseven * NC'
{txt}
{com}. 
. matrix ncrec97 = ninetyseven * NCrec'
{txt}
{com}. 
. matrix ncexp97 = ninetyseven * NCexp'
{txt}
{com}. 
. 
. scalar NC97 = nc97[1,1]
{txt}
{com}. 
. scalar NCrec97 = ncrec97[1,1]
{txt}
{com}. 
. scalar NCexp97 = ncexp97[1,1]
{txt}
{com}. 
. 
. replace exp = NC97 if highschoolstate == 34 & cohort == 1997
{txt}(22 real changes made)

{com}. 
. replace rec = NCrec97 if highschoolstate == 34 & cohort == 1997
{txt}(22 real changes made)

{com}. 
. replace expend = NCexp97 if highschoolstate == 34 & cohort == 1997
{txt}(22 real changes made)

{com}. 
. 
. matrix nc98 = ninetyeight * NC'
{txt}
{com}. 
. matrix ncrec98 = ninetyeight * NCrec'
{txt}
{com}. 
. matrix ncexp98 = ninetyeight * NCexp'
{txt}
{com}. 
. 
. scalar NC98 = nc98[1,1]
{txt}
{com}. 
. scalar NCrec98 = ncrec98[1,1]
{txt}
{com}. 
. scalar NCexp98 = ncexp98[1,1]
{txt}
{com}. 
. 
. replace exp = NC98 if highschoolstate == 34 & cohort == 1998
{txt}(36 real changes made)

{com}. 
. replace rec = NCrec98 if highschoolstate == 34 & cohort == 1998
{txt}(36 real changes made)

{com}. 
. replace expend = NCexp98 if highschoolstate == 34 & cohort == 1998
{txt}(36 real changes made)

{com}. 
. *ND|01-14:35
. 
. matrix nd94 = ninetyfour * ND'
{txt}
{com}. 
. matrix ndrec94 = ninetyfour * NDrec'
{txt}
{com}. 
. matrix ndexp94 = ninetyfour * NDexp'
{txt}
{com}. 
. 
. scalar ND94 = nd94[1,1]
{txt}
{com}. 
. scalar NDrec94 = ndrec94[1,1]
{txt}
{com}. 
. scalar NDexp94 = ndexp94[1,1]
{txt}
{com}. 
. 
. replace exp = ND94 if highschoolstate == 35 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = NDrec94 if highschoolstate == 35 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = NDexp94 if highschoolstate == 35 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix nd95 = ninetyfive * ND'
{txt}
{com}. 
. matrix ndrec95 = ninetyfive * NDrec'
{txt}
{com}. 
. matrix ndexp95 = ninetyfive * NDexp'
{txt}
{com}. 
. 
. scalar ND95 = nd95[1,1]
{txt}
{com}. 
. scalar NDrec95 = ndrec95[1,1]
{txt}
{com}. 
. scalar NDexp95 = ndexp95[1,1]
{txt}
{com}. 
. 
. replace exp = ND95 if highschoolstate == 35 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = NDrec95 if highschoolstate == 35 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = NDexp95 if highschoolstate == 35 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix nd96 = ninetysix * ND'
{txt}
{com}. 
. matrix ndrec96 = ninetysix * NDrec'
{txt}
{com}. 
. matrix ndexp96 = ninetysix * NDexp'
{txt}
{com}. 
. 
. scalar ND96 = nd96[1,1]
{txt}
{com}. 
. scalar NDrec96 = ndrec96[1,1]
{txt}
{com}. 
. scalar NDexp96 = ndexp96[1,1]
{txt}
{com}. 
. 
. replace exp = ND96 if highschoolstate == 35 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = NDrec96 if highschoolstate == 35 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = NDexp96 if highschoolstate == 35 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix nd97 = ninetyseven * ND'
{txt}
{com}. 
. matrix ndrec97 = ninetyseven * NDrec'
{txt}
{com}. 
. matrix ndexp97 = ninetyseven * NDexp'
{txt}
{com}. 
. 
. scalar ND97 = nd97[1,1]
{txt}
{com}. 
. scalar NDrec97 = ndrec97[1,1]
{txt}
{com}. 
. scalar NDexp97 = ndexp97[1,1]
{txt}
{com}. 
. 
. replace exp = ND97 if highschoolstate == 35 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. replace rec = NDrec97 if highschoolstate == 35 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. replace expend = NDexp97 if highschoolstate == 35 & cohort == 1997
{txt}(9 real changes made)

{com}. 
. 
. matrix nd98 = ninetyeight * ND'
{txt}
{com}. 
. matrix ndrec98 = ninetyeight * NDrec'
{txt}
{com}. 
. matrix ndexp98 = ninetyeight * NDexp'
{txt}
{com}. 
. 
. scalar ND98 = nd98[1,1]
{txt}
{com}. 
. scalar NDrec98 = ndrec98[1,1]
{txt}
{com}. 
. scalar NDexp98 = ndexp98[1,1]
{txt}
{com}. 
. 
. replace exp = ND98 if highschoolstate == 35 & cohort == 1998
{txt}(3 real changes made)

{com}. 
. replace rec = NDrec98 if highschoolstate == 35 & cohort == 1998
{txt}(3 real changes made)

{com}. 
. replace expend = NDexp98 if highschoolstate == 35 & cohort == 1998
{txt}(3 real changes made)

{com}. 
. *OH|09-16:36
. 
. matrix oh94 = ninetyfour * OH'
{txt}
{com}. 
. matrix ohrec94 = ninetyfour * OHrec'
{txt}
{com}. 
. matrix ohexp94 = ninetyfour * OHexp'
{txt}
{com}. 
. 
. scalar OH94 = oh94[1,1]
{txt}
{com}. 
. scalar OHrec94 = ohrec94[1,1]
{txt}
{com}. 
. scalar OHexp94 = ohexp94[1,1]
{txt}
{com}. 
. 
. replace exp = OH94 if highschoolstate == 36 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = OHrec94 if highschoolstate == 36 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = OHexp94 if highschoolstate == 36 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix oh95 = ninetyfive * OH'
{txt}
{com}. 
. matrix ohrec95 = ninetyfive * OHrec'
{txt}
{com}. 
. matrix ohexp95 = ninetyfive * OHexp'
{txt}
{com}. 
. 
. scalar OH95 = oh95[1,1]
{txt}
{com}. 
. scalar OHrec95 = ohrec95[1,1]
{txt}
{com}. 
. scalar OHexp95 = ohexp95[1,1]
{txt}
{com}. 
. 
. replace exp = OH95 if highschoolstate == 36 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = OHrec95 if highschoolstate == 36 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = OHexp95 if highschoolstate == 36 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix oh96 = ninetysix * OH'
{txt}
{com}. 
. matrix ohrec96 = ninetysix * OHrec'
{txt}
{com}. 
. matrix ohexp96 = ninetysix * OHexp'
{txt}
{com}. 
. 
. scalar OH96 = oh96[1,1]
{txt}
{com}. 
. scalar OHrec96 = ohrec96[1,1]
{txt}
{com}. 
. scalar OHexp96 = ohexp96[1,1]
{txt}
{com}. 
. 
. replace exp = OH96 if highschoolstate == 36 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = OHrec96 if highschoolstate == 36 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = OHexp96 if highschoolstate == 36 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix oh97 = ninetyseven * OH'
{txt}
{com}. 
. matrix ohrec97 = ninetyseven * OHrec'
{txt}
{com}. 
. matrix ohexp97 = ninetyseven * OHexp'
{txt}
{com}. 
. 
. scalar OH97 = oh97[1,1]
{txt}
{com}. 
. scalar OHrec97 = ohrec97[1,1]
{txt}
{com}. 
. scalar OHexp97 = ohexp97[1,1]
{txt}
{com}. 
. 
. replace exp = OH97 if highschoolstate == 36 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = OHrec97 if highschoolstate == 36 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = OHexp97 if highschoolstate == 36 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix oh98 = ninetyeight * OH'
{txt}
{com}. 
. matrix ohrec98 = ninetyeight * OHrec'
{txt}
{com}. 
. matrix ohexp98 = ninetyeight * OHexp'
{txt}
{com}. 
. 
. scalar OH98 = oh98[1,1]
{txt}
{com}. 
. scalar OHrec98 = ohrec98[1,1]
{txt}
{com}. 
. scalar OHexp98 = ohexp98[1,1]
{txt}
{com}. 
. 
. replace exp = OH98 if highschoolstate == 36 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = OHrec98 if highschoolstate == 36 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = OHexp98 if highschoolstate == 36 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *OK|85-16:37
. 
. matrix ok94 = ninetyfour * OK'
{txt}
{com}. 
. matrix okrec94 = ninetyfour * OKrec'
{txt}
{com}. 
. matrix okexp94 = ninetyfour * OKexp'
{txt}
{com}. 
. 
. scalar OK94 = ok94[1,1]
{txt}
{com}. 
. scalar OKrec94 = okrec94[1,1]
{txt}
{com}. 
. scalar OKexp94 = okexp94[1,1]
{txt}
{com}. 
. 
. replace exp = OK94 if highschoolstate == 37 & cohort == 1994
{txt}(14 real changes made)

{com}. 
. replace rec = OKrec94 if highschoolstate == 37 & cohort == 1994
{txt}(14 real changes made)

{com}. 
. replace expend = OKexp94 if highschoolstate == 37 & cohort == 1994
{txt}(14 real changes made)

{com}. 
. 
. matrix ok95 = ninetyfive * OK'
{txt}
{com}. 
. matrix okrec95 = ninetyfive * OKrec'
{txt}
{com}. 
. matrix okexp95 = ninetyfive * OKexp'
{txt}
{com}. 
. 
. scalar OK95 = ok95[1,1]
{txt}
{com}. 
. scalar OKrec95 = okrec95[1,1]
{txt}
{com}. 
. scalar OKexp95 = okexp95[1,1]
{txt}
{com}. 
. 
. replace exp = OK95 if highschoolstate == 37 & cohort == 1995
{txt}(18 real changes made)

{com}. 
. replace rec = OKrec95 if highschoolstate == 37 & cohort == 1995
{txt}(18 real changes made)

{com}. 
. replace expend = OKexp95 if highschoolstate == 37 & cohort == 1995
{txt}(18 real changes made)

{com}. 
. 
. matrix ok96 = ninetysix * OK'
{txt}
{com}. 
. matrix okrec96 = ninetysix * OKrec'
{txt}
{com}. 
. matrix okexp96 = ninetysix * OKexp'
{txt}
{com}. 
. 
. scalar OK96 = ok96[1,1]
{txt}
{com}. 
. scalar OKrec96 = okrec96[1,1]
{txt}
{com}. 
. scalar OKexp96 = okexp96[1,1]
{txt}
{com}. 
. 
. replace exp = OK96 if highschoolstate == 37 & cohort == 1996
{txt}(11 real changes made)

{com}. 
. replace rec = OKrec96 if highschoolstate == 37 & cohort == 1996
{txt}(11 real changes made)

{com}. 
. replace expend = OKexp96 if highschoolstate == 37 & cohort == 1996
{txt}(11 real changes made)

{com}. 
. 
. matrix ok97 = ninetyseven * OK'
{txt}
{com}. 
. matrix okrec97 = ninetyseven * OKrec'
{txt}
{com}. 
. matrix okexp97 = ninetyseven * OKexp'
{txt}
{com}. 
. 
. scalar OK97 = ok97[1,1]
{txt}
{com}. 
. scalar OKrec97 = okrec97[1,1]
{txt}
{com}. 
. scalar OKexp97 = okexp97[1,1]
{txt}
{com}. 
. 
. replace exp = OK97 if highschoolstate == 37 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. replace rec = OKrec97 if highschoolstate == 37 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. replace expend = OKexp97 if highschoolstate == 37 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. 
. matrix ok98 = ninetyeight * OK'
{txt}
{com}. 
. matrix okrec98 = ninetyeight * OKrec'
{txt}
{com}. 
. matrix okexp98 = ninetyeight * OKexp'
{txt}
{com}. 
. 
. scalar OK98 = ok98[1,1]
{txt}
{com}. 
. scalar OKrec98 = okrec98[1,1]
{txt}
{com}. 
. scalar OKexp98 = okexp98[1,1]
{txt}
{com}. 
. 
. replace exp = OK98 if highschoolstate == 37 & cohort == 1998
{txt}(12 real changes made)

{com}. 
. replace rec = OKrec98 if highschoolstate == 37 & cohort == 1998
{txt}(12 real changes made)

{com}. 
. replace expend = OKexp98 if highschoolstate == 37 & cohort == 1998
{txt}(12 real changes made)

{com}. 
. *OR|None:38
. 
. *PA|84-08:39
. 
. matrix pa94 = ninetyfour * PA'
{txt}
{com}. 
. matrix parec94 = ninetyfour * PArec'
{txt}
{com}. 
. matrix paexp94 = ninetyfour * PAexp'
{txt}
{com}. 
. 
. scalar PA94 = pa94[1,1]
{txt}
{com}. 
. scalar PArec94 = parec94[1,1]
{txt}
{com}. 
. scalar PAexp94 = paexp94[1,1]
{txt}
{com}. 
. 
. replace exp = PA94 if highschoolstate == 39 & cohort == 1994
{txt}(30 real changes made)

{com}. 
. replace rec = PArec94 if highschoolstate == 39 & cohort == 1994
{txt}(30 real changes made)

{com}. 
. replace expend = PAexp94 if highschoolstate == 39 & cohort == 1994
{txt}(30 real changes made)

{com}. 
. 
. matrix pa95 = ninetyfive * PA'
{txt}
{com}. 
. matrix parec95 = ninetyfive * PArec'
{txt}
{com}. 
. matrix paexp95 = ninetyfive * PAexp'
{txt}
{com}. 
. 
. scalar PA95 = pa95[1,1]
{txt}
{com}. 
. scalar PArec95 = parec95[1,1]
{txt}
{com}. 
. scalar PAexp95 = paexp95[1,1]
{txt}
{com}. 
. 
. replace exp = PA95 if highschoolstate == 39 & cohort == 1995
{txt}(29 real changes made)

{com}. 
. replace rec = PArec95 if highschoolstate == 39 & cohort == 1995
{txt}(29 real changes made)

{com}. 
. replace expend = PAexp95 if highschoolstate == 39 & cohort == 1995
{txt}(29 real changes made)

{com}. 
. 
. matrix pa96 = ninetysix * PA'
{txt}
{com}. 
. matrix parec96 = ninetysix * PArec'
{txt}
{com}. 
. matrix paexp96 = ninetysix * PAexp'
{txt}
{com}. 
. 
. scalar PA96 = pa96[1,1]
{txt}
{com}. 
. scalar PArec96 = parec96[1,1]
{txt}
{com}. 
. scalar PAexp96 = paexp96[1,1]
{txt}
{com}. 
. 
. replace exp = PA96 if highschoolstate == 39 & cohort == 1996
{txt}(22 real changes made)

{com}. 
. replace rec = PArec96 if highschoolstate == 39 & cohort == 1996
{txt}(22 real changes made)

{com}. 
. replace expend = PAexp96 if highschoolstate == 39 & cohort == 1996
{txt}(22 real changes made)

{com}. 
. 
. matrix pa97 = ninetyseven * PA'
{txt}
{com}. 
. matrix parec97 = ninetyseven * PArec'
{txt}
{com}. 
. matrix paexp97 = ninetyseven * PAexp'
{txt}
{com}. 
. 
. scalar PA97 = pa97[1,1]
{txt}
{com}. 
. scalar PArec97 = parec97[1,1]
{txt}
{com}. 
. scalar PAexp97 = paexp97[1,1]
{txt}
{com}. 
. 
. replace exp = PA97 if highschoolstate == 39 & cohort == 1997
{txt}(24 real changes made)

{com}. 
. replace rec = PArec97 if highschoolstate == 39 & cohort == 1997
{txt}(24 real changes made)

{com}. 
. replace expend = PAexp97 if highschoolstate == 39 & cohort == 1997
{txt}(24 real changes made)

{com}. 
. 
. matrix pa98 = ninetyeight * PA'
{txt}
{com}. 
. matrix parec98 = ninetyeight * PArec'
{txt}
{com}. 
. matrix paexp98 = ninetyeight * PAexp'
{txt}
{com}. 
. 
. scalar PA98 = pa98[1,1]
{txt}
{com}. 
. scalar PArec98 = parec98[1,1]
{txt}
{com}. 
. scalar PAexp98 = paexp98[1,1]
{txt}
{com}. 
. 
. replace exp = PA98 if highschoolstate == 39 & cohort == 1998
{txt}(23 real changes made)

{com}. 
. replace rec = PArec98 if highschoolstate == 39 & cohort == 1998
{txt}(23 real changes made)

{com}. 
. replace expend = PAexp98 if highschoolstate == 39 & cohort == 1998
{txt}(23 real changes made)

{com}. 
. *RI|None:40
. 
. *SC|84-16:41
. 
. matrix sc94 = ninetyfour * SC'
{txt}
{com}. 
. matrix screc94 = ninetyfour * SCrec'
{txt}
{com}. 
. matrix scexp94 = ninetyfour * SCexp'
{txt}
{com}. 
. 
. scalar SC94 = sc94[1,1]
{txt}
{com}. 
. scalar SCrec94 = screc94[1,1]
{txt}
{com}. 
. scalar SCexp94 = scexp94[1,1]
{txt}
{com}. 
. 
. replace exp = SC94 if highschoolstate == 41 & cohort == 1994
{txt}(8 real changes made)

{com}. 
. replace rec = SCrec94 if highschoolstate == 41 & cohort == 1994
{txt}(8 real changes made)

{com}. 
. replace expend = SCexp94 if highschoolstate == 41 & cohort == 1994
{txt}(8 real changes made)

{com}. 
. 
. matrix sc95 = ninetyfive * SC'
{txt}
{com}. 
. matrix screc95 = ninetyfive * SCrec'
{txt}
{com}. 
. matrix scexp95 = ninetyfive * SCexp'
{txt}
{com}. 
. 
. scalar SC95 = sc95[1,1]
{txt}
{com}. 
. scalar SCrec95 = screc95[1,1]
{txt}
{com}. 
. scalar SCexp95 = scexp95[1,1]
{txt}
{com}. 
. 
. replace exp = SC95 if highschoolstate == 41 & cohort == 1995
{txt}(16 real changes made)

{com}. 
. replace rec = SCrec95 if highschoolstate == 41 & cohort == 1995
{txt}(16 real changes made)

{com}. 
. replace expend = SCexp95 if highschoolstate == 41 & cohort == 1995
{txt}(16 real changes made)

{com}. 
. 
. matrix sc96 = ninetysix * SC'
{txt}
{com}. 
. matrix screc96 = ninetysix * SCrec'
{txt}
{com}. 
. matrix scexp96 = ninetysix * SCexp'
{txt}
{com}. 
. 
. scalar SC96 = sc96[1,1]
{txt}
{com}. 
. scalar SCrec96 = screc96[1,1]
{txt}
{com}. 
. scalar SCexp96 = scexp96[1,1]
{txt}
{com}. 
. 
. replace exp = SC96 if highschoolstate == 41 & cohort == 1996
{txt}(10 real changes made)

{com}. 
. replace rec = SCrec96 if highschoolstate == 41 & cohort == 1996
{txt}(10 real changes made)

{com}. 
. replace expend = SCexp96 if highschoolstate == 41 & cohort == 1996
{txt}(10 real changes made)

{com}. 
. 
. matrix sc97 = ninetyseven * SC'
{txt}
{com}. 
. matrix screc97 = ninetyseven * SCrec'
{txt}
{com}. 
. matrix scexp97 = ninetyseven * SCexp'
{txt}
{com}. 
. 
. scalar SC97 = sc97[1,1]
{txt}
{com}. 
. scalar SCrec97 = screc97[1,1]
{txt}
{com}. 
. scalar SCexp97 = scexp97[1,1]
{txt}
{com}. 
. 
. replace exp = SC97 if highschoolstate == 41 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. replace rec = SCrec97 if highschoolstate == 41 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. replace expend = SCexp97 if highschoolstate == 41 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. 
. matrix sc98 = ninetyeight * SC'
{txt}
{com}. 
. matrix screc98 = ninetyeight * SCrec'
{txt}
{com}. 
. matrix scexp98 = ninetyeight * SCexp'
{txt}
{com}. 
. 
. scalar SC98 = sc98[1,1]
{txt}
{com}. 
. scalar SCrec98 = screc98[1,1]
{txt}
{com}. 
. scalar SCexp98 = scexp98[1,1]
{txt}
{com}. 
. 
. replace exp = SC98 if highschoolstate == 41 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. replace rec = SCrec98 if highschoolstate == 41 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. replace expend = SCexp98 if highschoolstate == 41 & cohort == 1998
{txt}(11 real changes made)

{com}. 
. *SD|03-16:42
. 
. matrix sd94 = ninetyfour * SD'
{txt}
{com}. 
. matrix sdrec94 = ninetyfour * SDrec'
{txt}
{com}. 
. matrix sdexp94 = ninetyfour * SDexp'
{txt}
{com}. 
. 
. scalar SD94 = sd94[1,1]
{txt}
{com}. 
. scalar SDrec94 = sdrec94[1,1]
{txt}
{com}. 
. scalar SDexp94 = sdexp94[1,1]
{txt}
{com}. 
. 
. replace exp = SD94 if highschoolstate == 42 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = SDrec94 if highschoolstate == 42 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = SDexp94 if highschoolstate == 42 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix sd95 = ninetyfive * SD'
{txt}
{com}. 
. matrix sdrec95 = ninetyfive * SDrec'
{txt}
{com}. 
. matrix sdexp95 = ninetyfive * SDexp'
{txt}
{com}. 
. 
. scalar SD95 = sd95[1,1]
{txt}
{com}. 
. scalar SDrec95 = sdrec95[1,1]
{txt}
{com}. 
. scalar SDexp95 = sdexp95[1,1]
{txt}
{com}. 
. 
. replace exp = SD95 if highschoolstate == 42 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = SDrec95 if highschoolstate == 42 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = SDexp95 if highschoolstate == 42 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix sd96 = ninetysix * SD'
{txt}
{com}. 
. matrix sdrec96 = ninetysix * SDrec'
{txt}
{com}. 
. matrix sdexp96 = ninetysix * SDexp'
{txt}
{com}. 
. 
. scalar SD96 = sd96[1,1]
{txt}
{com}. 
. scalar SDrec96 = sdrec96[1,1]
{txt}
{com}. 
. scalar SDexp96 = sdexp96[1,1]
{txt}
{com}. 
. 
. replace exp = SD96 if highschoolstate == 42 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = SDrec96 if highschoolstate == 42 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = SDexp96 if highschoolstate == 42 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix sd97 = ninetyseven * SD'
{txt}
{com}. 
. matrix sdrec97 = ninetyseven * SDrec'
{txt}
{com}. 
. matrix sdexp97 = ninetyseven * SDexp'
{txt}
{com}. 
. 
. scalar SD97 = sd97[1,1]
{txt}
{com}. 
. scalar SDrec97 = sdrec97[1,1]
{txt}
{com}. 
. scalar SDexp97 = sdexp97[1,1]
{txt}
{com}. 
. 
. replace exp = SD97 if highschoolstate == 42 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = SDrec97 if highschoolstate == 42 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = SDexp97 if highschoolstate == 42 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix sd98 = ninetyeight * SD'
{txt}
{com}. 
. matrix sdrec98 = ninetyeight * SDrec'
{txt}
{com}. 
. matrix sdexp98 = ninetyeight * SDexp'
{txt}
{com}. 
. 
. scalar SD98 = sd98[1,1]
{txt}
{com}. 
. scalar SDrec98 = sdrec98[1,1]
{txt}
{com}. 
. scalar SDexp98 = sdexp98[1,1]
{txt}
{com}. 
. 
. replace exp = SD98 if highschoolstate == 42 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = SDrec98 if highschoolstate == 42 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = SDexp98 if highschoolstate == 42 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *TN|91-14:43
. 
. matrix tn94 = ninetyfour * TN'
{txt}
{com}. 
. matrix tnrec94 = ninetyfour * TNrec'
{txt}
{com}. 
. matrix tnexp94 = ninetyfour * TNexp'
{txt}
{com}. 
. 
. scalar TN94 = tn94[1,1]
{txt}
{com}. 
. scalar TNrec94 = tnrec94[1,1]
{txt}
{com}. 
. scalar TNexp94 = tnexp94[1,1]
{txt}
{com}. 
. 
. replace exp = TN94 if highschoolstate == 43 & cohort == 1994
{txt}(19 real changes made)

{com}. 
. replace rec = TNrec94 if highschoolstate == 43 & cohort == 1994
{txt}(19 real changes made)

{com}. 
. replace expend = TNexp94 if highschoolstate == 43 & cohort == 1994
{txt}(19 real changes made)

{com}. 
. 
. matrix tn95 = ninetyfive * TN'
{txt}
{com}. 
. matrix tnrec95 = ninetyfive * TNrec'
{txt}
{com}. 
. matrix tnexp95 = ninetyfive * TNexp'
{txt}
{com}. 
. 
. scalar TN95 = tn95[1,1]
{txt}
{com}. 
. scalar TNrec95 = tnrec95[1,1]
{txt}
{com}. 
. scalar TNexp95 = tnexp95[1,1]
{txt}
{com}. 
. 
. replace exp = TN95 if highschoolstate == 43 & cohort == 1995
{txt}(15 real changes made)

{com}. 
. replace rec = TNrec95 if highschoolstate == 43 & cohort == 1995
{txt}(15 real changes made)

{com}. 
. replace expend = TNexp95 if highschoolstate == 43 & cohort == 1995
{txt}(15 real changes made)

{com}. 
. 
. matrix tn96 = ninetysix * TN'
{txt}
{com}. 
. matrix tnrec96 = ninetysix * TNrec'
{txt}
{com}. 
. matrix tnexp96 = ninetysix * TNexp'
{txt}
{com}. 
. 
. scalar TN96 = tn96[1,1]
{txt}
{com}. 
. scalar TNrec96 = tnrec96[1,1]
{txt}
{com}. 
. scalar TNexp96 = tnexp96[1,1]
{txt}
{com}. 
. 
. replace exp = TN96 if highschoolstate == 43 & cohort == 1996
{txt}(13 real changes made)

{com}. 
. replace rec = TNrec96 if highschoolstate == 43 & cohort == 1996
{txt}(13 real changes made)

{com}. 
. replace expend = TNexp96 if highschoolstate == 43 & cohort == 1996
{txt}(13 real changes made)

{com}. 
. 
. matrix tn97 = ninetyseven * TN'
{txt}
{com}. 
. matrix tnrec97 = ninetyseven * TNrec'
{txt}
{com}. 
. matrix tnexp97 = ninetyseven * TNexp'
{txt}
{com}. 
. 
. scalar TN97 = tn97[1,1]
{txt}
{com}. 
. scalar TNrec97 = tnrec97[1,1]
{txt}
{com}. 
. scalar TNexp97 = tnexp97[1,1]
{txt}
{com}. 
. 
. replace exp = TN97 if highschoolstate == 43 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. replace rec = TNrec97 if highschoolstate == 43 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. replace expend = TNexp97 if highschoolstate == 43 & cohort == 1997
{txt}(11 real changes made)

{com}. 
. 
. matrix tn98 = ninetyeight * TN'
{txt}
{com}. 
. matrix tnrec98 = ninetyeight * TNrec'
{txt}
{com}. 
. matrix tnexp98 = ninetyeight * TNexp'
{txt}
{com}. 
. 
. scalar TN98 = tn98[1,1]
{txt}
{com}. 
. scalar TNrec98 = tnrec98[1,1]
{txt}
{com}. 
. scalar TNexp98 = tnexp98[1,1]
{txt}
{com}. 
. 
. replace exp = TN98 if highschoolstate == 43 & cohort == 1998
{txt}(17 real changes made)

{com}. 
. replace rec = TNrec98 if highschoolstate == 43 & cohort == 1998
{txt}(17 real changes made)

{com}. 
. replace expend = TNexp98 if highschoolstate == 43 & cohort == 1998
{txt}(17 real changes made)

{com}. 
. *TX|01-16:44
. 
. matrix tx94 = ninetyfour * TX'
{txt}
{com}. 
. matrix txrec94 = ninetyfour * TXrec'
{txt}
{com}. 
. matrix txexp94 = ninetyfour * TXexp'
{txt}
{com}. 
. 
. scalar TX94 = tx94[1,1]
{txt}
{com}. 
. scalar TXrec94 = txrec94[1,1]
{txt}
{com}. 
. scalar TXexp94 = txexp94[1,1]
{txt}
{com}. 
. 
. replace exp = TX94 if highschoolstate == 44 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = TXrec94 if highschoolstate == 44 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = TXexp94 if highschoolstate == 44 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix tx95 = ninetyfive * TX'
{txt}
{com}. 
. matrix txrec95 = ninetyfive * TXrec'
{txt}
{com}. 
. matrix txexp95 = ninetyfive * TXexp'
{txt}
{com}. 
. 
. scalar TX95 = tx95[1,1]
{txt}
{com}. 
. scalar TXrec95 = txrec95[1,1]
{txt}
{com}. 
. scalar TXexp95 = txexp95[1,1]
{txt}
{com}. 
. 
. replace exp = TX95 if highschoolstate == 44 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = TXrec95 if highschoolstate == 44 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = TXexp95 if highschoolstate == 44 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix tx96 = ninetysix * TX'
{txt}
{com}. 
. matrix txrec96 = ninetysix * TXrec'
{txt}
{com}. 
. matrix txexp96 = ninetysix * TXexp'
{txt}
{com}. 
. 
. scalar TX96 = tx96[1,1]
{txt}
{com}. 
. scalar TXrec96 = txrec96[1,1]
{txt}
{com}. 
. scalar TXexp96 = txexp96[1,1]
{txt}
{com}. 
. 
. replace exp = TX96 if highschoolstate == 44 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = TXrec96 if highschoolstate == 44 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = TXexp96 if highschoolstate == 44 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix tx97 = ninetyseven * TX'
{txt}
{com}. 
. matrix txrec97 = ninetyseven * TXrec'
{txt}
{com}. 
. matrix txexp97 = ninetyseven * TXexp'
{txt}
{com}. 
. 
. scalar TX97 = tx97[1,1]
{txt}
{com}. 
. scalar TXrec97 = txrec97[1,1]
{txt}
{com}. 
. scalar TXexp97 = txexp97[1,1]
{txt}
{com}. 
. 
. replace exp = TX97 if highschoolstate == 44 & cohort == 1997
{txt}(49 real changes made)

{com}. 
. replace rec = TXrec97 if highschoolstate == 44 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = TXexp97 if highschoolstate == 44 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix tx98 = ninetyeight * TX'
{txt}
{com}. 
. matrix txrec98 = ninetyeight * TXrec'
{txt}
{com}. 
. matrix txexp98 = ninetyeight * TXexp'
{txt}
{com}. 
. 
. scalar TX98 = tx98[1,1]
{txt}
{com}. 
. scalar TXrec98 = txrec98[1,1]
{txt}
{com}. 
. scalar TXexp98 = txexp98[1,1]
{txt}
{com}. 
. 
. replace exp = TX98 if highschoolstate == 44 & cohort == 1998
{txt}(68 real changes made)

{com}. 
. replace rec = TXrec98 if highschoolstate == 44 & cohort == 1998
{txt}(68 real changes made)

{com}. 
. replace expend = TXexp98 if highschoolstate == 44 & cohort == 1998
{txt}(68 real changes made)

{com}. 
. *UT|96-16:45
. 
. matrix ut94 = ninetyfour * UT'
{txt}
{com}. 
. matrix utrec94 = ninetyfour * UTrec'
{txt}
{com}. 
. matrix utexp94 = ninetyfour * UTexp'
{txt}
{com}. 
. 
. scalar UT94 = ut94[1,1]
{txt}
{com}. 
. scalar UTrec94 = utrec94[1,1]
{txt}
{com}. 
. scalar UTexp94 = utexp94[1,1]
{txt}
{com}. 
. 
. replace exp = UT94 if highschoolstate == 45 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = UTrec94 if highschoolstate == 45 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = UTexp94 if highschoolstate == 45 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix ut95 = ninetyfive * UT'
{txt}
{com}. 
. matrix utrec95 = ninetyfive * UTrec'
{txt}
{com}. 
. matrix utexp95 = ninetyfive * UTexp'
{txt}
{com}. 
. 
. scalar UT95 = ut95[1,1]
{txt}
{com}. 
. scalar UTrec95 = utrec95[1,1]
{txt}
{com}. 
. scalar UTexp95 = utexp95[1,1]
{txt}
{com}. 
. 
. replace exp = UT95 if highschoolstate == 45 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = UTrec95 if highschoolstate == 45 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = UTexp95 if highschoolstate == 45 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix ut96 = ninetysix * UT'
{txt}
{com}. 
. matrix utrec96 = ninetysix * UTrec'
{txt}
{com}. 
. matrix utexp96 = ninetysix * UTexp'
{txt}
{com}. 
. 
. scalar UT96 = ut96[1,1]
{txt}
{com}. 
. scalar UTrec96 = utrec96[1,1]
{txt}
{com}. 
. scalar UTexp96 = utexp96[1,1]
{txt}
{com}. 
. 
. replace exp = UT96 if highschoolstate == 45 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = UTrec96 if highschoolstate == 45 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = UTexp96 if highschoolstate == 45 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix ut97 = ninetyseven * UT'
{txt}
{com}. 
. matrix utrec97 = ninetyseven * UTrec'
{txt}
{com}. 
. matrix utexp97 = ninetyseven * UTexp'
{txt}
{com}. 
. 
. scalar UT97 = ut97[1,1]
{txt}
{com}. 
. scalar UTrec97 = utrec97[1,1]
{txt}
{com}. 
. scalar UTexp97 = utexp97[1,1]
{txt}
{com}. 
. 
. replace exp = UT97 if highschoolstate == 45 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = UTrec97 if highschoolstate == 45 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = UTexp97 if highschoolstate == 45 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix ut98 = ninetyeight * UT'
{txt}
{com}. 
. matrix utrec98 = ninetyeight * UTrec'
{txt}
{com}. 
. matrix utexp98 = ninetyeight * UTexp'
{txt}
{com}. 
. 
. scalar UT98 = ut98[1,1]
{txt}
{com}. 
. scalar UTrec98 = utrec98[1,1]
{txt}
{com}. 
. scalar UTexp98 = utexp98[1,1]
{txt}
{com}. 
. 
. replace exp = UT98 if highschoolstate == 45 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = UTrec98 if highschoolstate == 45 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = UTexp98 if highschoolstate == 45 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *VT|None:46
. 
. *VA|02-14:47
. 
. matrix va94 = ninetyfour * VA'
{txt}
{com}. 
. matrix varec94 = ninetyfour * VArec'
{txt}
{com}. 
. matrix vaexp94 = ninetyfour * VAexp'
{txt}
{com}. 
. 
. scalar VA94 = va94[1,1]
{txt}
{com}. 
. scalar VArec94 = varec94[1,1]
{txt}
{com}. 
. scalar VAexp94 = vaexp94[1,1]
{txt}
{com}. 
. 
. replace exp = VA94 if highschoolstate == 47 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = VArec94 if highschoolstate == 47 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = VAexp94 if highschoolstate == 47 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix va95 = ninetyfive * VA'
{txt}
{com}. 
. matrix varec95 = ninetyfive * VArec'
{txt}
{com}. 
. matrix vaexp95 = ninetyfive * VAexp'
{txt}
{com}. 
. 
. scalar VA95 = va95[1,1]
{txt}
{com}. 
. scalar VArec95 = varec95[1,1]
{txt}
{com}. 
. scalar VAexp95 = vaexp95[1,1]
{txt}
{com}. 
. 
. replace exp = VA95 if highschoolstate == 47 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = VArec95 if highschoolstate == 47 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = VAexp95 if highschoolstate == 47 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix va96 = ninetysix * VA'
{txt}
{com}. 
. matrix varec96 = ninetysix * VArec'
{txt}
{com}. 
. matrix vaexp96 = ninetysix * VAexp'
{txt}
{com}. 
. 
. scalar VA96 = va96[1,1]
{txt}
{com}. 
. scalar VArec96 = varec96[1,1]
{txt}
{com}. 
. scalar VAexp96 = vaexp96[1,1]
{txt}
{com}. 
. 
. replace exp = VA96 if highschoolstate == 47 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = VArec96 if highschoolstate == 47 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = VAexp96 if highschoolstate == 47 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix va97 = ninetyseven * VA'
{txt}
{com}. 
. matrix varec97 = ninetyseven * VArec'
{txt}
{com}. 
. matrix vaexp97 = ninetyseven * VAexp'
{txt}
{com}. 
. 
. scalar VA97 = va97[1,1]
{txt}
{com}. 
. scalar VArec97 = varec97[1,1]
{txt}
{com}. 
. scalar VAexp97 = vaexp97[1,1]
{txt}
{com}. 
. 
. replace exp = VA97 if highschoolstate == 47 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = VArec97 if highschoolstate == 47 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = VAexp97 if highschoolstate == 47 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix va98 = ninetyeight * VA'
{txt}
{com}. 
. matrix varec98 = ninetyeight * VArec'
{txt}
{com}. 
. matrix vaexp98 = ninetyeight * VAexp'
{txt}
{com}. 
. 
. scalar VA98 = va98[1,1]
{txt}
{com}. 
. scalar VArec98 = varec98[1,1]
{txt}
{com}. 
. scalar VAexp98 = vaexp98[1,1]
{txt}
{com}. 
. 
. replace exp = VA98 if highschoolstate == 47 & cohort == 1998
{txt}(30 real changes made)

{com}. 
. replace rec = VArec98 if highschoolstate == 47 & cohort == 1998
{txt}(30 real changes made)

{com}. 
. replace expend = VAexp98 if highschoolstate == 47 & cohort == 1998
{txt}(30 real changes made)

{com}. 
. *WA|83-14:48
. 
. matrix wa94 = ninetyfour * WA'
{txt}
{com}. 
. matrix warec94 = ninetyfour * WArec'
{txt}
{com}. 
. matrix waexp94 = ninetyfour * WAexp'
{txt}
{com}. 
. 
. scalar WA94 = wa94[1,1]
{txt}
{com}. 
. scalar WArec94 = warec94[1,1]
{txt}
{com}. 
. scalar WAexp94 = waexp94[1,1]
{txt}
{com}. 
. 
. replace exp = WA94 if highschoolstate == 48 & cohort == 1994
{txt}(13 real changes made)

{com}. 
. replace rec = WArec94 if highschoolstate == 48 & cohort == 1994
{txt}(13 real changes made)

{com}. 
. replace expend = WAexp94 if highschoolstate == 48 & cohort == 1994
{txt}(13 real changes made)

{com}. 
. 
. matrix wa95 = ninetyfive * WA'
{txt}
{com}. 
. matrix warec95 = ninetyfive * WArec'
{txt}
{com}. 
. matrix waexp95 = ninetyfive * WAexp'
{txt}
{com}. 
. 
. scalar WA95 = wa95[1,1]
{txt}
{com}. 
. scalar WArec95 = warec95[1,1]
{txt}
{com}. 
. scalar WAexp95 = waexp95[1,1]
{txt}
{com}. 
. 
. replace exp = WA95 if highschoolstate == 48 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. replace rec = WArec95 if highschoolstate == 48 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. replace expend = WAexp95 if highschoolstate == 48 & cohort == 1995
{txt}(11 real changes made)

{com}. 
. 
. matrix wa96 = ninetysix * WA'
{txt}
{com}. 
. matrix warec96 = ninetysix * WArec'
{txt}
{com}. 
. matrix waexp96 = ninetysix * WAexp'
{txt}
{com}. 
. 
. scalar WA96 = wa96[1,1]
{txt}
{com}. 
. scalar WArec96 = warec96[1,1]
{txt}
{com}. 
. scalar WAexp96 = waexp96[1,1]
{txt}
{com}. 
. 
. replace exp = WA96 if highschoolstate == 48 & cohort == 1996
{txt}(14 real changes made)

{com}. 
. replace rec = WArec96 if highschoolstate == 48 & cohort == 1996
{txt}(14 real changes made)

{com}. 
. replace expend = WAexp96 if highschoolstate == 48 & cohort == 1996
{txt}(14 real changes made)

{com}. 
. 
. matrix wa97 = ninetyseven * WA'
{txt}
{com}. 
. matrix warec97 = ninetyseven * WArec'
{txt}
{com}. 
. matrix waexp97 = ninetyseven * WAexp'
{txt}
{com}. 
. 
. scalar WA97 = wa97[1,1]
{txt}
{com}. 
. scalar WArec97 = warec97[1,1]
{txt}
{com}. 
. scalar WAexp97 = waexp97[1,1]
{txt}
{com}. 
. 
. replace exp = WA97 if highschoolstate == 48 & cohort == 1997
{txt}(15 real changes made)

{com}. 
. replace rec = WArec97 if highschoolstate == 48 & cohort == 1997
{txt}(15 real changes made)

{com}. 
. replace expend = WAexp97 if highschoolstate == 48 & cohort == 1997
{txt}(15 real changes made)

{com}. 
. 
. matrix wa98 = ninetyeight * WA'
{txt}
{com}. 
. matrix warec98 = ninetyeight * WArec'
{txt}
{com}. 
. matrix waexp98 = ninetyeight * WAexp'
{txt}
{com}. 
. 
. scalar WA98 = wa98[1,1]
{txt}
{com}. 
. scalar WArec98 = warec98[1,1]
{txt}
{com}. 
. scalar WAexp98 = waexp98[1,1]
{txt}
{com}. 
. 
. replace exp = WA98 if highschoolstate == 48 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace rec = WArec98 if highschoolstate == 48 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. replace expend = WAexp98 if highschoolstate == 48 & cohort == 1998
{txt}(5 real changes made)

{com}. 
. *WV|91-14:49
. 
. matrix wv94 = ninetyfour * WV'
{txt}
{com}. 
. matrix wvrec94 = ninetyfour * WVrec'
{txt}
{com}. 
. matrix wvexp94 = ninetyfour * WVexp'
{txt}
{com}. 
. 
. scalar WV94 = wv94[1,1]
{txt}
{com}. 
. scalar WVrec94 = wvrec94[1,1]
{txt}
{com}. 
. scalar WVexp94 = wvexp94[1,1]
{txt}
{com}. 
. 
. replace exp = WV94 if highschoolstate == 49 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = WVrec94 if highschoolstate == 49 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = WVexp94 if highschoolstate == 49 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix wv95 = ninetyfive * WV'
{txt}
{com}. 
. matrix wvrec95 = ninetyfive * WVrec'
{txt}
{com}. 
. matrix wvexp95 = ninetyfive * WVexp'
{txt}
{com}. 
. 
. scalar WV95 = wv95[1,1]
{txt}
{com}. 
. scalar WVrec95 = wvrec95[1,1]
{txt}
{com}. 
. scalar WVexp95 = wvexp95[1,1]
{txt}
{com}. 
. 
. replace exp = WV95 if highschoolstate == 49 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = WVrec95 if highschoolstate == 49 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = WVexp95 if highschoolstate == 49 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix wv96 = ninetysix * WV'
{txt}
{com}. 
. matrix wvrec96 = ninetysix * WVrec'
{txt}
{com}. 
. matrix wvexp96 = ninetysix * WVexp'
{txt}
{com}. 
. 
. scalar WV96 = wv96[1,1]
{txt}
{com}. 
. scalar WVrec96 = wvrec96[1,1]
{txt}
{com}. 
. scalar WVexp96 = wvexp96[1,1]
{txt}
{com}. 
. 
. replace exp = WV96 if highschoolstate == 49 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = WVrec96 if highschoolstate == 49 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = WVexp96 if highschoolstate == 49 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix wv97 = ninetyseven * WV'
{txt}
{com}. 
. matrix wvrec97 = ninetyseven * WVrec'
{txt}
{com}. 
. matrix wvexp97 = ninetyseven * WVexp'
{txt}
{com}. 
. 
. scalar WV97 = wv97[1,1]
{txt}
{com}. 
. scalar WVrec97 = wvrec97[1,1]
{txt}
{com}. 
. scalar WVexp97 = wvexp97[1,1]
{txt}
{com}. 
. 
. replace exp = WV97 if highschoolstate == 49 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = WVrec97 if highschoolstate == 49 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = WVexp97 if highschoolstate == 49 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix wv98 = ninetyeight * WV'
{txt}
{com}. 
. matrix wvrec98 = ninetyeight * WVrec'
{txt}
{com}. 
. matrix wvexp98 = ninetyeight * WVexp'
{txt}
{com}. 
. 
. scalar WV98 = wv98[1,1]
{txt}
{com}. 
. scalar WVrec98 = wvrec98[1,1]
{txt}
{com}. 
. scalar WVexp98 = wvexp98[1,1]
{txt}
{com}. 
. 
. replace exp = WV98 if highschoolstate == 49 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = WVrec98 if highschoolstate == 49 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = WVexp98 if highschoolstate == 49 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *WI|98-14:50
. 
. matrix wi94 = ninetyfour * WI'
{txt}
{com}. 
. matrix wirec94 = ninetyfour * WIrec'
{txt}
{com}. 
. matrix wiexp94 = ninetyfour * WIexp'
{txt}
{com}. 
. 
. scalar WI94 = wi94[1,1]
{txt}
{com}. 
. scalar WIrec94 = wirec94[1,1]
{txt}
{com}. 
. scalar WIexp94 = wiexp94[1,1]
{txt}
{com}. 
. 
. replace exp = WI94 if highschoolstate == 50 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. replace rec = WIrec94 if highschoolstate == 50 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. replace expend = WIexp94 if highschoolstate == 50 & cohort == 1994
{txt}(21 real changes made)

{com}. 
. 
. matrix wi95 = ninetyfive * WI'
{txt}
{com}. 
. matrix wirec95 = ninetyfive * WIrec'
{txt}
{com}. 
. matrix wiexp95 = ninetyfive * WIexp'
{txt}
{com}. 
. 
. scalar WI95 = wi95[1,1]
{txt}
{com}. 
. scalar WIrec95 = wirec95[1,1]
{txt}
{com}. 
. scalar WIexp95 = wiexp95[1,1]
{txt}
{com}. 
. 
. replace exp = WI95 if highschoolstate == 50 & cohort == 1995
{txt}(24 real changes made)

{com}. 
. replace rec = WIrec95 if highschoolstate == 50 & cohort == 1995
{txt}(24 real changes made)

{com}. 
. replace expend = WIexp95 if highschoolstate == 50 & cohort == 1995
{txt}(24 real changes made)

{com}. 
. 
. matrix wi96 = ninetysix * WI'
{txt}
{com}. 
. matrix wirec96 = ninetysix * WIrec'
{txt}
{com}. 
. matrix wiexp96 = ninetysix * WIexp'
{txt}
{com}. 
. 
. scalar WI96 = wi96[1,1]
{txt}
{com}. 
. scalar WIrec96 = wirec96[1,1]
{txt}
{com}. 
. scalar WIexp96 = wiexp96[1,1]
{txt}
{com}. 
. 
. replace exp = WI96 if highschoolstate == 50 & cohort == 1996
{txt}(12 real changes made)

{com}. 
. replace rec = WIrec96 if highschoolstate == 50 & cohort == 1996
{txt}(12 real changes made)

{com}. 
. replace expend = WIexp96 if highschoolstate == 50 & cohort == 1996
{txt}(12 real changes made)

{com}. 
. 
. matrix wi97 = ninetyseven * WI'
{txt}
{com}. 
. matrix wirec97 = ninetyseven * WIrec'
{txt}
{com}. 
. matrix wiexp97 = ninetyseven * WIexp'
{txt}
{com}. 
. 
. scalar WI97 = wi97[1,1]
{txt}
{com}. 
. scalar WIrec97 = wirec97[1,1]
{txt}
{com}. 
. scalar WIexp97 = wiexp97[1,1]
{txt}
{com}. 
. 
. replace exp = WI97 if highschoolstate == 50 & cohort == 1997
{txt}(20 real changes made)

{com}. 
. replace rec = WIrec97 if highschoolstate == 50 & cohort == 1997
{txt}(20 real changes made)

{com}. 
. replace expend = WIexp97 if highschoolstate == 50 & cohort == 1997
{txt}(20 real changes made)

{com}. 
. 
. matrix wi98 = ninetyeight * WI'
{txt}
{com}. 
. matrix wirec98 = ninetyeight * WIrec'
{txt}
{com}. 
. matrix wiexp98 = ninetyeight * WIexp'
{txt}
{com}. 
. 
. scalar WI98 = wi98[1,1]
{txt}
{com}. 
. scalar WIrec98 = wirec98[1,1]
{txt}
{com}. 
. scalar WIexp98 = wiexp98[1,1]
{txt}
{com}. 
. 
. replace exp = WI98 if highschoolstate == 50 & cohort == 1998
{txt}(18 real changes made)

{com}. 
. replace rec = WIrec98 if highschoolstate == 50 & cohort == 1998
{txt}(18 real changes made)

{com}. 
. replace expend = WIexp98 if highschoolstate == 50 & cohort == 1998
{txt}(18 real changes made)

{com}. 
. *WY|97-15:51
. 
. matrix wy94 = ninetyfour * WY'
{txt}
{com}. 
. matrix wyrec94 = ninetyfour * WYrec'
{txt}
{com}. 
. matrix wyexp94 = ninetyfour * WYexp'
{txt}
{com}. 
. 
. scalar WY94 = wy94[1,1]
{txt}
{com}. 
. scalar WYrec94 = wyrec94[1,1]
{txt}
{com}. 
. scalar WYexp94 = wyexp94[1,1]
{txt}
{com}. 
. 
. replace exp = WY94 if highschoolstate == 51 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace rec = WYrec94 if highschoolstate == 51 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace expend = WYexp94 if highschoolstate == 51 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. 
. matrix wy95 = ninetyfive * WY'
{txt}
{com}. 
. matrix wyrec95 = ninetyfive * WYrec'
{txt}
{com}. 
. matrix wyexp95 = ninetyfive * WYexp'
{txt}
{com}. 
. 
. scalar WY95 = wy95[1,1]
{txt}
{com}. 
. scalar WYrec95 = wyrec95[1,1]
{txt}
{com}. 
. scalar WYexp95 = wyexp95[1,1]
{txt}
{com}. 
. 
. replace exp = WY95 if highschoolstate == 51 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace rec = WYrec95 if highschoolstate == 51 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace expend = WYexp95 if highschoolstate == 51 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. 
. matrix wy96 = ninetysix * WY'
{txt}
{com}. 
. matrix wyrec96 = ninetysix * WYrec'
{txt}
{com}. 
. matrix wyexp96 = ninetysix * WYexp'
{txt}
{com}. 
. 
. scalar WY96 = wy96[1,1]
{txt}
{com}. 
. scalar WYrec96 = wyrec96[1,1]
{txt}
{com}. 
. scalar WYexp96 = wyexp96[1,1]
{txt}
{com}. 
. 
. replace exp = WY96 if highschoolstate == 51 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace rec = WYrec96 if highschoolstate == 51 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace expend = WYexp96 if highschoolstate == 51 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. 
. matrix wy97 = ninetyseven * WY'
{txt}
{com}. 
. matrix wyrec97 = ninetyseven * WYrec'
{txt}
{com}. 
. matrix wyexp97 = ninetyseven * WYexp'
{txt}
{com}. 
. 
. scalar WY97 = wy97[1,1]
{txt}
{com}. 
. scalar WYrec97 = wyrec97[1,1]
{txt}
{com}. 
. scalar WYexp97 = wyexp97[1,1]
{txt}
{com}. 
. 
. replace exp = WY97 if highschoolstate == 51 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace rec = WYrec97 if highschoolstate == 51 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace expend = WYexp97 if highschoolstate == 51 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. 
. matrix wy98 = ninetyeight * WY'
{txt}
{com}. 
. matrix wyrec98 = ninetyeight * WYrec'
{txt}
{com}. 
. matrix wyexp98 = ninetyeight * WYexp'
{txt}
{com}. 
. 
. scalar WY98 = wy98[1,1]
{txt}
{com}. 
. scalar WYrec98 = wyrec98[1,1]
{txt}
{com}. 
. scalar WYexp98 = wyexp98[1,1]
{txt}
{com}. 
. 
. replace exp = WY98 if highschoolstate == 51 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace rec = WYrec98 if highschoolstate == 51 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. replace expend = WYexp98 if highschoolstate == 51 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *create dummy variables for state and cohort fixed effects 
. 
. tab highschoolstate, gen (s)

{txt}state where {c |}
high school {c |}
        was {c |}
   attended {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         80        2.26        2.26
{txt}          2 {c |}{res}         33        0.93        3.19
{txt}          3 {c |}{res}         89        2.51        5.70
{txt}          4 {c |}{res}         28        0.79        6.49
{txt}          5 {c |}{res}        414       11.69       18.18
{txt}          6 {c |}{res}         74        2.09       20.27
{txt}          7 {c |}{res}         44        1.24       21.51
{txt}          8 {c |}{res}         24        0.68       22.19
{txt}          9 {c |}{res}          3        0.08       22.28
{txt}         10 {c |}{res}         99        2.80       25.07
{txt}         11 {c |}{res}         69        1.95       27.02
{txt}         14 {c |}{res}        153        4.32       31.34
{txt}         15 {c |}{res}         96        2.71       34.05
{txt}         16 {c |}{res}          2        0.06       34.11
{txt}         17 {c |}{res}         52        1.47       35.57
{txt}         18 {c |}{res}         32        0.90       36.48
{txt}         19 {c |}{res}         46        1.30       37.78
{txt}         21 {c |}{res}         59        1.67       39.44
{txt}         22 {c |}{res}         32        0.90       40.34
{txt}         23 {c |}{res}        179        5.05       45.40
{txt}         24 {c |}{res}         55        1.55       46.95
{txt}         25 {c |}{res}         65        1.84       48.79
{txt}         26 {c |}{res}        106        2.99       51.78
{txt}         27 {c |}{res}         57        1.61       53.39
{txt}         31 {c |}{res}         77        2.17       55.56
{txt}         32 {c |}{res}         23        0.65       56.21
{txt}         33 {c |}{res}        207        5.84       62.06
{txt}         34 {c |}{res}        154        4.35       66.40
{txt}         35 {c |}{res}         38        1.07       67.48
{txt}         36 {c |}{res}         78        2.20       69.68
{txt}         37 {c |}{res}         66        1.86       71.54
{txt}         38 {c |}{res}         32        0.90       72.44
{txt}         39 {c |}{res}        128        3.61       76.06
{txt}         40 {c |}{res}          1        0.03       76.09
{txt}         41 {c |}{res}         56        1.58       77.67
{txt}         42 {c |}{res}         38        1.07       78.74
{txt}         43 {c |}{res}         75        2.12       80.86
{txt}         44 {c |}{res}        337        9.51       90.37
{txt}         46 {c |}{res}         44        1.24       91.61
{txt}         47 {c |}{res}        144        4.07       95.68
{txt}         48 {c |}{res}         58        1.64       97.32
{txt}         50 {c |}{res}         95        2.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,542      100.00
{txt}
{com}. 
. tab cohort, gen (c)

{txt}high school {c |}
     cohort {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1994 {c |}{res}        819       23.12       23.12
{txt}       1995 {c |}{res}        798       22.53       45.65
{txt}       1996 {c |}{res}        649       18.32       63.98
{txt}       1997 {c |}{res}        638       18.01       81.99
{txt}       1998 {c |}{res}        638       18.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,542      100.00
{txt}
{com}. 
. *rename variables to make analysis easier 
. 
. rename cohort hscohort 
{res}{txt}
{com}. 
. rename sex biosex
{res}{txt}
{com}. 
. rename sampletype typeofsample
{res}{txt}
{com}. 
. *save final dataset
. 
. save "AdvMathIncRankQuantFinalDatasetInstruments.dta"
{txt}file AdvMathIncRankQuantFinalDatasetInstruments.dta saved

{com}. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\logfiles\AdvMathIncRankQuantFinalDatasetInstruments.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Aug 2022, 11:20:47
{txt}{.-}
{smcl}
{txt}{sf}{ul off}