{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\logfiles\AdvMathIncRankQuantFinalDatasetNoInstruments.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Aug 2022, 11:16:09
{txt}
{com}. 
. *Define the directory
. global PATH "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles"
{txt}
{com}. cd $PATH
{res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles
{txt}
{com}. 
. *Use the dissertation data with controls and dependent variables created
. use "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles\AdvMathIncRankQuantVarsLocation.dta"
{txt}
{com}. 
. *change highschoolstate variable to a 1-51 system (AL-WY) 
. replace highschoolstate = 3 if highschoolstate == 4
{txt}(89 real changes made)

{com}. 
. replace highschoolstate = 4 if highschoolstate == 5
{txt}(28 real changes made)

{com}. 
. replace highschoolstate = 5 if highschoolstate == 6
{txt}(414 real changes made)

{com}. 
. replace highschoolstate = 6 if highschoolstate == 8
{txt}(74 real changes made)

{com}. 
. replace highschoolstate = 7 if highschoolstate == 9
{txt}(44 real changes made)

{com}. 
. replace highschoolstate = 8 if highschoolstate == 10
{txt}(24 real changes made)

{com}. 
. replace highschoolstate = 9 if highschoolstate == 11
{txt}(3 real changes made)

{com}. 
. replace highschoolstate = 10 if highschoolstate == 12
{txt}(99 real changes made)

{com}. 
. replace highschoolstate = 11 if highschoolstate == 13
{txt}(69 real changes made)

{com}. 
. replace highschoolstate = 12 if highschoolstate == 15
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 13 if highschoolstate == 16
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 14 if highschoolstate == 17
{txt}(153 real changes made)

{com}. 
. replace highschoolstate = 15 if highschoolstate == 18
{txt}(96 real changes made)

{com}. 
. replace highschoolstate = 16 if highschoolstate == 19
{txt}(2 real changes made)

{com}. 
. replace highschoolstate = 17 if highschoolstate == 20
{txt}(52 real changes made)

{com}. 
. replace highschoolstate = 18 if highschoolstate == 21
{txt}(32 real changes made)

{com}. 
. replace highschoolstate = 19 if highschoolstate == 22
{txt}(46 real changes made)

{com}. 
. replace highschoolstate = 20 if highschoolstate == 23
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 21 if highschoolstate == 24
{txt}(59 real changes made)

{com}. 
. replace highschoolstate = 22 if highschoolstate == 25
{txt}(32 real changes made)

{com}. 
. replace highschoolstate = 23 if highschoolstate == 26
{txt}(179 real changes made)

{com}. 
. replace highschoolstate = 24 if highschoolstate == 27
{txt}(55 real changes made)

{com}. 
. replace highschoolstate = 25 if highschoolstate == 28
{txt}(65 real changes made)

{com}. 
. replace highschoolstate = 26 if highschoolstate == 29
{txt}(106 real changes made)

{com}. 
. replace highschoolstate = 27 if highschoolstate == 30
{txt}(57 real changes made)

{com}. 
. replace highschoolstate = 28 if highschoolstate == 31
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 29 if highschoolstate == 32
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 30 if highschoolstate == 33
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 31 if highschoolstate == 34
{txt}(77 real changes made)

{com}. 
. replace highschoolstate = 32 if highschoolstate == 35
{txt}(23 real changes made)

{com}. 
. replace highschoolstate = 33 if highschoolstate == 36
{txt}(207 real changes made)

{com}. 
. replace highschoolstate = 34 if highschoolstate == 37
{txt}(154 real changes made)

{com}. 
. replace highschoolstate = 35 if highschoolstate == 38
{txt}(38 real changes made)

{com}. 
. replace highschoolstate = 36 if highschoolstate == 39
{txt}(78 real changes made)

{com}. 
. replace highschoolstate = 37 if highschoolstate == 40
{txt}(66 real changes made)

{com}. 
. replace highschoolstate = 38 if highschoolstate == 41
{txt}(32 real changes made)

{com}. 
. replace highschoolstate = 39 if highschoolstate == 42
{txt}(128 real changes made)

{com}. 
. replace highschoolstate = 40 if highschoolstate == 44
{txt}(1 real change made)

{com}. 
. replace highschoolstate = 41 if highschoolstate == 45
{txt}(56 real changes made)

{com}. 
. replace highschoolstate = 42 if highschoolstate == 46
{txt}(38 real changes made)

{com}. 
. replace highschoolstate = 43 if highschoolstate == 47
{txt}(75 real changes made)

{com}. 
. replace highschoolstate = 44 if highschoolstate == 48
{txt}(337 real changes made)

{com}. 
. replace highschoolstate = 45 if highschoolstate == 49
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 46 if highschoolstate == 50
{txt}(44 real changes made)

{com}. 
. replace highschoolstate = 47 if highschoolstate == 51
{txt}(144 real changes made)

{com}. 
. replace highschoolstate = 48 if highschoolstate == 53
{txt}(58 real changes made)

{com}. 
. replace highschoolstate = 49 if highschoolstate == 54
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 50 if highschoolstate == 55
{txt}(95 real changes made)

{com}. 
. replace highschoolstate = 51 if highschoolstate == 56
{txt}(0 real changes made)

{com}. 
. save "AdvMathIncRankQuantFinalDatasetNoInstruments.dta"
{txt}file AdvMathIncRankQuantFinalDatasetNoInstruments.dta saved

{com}. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\logfiles\AdvMathIncRankQuantFinalDatasetNoInstruments.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Aug 2022, 11:16:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}