{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\logfiles\AdvMathIncRankQuantControlsDepVars.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Aug 2022, 11:12:46
{txt}
{com}. 
. *open NLSY97 downloaded data 
. import delimited "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\rawdata\AdvMathIncomeRankQuantile.csv"
{res}{text}(18 vars, 8,984 obs)

{com}. 
. *sort by id
. sort r0000100
{txt}
{com}. 
. *merge datasets to add total mathematics credits required for graduation 
. merge 1:1 r0000100 using "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\rawdata\TotalMathCreditsRequired.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           8,984{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *Define the directory
. global PATH "C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles"
{txt}
{com}. cd $PATH
{res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\dofiles_dtafiles
{txt}
{com}. 
. *Create labels from NLSY97 file download
. label define vlR0000100 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999" 
{txt}
{com}. label values r0000100 vlR0000100
{txt}
{com}. 
. label define vlR0536300 1 "Male"  2 "Female"  0 "No Information" 
{txt}
{com}. label values r0536300 vlR0536300
{txt}
{com}. 
. label define vlR0536401 1 "1: January"  2 "2: February"  3 "3: March"  4 "4: April"  5 "5: May"  6 "6: June"  7 "7: July"  8 "8: August"  9 "9: September"  10 "10: October"  11 "11: November"  12 "12: December" 
{txt}
{com}. label values r0536401 vlR0536401
{txt}
{com}. 
. label define vlR1204500 -999999 "-999999 TO -3000: < -2999"  -2999 "-2999 TO -2000"  -1999 "-1999 TO -1000"  -999 "-999 TO -1"  0 "0"  1 "1 TO 1000"  1001 "1001 TO 2000"  2001 "2001 TO 3000"  3001 "3001 TO 5000"  5001 "5001 TO 10000"  10001 "10001 TO 20000"  20001 "20001 TO 30000"  30001 "30001 TO 40000"  40001 "40001 TO 50000"  50001 "50001 TO 65000"  65001 "65001 TO 80000"  80001 "80001 TO 100000"  100001 "100001 TO 150000"  150001 "150001 TO 200000"  200001 "200001 TO 999999: 200001+" 
{txt}
{com}. label values r1204500 vlR1204500
{txt}
{com}. 
. label define vlR1204900 0 "0"  1 "1 TO 99: .01-.99"  100 "100 TO 199: 1.00-1.99"  200 "200 TO 299: 2.00-2.99"  300 "300 TO 399: 3.00-3.99"  400 "400 TO 499: 4.00-4.99"  500 "500 TO 599: 5.00-5.99"  600 "600 TO 699: 6.00-6.99"  700 "700 TO 799: 7.00-7.99"  800 "800 TO 899: 8.00-8.99"  900 "900 TO 999: 9.00-9.99"  1000 "1000 TO 1099: 10.00-10.99"  1100 "1100 TO 1199: 11.00-11.99"  1200 "1200 TO 1299: 12.00-12.99"  1300 "1300 TO 1399: 13.00-13.99"  1400 "1400 TO 1499: 14.00-14.99"  1500 "1500 TO 1599: 15.00-15.99"  1600 "1600 TO 1699: 16.00-16.99"  1700 "1700 TO 1799: 17.00-17.99"  1800 "1800 TO 1899: 18.00-18.99"  1900 "1900 TO 1999: 19.00-19.99"  2000 "2000 TO 2999: 20.00-29.99"  3000 "3000 TO 9999: 30.00+" 
{txt}
{com}. label values r1204900 vlR1204900
{txt}
{com}. 
. label define vlR1205300 1 "Both biological parents"  2 "Two parents, biological mother"  3 "Two parents, biological father"  4 "Biological mother only"  5 "Biological father only"  6 "Adoptive parent(s)"  7 "Foster parent(s)"  8 "No parents, grandparents"  9 "No parents, other relatives"  10 "Anything else" 
{txt}
{com}. label values r1205300 vlR1205300
{txt}
{com}. 
. label define vlR1205400 0 "0"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17"  18 "18"  19 "19"  20 "20 TO 99: 20+" 
{txt}
{com}. label values r1205400 vlR1205400
{txt}
{com}. 
. label define vlR1235800 1 "Cross-sectional"  0 "Oversample" 
{txt}
{com}. label values r1235800 vlR1235800
{txt}
{com}. 
. label define vlR1482600 1 "Black"  2 "Hispanic"  3 "Mixed Race (Non-Hispanic)"  4 "Non-Black / Non-Hispanic" 
{txt}
{com}. label values r1482600 vlR1482600
{txt}
{com}. 
. label define vlR2563300 -999999 "-999999 TO -3000: < -2999"  -2999 "-2999 TO -2000"  -1999 "-1999 TO -1000"  -999 "-999 TO -1"  0 "0"  1 "1 TO 1000"  1001 "1001 TO 2000"  2001 "2001 TO 3000"  3001 "3001 TO 5000"  5001 "5001 TO 10000"  10001 "10001 TO 20000"  20001 "20001 TO 30000"  30001 "30001 TO 40000"  40001 "40001 TO 50000"  50001 "50001 TO 65000"  65001 "65001 TO 80000"  80001 "80001 TO 100000"  100001 "100001 TO 150000"  150001 "150001 TO 200000"  200001 "200001 TO 999999: 200001+" 
{txt}
{com}. label values r2563300 vlR2563300
{txt}
{com}. 
. label define vlR2563500 0 "0"  1 "1 TO 99: .01-.99"  100 "100 TO 199: 1.00-1.99"  200 "200 TO 299: 2.00-2.99"  300 "300 TO 399: 3.00-3.99"  400 "400 TO 499: 4.00-4.99"  500 "500 TO 599: 5.00-5.99"  600 "600 TO 699: 6.00-6.99"  700 "700 TO 799: 7.00-7.99"  800 "800 TO 899: 8.00-8.99"  900 "900 TO 999: 9.00-9.99"  1000 "1000 TO 1099: 10.00-10.99"  1100 "1100 TO 1199: 11.00-11.99"  1200 "1200 TO 1299: 12.00-12.99"  1300 "1300 TO 1399: 13.00-13.99"  1400 "1400 TO 1499: 14.00-14.99"  1500 "1500 TO 1599: 15.00-15.99"  1600 "1600 TO 1699: 16.00-16.99"  1700 "1700 TO 1799: 17.00-17.99"  1800 "1800 TO 1899: 18.00-18.99"  1900 "1900 TO 1999: 19.00-19.99"  2000 "2000 TO 2999: 20.00-29.99"  3000 "3000 TO 9999: 30.00+" 
{txt}
{com}. label values r2563500 vlR2563500
{txt}
{com}. 
. label define vlR3884900 -999999 "-999999 TO -3000: < -2999"  -2999 "-2999 TO -2000"  -1999 "-1999 TO -1000"  -999 "-999 TO -1"  0 "0"  1 "1 TO 1000"  1001 "1001 TO 2000"  2001 "2001 TO 3000"  3001 "3001 TO 5000"  5001 "5001 TO 10000"  10001 "10001 TO 20000"  20001 "20001 TO 30000"  30001 "30001 TO 40000"  40001 "40001 TO 50000"  50001 "50001 TO 65000"  65001 "65001 TO 80000"  80001 "80001 TO 100000"  100001 "100001 TO 150000"  150001 "150001 TO 200000"  200001 "200001 TO 999999: 200001+" 
{txt}
{com}. label values r3884900 vlR3884900
{txt}
{com}. 
. label define vlR3885100 0 "0"  1 "1 TO 99: .01-.99"  100 "100 TO 199: 1.00-1.99"  200 "200 TO 299: 2.00-2.99"  300 "300 TO 399: 3.00-3.99"  400 "400 TO 499: 4.00-4.99"  500 "500 TO 599: 5.00-5.99"  600 "600 TO 699: 6.00-6.99"  700 "700 TO 799: 7.00-7.99"  800 "800 TO 899: 8.00-8.99"  900 "900 TO 999: 9.00-9.99"  1000 "1000 TO 1099: 10.00-10.99"  1100 "1100 TO 1199: 11.00-11.99"  1200 "1200 TO 1299: 12.00-12.99"  1300 "1300 TO 1399: 13.00-13.99"  1400 "1400 TO 1499: 14.00-14.99"  1500 "1500 TO 1599: 15.00-15.99"  1600 "1600 TO 1699: 16.00-16.99"  1700 "1700 TO 1799: 17.00-17.99"  1800 "1800 TO 1899: 18.00-18.99"  1900 "1900 TO 1999: 19.00-19.99"  2000 "2000 TO 2999: 20.00-29.99"  3000 "3000 TO 9999: 30.00+" 
{txt}
{com}. label values r3885100 vlR3885100
{txt}
{com}. 
. label define vlR9864600 -8 "-8: Invalid Carnegie credits or only pre-hs courses"  -7 "-7: Did not take the course"  -6 "-6: Took the course but Carnegie credits missing"  0 "0 TO 250: 0 to 2.50 Credits"  251 "251 TO 500: 2.51 to 5.00 Credits"  501 "501 TO 750: 5.01 to 7.50 Credits"  751 "751 TO 1000: 7.51 to 10.00 Credits"  1001 "1001 TO 1250: 10.01 to 12.50 Credits" 
{txt}
{com}. label values r9864600 vlR9864600
{txt}
{com}. 
. label define vlU2857200 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 99999999: 50000+" 
{txt}
{com}. label values u2857200 vlU2857200
{txt}
{com}. 
. label define vlU4282300 0 "0"  1 "1 TO 4999"  5000 "5000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 29999"  30000 "30000 TO 39999"  40000 "40000 TO 49999"  50000 "50000 TO 59999"  60000 "60000 TO 69999"  70000 "70000 TO 79999"  80000 "80000 TO 89999"  90000 "90000 TO 99999"  100000 "100000 TO 149999"  150000 "150000 TO 99999999: 150000+" 
{txt}
{com}. label values u4282300 vlU4282300
{txt}
{com}. 
. label define vlZ9033700 1 "200 - 300"  2 "301 - 400"  3 "401 - 500"  4 "501 - 600"  5 "601 - 700"  6 "701 - 800"  0 "Have not yet received the scores" 
{txt}
{com}. label values z9033700 vlZ9033700
{txt}
{com}. 
. *rename variables according to NLSY97 download
. rename r0000100 PUBID_1997 
{res}{txt}
{com}. 
. rename r0536300 KEY_SEX_1997
{res}{txt}
{com}.  
. rename r0536401 KEY_DATE_M_1997
{res}{txt}
{com}.  
. rename r0536402 KEY_BDATE_Y_1997
{res}{txt}
{com}.  
. rename r1204500 CV_INCOME_GROSS_YR_1997 
{res}{txt}
{com}. 
. rename r1204900 CV_HH_POV_RATIO_1997 
{res}{txt}
{com}. 
. rename r1205300 CV_YTH_REL_HH_CURRENT_1997 
{res}{txt}
{com}. 
. rename r1205400 CV_HH_SIZE_1997 
{res}{txt}
{com}. 
. rename r1235800 CV_SAMPLE_TYPE_1997 
{res}{txt}
{com}. 
. rename r1482600 KEY_RACE_ETHNICITY_1997
{res}{txt}
{com}.  
. rename r2563300 CV_INCOME_GROSS_YR_1998
{res}{txt}
{com}.  
. rename r2563500 CV_HH_POV_RATIO_1998
{res}{txt}
{com}.  
. rename r3884900 CV_INCOME_GROSS_YR_1999 
{res}{txt}
{com}. 
. rename r3885100 CV_HH_POV_RATIO_1999
{res}{txt}
{com}.  
. rename r9864600 TRANS_TOT_ADV_MATH_HSTR 
{res}{txt}
{com}.    
. rename u2857200 YINC_1700_2017  
{res}{txt}
{com}. 
. rename u4282300 YINC_1700_2019
{res}{txt}
{com}. 
. rename z9033700 CVC_SAT_MATH_SCORE_2007_XRND
{res}{txt}
{com}. 
. rename r9872900 TRANS_GRADREQ_MATH_HSTR
{res}{txt}
{com}. 
. *rename to id
. rename PUBID_1997 id
{res}{txt}
{com}. 
. *rename to sex
. rename KEY_SEX_1997 sex
{res}{txt}
{com}. 
. *rename to birth month
. rename KEY_DATE_M_1997 birthmonth
{res}{txt}
{com}. 
. *rename to birth year
. rename KEY_BDATE_Y_1997 birthyear
{res}{txt}
{com}. 
. *rename to household income 97
. rename CV_INCOME_GROSS_YR_1997 hhincome97
{res}{txt}
{com}. 
. *rename to household income to poverty ratio 97
. rename CV_HH_POV_RATIO_1997 hhincomepovratio97
{res}{txt}
{com}. 
. *rename to head of household 97
. rename CV_YTH_REL_HH_CURRENT_1997 headofhousehold97
{res}{txt}
{com}. 
. *rename to to household size 97
. rename CV_HH_SIZE_1997 hhsize97
{res}{txt}
{com}. 
. *rename to sample type 
. rename CV_SAMPLE_TYPE_1997 sampletype
{res}{txt}
{com}. 
. *rename to race ethnicity
. rename KEY_RACE_ETHNICITY_1997 raceethnicity
{res}{txt}
{com}. 
. *rename to household income 98
. rename CV_INCOME_GROSS_YR_1998 hhincome98 
{res}{txt}
{com}. 
. *rename to household income to poverty ratio 98
. rename CV_HH_POV_RATIO_1998 hhincomepovratio98
{res}{txt}
{com}. 
. *rename to household income 99
. rename CV_INCOME_GROSS_YR_1999 hhincome99
{res}{txt}
{com}. 
. *rename to household income to poverty ratio 99
. rename CV_HH_POV_RATIO_1999 hhincomepovratio99
{res}{txt}
{com}. 
. *rename to total advanced math credits
. rename TRANS_TOT_ADV_MATH_HSTR totaladvmathcredits
{res}{txt}
{com}. 
. *rename to income 2017
. rename YINC_1700_2017 income2017
{res}{txt}
{com}. 
. *rename to income 2019
. rename YINC_1700_2019 income2019
{res}{txt}
{com}. 
. *rename to SAT math score
. rename CVC_SAT_MATH_SCORE_2007_XRND satmathscore
{res}{txt}
{com}. 
. *rename to total math credits required
. rename TRANS_GRADREQ_MATH_HSTR totalmathcreditsreq
{res}{txt}
{com}. 
. *label variables
. label variable id "identification number"
{txt}
{com}. 
. label variable sex "sex"
{txt}
{com}. 
. label variable birthmonth "birth month"
{txt}
{com}. 
. label variable birthyear "birth year"
{txt}
{com}. 
. label variable hhincome97 "gross household income in 1997"
{txt}
{com}. 
. label variable hhincomepovratio97 "household income to poverty ratio in 1997"
{txt}
{com}. 
. label variable headofhousehold97 "relationship to head of household in 1997"
{txt}
{com}. 
. label variable hhsize97 "household size in 1997"
{txt}
{com}. 
. label variable sampletype "sample type original or supplemental"
{txt}
{com}. 
. label variable raceethnicity "race/ethnicity"
{txt}
{com}. 
. label variable hhincome98 "gross household income in 1998"
{txt}
{com}. 
. label variable hhincomepovratio98 "household income to poverty ratio in 1998"
{txt}
{com}. 
. label variable hhincome99 "gross household income in 1999"
{txt}
{com}. 
. label variable hhincomepovratio99 "household income to poverty ratio in 1999" 
{txt}
{com}. 
. label variable totaladvmathcredits "total number of Carnegie advanced mathematics credits"
{txt}
{com}. 
. label variable income2017 "total income from wages and salary in 2017"
{txt}
{com}. 
. label variable income2019 "total income from wages and salary in 2019"
{txt}
{com}. 
. label variable satmathscore "highest SAT math score recorded"
{txt}
{com}. 
. label variable totalmathcreditsreq "total mathematics credits required for high school diploma"
{txt}
{com}. 
. *drop cases with missing gross household income data for 1997, 1998, and 1999
. keep if hhincome97 >= 0| hhincome98 >= 0| hhincome99 >= 0
{txt}(1,659 observations deleted)

{com}. 
. *drop cases with missing household income to poverty ratio data for 1997, 1998, and 1999
. keep if hhincomepovratio97 >= 0| hhincomepovratio98 >= 0| hhincomepovratio99 >= 0
{txt}(23 observations deleted)

{com}. 
. *drop cases with missing total mathematics credits required for high school diploma data
. keep if totalmathcreditsreq >= 0
{txt}(2,325 observations deleted)

{com}. 
. *drop cases with missing total income from wages and salaries data from 2017 and 2019
. keep if income2017 >= 0| income2019 >= 0
{txt}(1,364 observations deleted)

{com}. 
. *drop satmathscore
. drop satmathscore
{txt}
{com}. 
. *drop cases if they only took pre-hs advanced math, have invalid Carnegie credits, or took courses but their credits are missing  
. drop if totaladvmathcredits == -8| totaladvmathcredits == -6
{txt}(71 observations deleted)

{com}. 
. *generate mathematics credits variables that we can interpret by dividing by 100
. generate totalmathcreditsgraduate = totalmathcreditsreq / 100
{txt}
{com}. 
. generate advmathcreditsearned = totaladvmathcredits / 100
{txt}
{com}. 
. replace advmathcreditsearned = 0 if advmathcreditsearned < 0 
{txt}(1,335 real changes made)

{com}. 
. *label new mathematics credits variables
. label variable totalmathcreditsgraduate "total mathematics credits required by state"
{txt}
{com}. 
. label variable advmathcreditsearned "total advanced mathematics credits earned"
{txt}
{com}. 
. *create dummy for female
. generate female = 0
{txt}
{com}. 
. replace female = 1 if sex == 2
{txt}(1,738 real changes made)

{com}. 
. *create dummy for both biological parents
. generate bothbioparents = 0
{txt}
{com}. 
. replace bothbioparents = 1 if headofhousehold97 == 1
{txt}(1,845 real changes made)

{com}. 
. *create dummy for white
. generate white = 0
{txt}
{com}. 
. replace white = 1 if raceethnicity == 4
{txt}(1,997 real changes made)

{com}. 
. *label newly generated dummies
. label variable female "dummy for female"
{txt}
{com}. 
. label variable bothbioparents "dummy for both biological parents in the household"
{txt}
{com}. 
. label variable white "dummy for white"
{txt}
{com}. 
. *replace "did not take course" values with zero values
. replace totaladvmathcredits = 0 if totaladvmathcredits < 0
{txt}(1,335 real changes made)

{com}. 
. *replace missing hhincome97, hhincome98, and hhincome99 values as missing
. replace hhincome97 = . if hhincome97 < 0
{txt}(367 real changes made, 367 to missing)

{com}. 
. replace hhincome98 = . if hhincome98 < 0
{txt}(3,055 real changes made, 3,055 to missing)

{com}. 
. replace hhincome99 = . if hhincome99 < 0 
{txt}(2,259 real changes made, 2,259 to missing)

{com}. 
. *generate realhhincome97, realhhincome98, and realhhincome99 variables in 1997 dollars
. generate realhhincome97 = hhincome97/(160.5/160.5)
{txt}(367 missing values generated)

{com}. 
. generate realhhincome98 = hhincome98/(160.5/163)
{txt}(3,055 missing values generated)

{com}. 
. generate realhhincome99 = hhincome99/(160.5/166.6)
{txt}(2,259 missing values generated)

{com}. 
. *label realhhincome97, realhhincome98, and realhhincome99 variables 
. label variable realhhincome97 "1997 household income in 1997 dollars"
{txt}
{com}. 
. label variable realhhincome98 "1998 household income in 1997 dollars"
{txt}
{com}. 
. label variable realhhincome99 "1999 household income in 1997 dollars"
{txt}
{com}. 
. *generate average of non missing household income for 97, 98, and 99
. egen avginc9799 = rowmean (realhhincome97 realhhincome98 realhhincome99)
{txt}
{com}. 
. *label avginc9799 variable
. label variable avginc9799 "average of non missing values of 1997, 1998, and 1999 household income in 1997 dollars" 
{txt}note: label truncated to 80 characters

{com}. 
. *replace missing household income to poverty ratio values as missing
. replace hhincomepovratio97 = . if hhincomepovratio97 < 0
{txt}(372 real changes made, 372 to missing)

{com}. 
. replace hhincomepovratio98 = . if hhincomepovratio98 < 0
{txt}(3,062 real changes made, 3,062 to missing)

{com}. 
. replace hhincomepovratio99 = . if hhincomepovratio99 < 0
{txt}(2,264 real changes made, 2,264 to missing)

{com}. 
. *generate average of non missing income to poverty ratios for 97-99
. egen avgincomepovratio9799 = rowmean (hhincomepovratio97 hhincomepovratio98 hhincomepovratio99) 
{txt}
{com}. 
. generate averageincomepovratio9799 = avgincomepovratio9799 / 100
{txt}
{com}. 
. *label avgincomepovratio9799 
. label variable avgincomepovratio9799 "average of non missing household income to poverty ratios for 1997, 1998, and 1999"
{txt}note: label truncated to 80 characters

{com}. 
. *label averageincomepovratio9799 
. label variable averageincomepovratio9799 "average of 97-99 household income to poverty ratios"
{txt}
{com}. 
. *replace missing income2017 and income2019 values as missing
. replace income2017 = . if income2017 < 0
{txt}(591 real changes made, 591 to missing)

{com}. 
. replace income2019 = . if income2019 < 0
{txt}(400 real changes made, 400 to missing)

{com}. 
. *generate real income for 2017 and 2019 in 2019 dollars
. generate realincome2017 = income2017/(255.7/245.1)
{txt}(591 missing values generated)

{com}. 
. generate realincome2019 = income2019/(255.7/255.7)
{txt}(400 missing values generated)

{com}. 
. *label realincome2017 and realincome2019 variables
. label variable realincome2017 "2017 income from salary and wages in 2019 dollars" 
{txt}
{com}. 
. label variable realincome2019 "2019 income from salary and wages in 2019 dollars"
{txt}
{com}. 
. *generate average of non missing real income for 2017 and 2019
. egen avginc20172019 = rowmean (realincome2017 realincome2019)
{txt}
{com}. 
. *label avginc20172019 variable
. label variable avginc20172019 "average of 2017 and 2019 income from salary and wages in 2019 dollars"
{txt}
{com}. 
. *generate log of real average income for 2017 and 2019
. gen logavginc = log(avginc20172019)
{txt}(13 missing values generated)

{com}. 
. *label logavginc variable
. label variable logavginc "log of average of 2017 and 2019 income from salary and wages"
{txt}
{com}. 
. *generate percentile rank of real average income variable
. egen n = count (avginc20172019)
{txt}
{com}. 
. egen i = rank (avginc20172019), track
{txt}
{com}. 
. gen incomerank = ((i-1) / (n-1)) * 100 
{txt}
{com}. 
. drop n i 
{txt}
{com}. 
. *label variable incomerank
. label variable incomerank "percentile rank of average of 2017 and 2019 income from salary and wages"
{txt}
{com}.  
. *create age in years at beginning of the study variable
. generate age = 1996-birthyear
{txt}
{com}. 
. *label age variable 
. label variable age "age in years at the beginning of the study"
{txt}
{com}. 
. *create cohort variable
. generate cohort = birthyear+14
{txt}
{com}. 
. *label cohort variable 
. label variable cohort "high school cohort"
{txt}
{com}. 
. *save datafile
. save "AdvMathIncRankQuantControlsDepVars.dta"
{txt}file AdvMathIncRankQuantControlsDepVars.dta saved

{com}. 
. log close  
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\AdvMathWork\AdvMathIncomeRankQuantileV1\logfiles\AdvMathIncRankQuantControlsDepVars.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Aug 2022, 11:12:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}