{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\SATMathWork\SATMathIncomeRankQuantileV1\logfiles\SATMathIncRankQuantFinalDatasetNoInstruments.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Aug 2022, 17:07:50
{txt}
{com}. 
. *Define the directory
. global PATH "C:\Users\jcoger\Documents\Essay1\SATMathWork\SATMathIncomeRankQuantileV1\dofiles_dtafiles"
{txt}
{com}. cd $PATH
{res}C:\Users\jcoger\Documents\Essay1\SATMathWork\SATMathIncomeRankQuantileV1\dofiles_dtafiles
{txt}
{com}. 
. *Use the dissertation data with controls and dependent variables created
. use "C:\Users\jcoger\Documents\Essay1\SATMathWork\SATMathIncomeRankQuantileV1\dofiles_dtafiles\SATMathIncRankQuantVarsLocation.dta"
{txt}
{com}. 
. *change highschoolstate variable to a 1-51 system (AL-WY) 
. replace highschoolstate = 3 if highschoolstate == 4
{txt}(28 real changes made)

{com}. 
. replace highschoolstate = 4 if highschoolstate == 5
{txt}(5 real changes made)

{com}. 
. replace highschoolstate = 5 if highschoolstate == 6
{txt}(130 real changes made)

{com}. 
. replace highschoolstate = 6 if highschoolstate == 8
{txt}(19 real changes made)

{com}. 
. replace highschoolstate = 7 if highschoolstate == 9
{txt}(30 real changes made)

{com}. 
. replace highschoolstate = 8 if highschoolstate == 10
{txt}(14 real changes made)

{com}. 
. replace highschoolstate = 9 if highschoolstate == 11
{txt}(1 real change made)

{com}. 
. replace highschoolstate = 10 if highschoolstate == 12
{txt}(43 real changes made)

{com}. 
. replace highschoolstate = 11 if highschoolstate == 13
{txt}(35 real changes made)

{com}. 
. replace highschoolstate = 12 if highschoolstate == 15
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 13 if highschoolstate == 16
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 14 if highschoolstate == 17
{txt}(24 real changes made)

{com}. 
. replace highschoolstate = 15 if highschoolstate == 18
{txt}(49 real changes made)

{com}. 
. replace highschoolstate = 16 if highschoolstate == 19
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 17 if highschoolstate == 20
{txt}(4 real changes made)

{com}. 
. replace highschoolstate = 18 if highschoolstate == 21
{txt}(3 real changes made)

{com}. 
. replace highschoolstate = 19 if highschoolstate == 22
{txt}(3 real changes made)

{com}. 
. replace highschoolstate = 20 if highschoolstate == 23
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 21 if highschoolstate == 24
{txt}(37 real changes made)

{com}. 
. replace highschoolstate = 22 if highschoolstate == 25
{txt}(25 real changes made)

{com}. 
. replace highschoolstate = 23 if highschoolstate == 26
{txt}(21 real changes made)

{com}. 
. replace highschoolstate = 24 if highschoolstate == 27
{txt}(10 real changes made)

{com}. 
. replace highschoolstate = 25 if highschoolstate == 28
{txt}(2 real changes made)

{com}. 
. replace highschoolstate = 26 if highschoolstate == 29
{txt}(5 real changes made)

{com}. 
. replace highschoolstate = 27 if highschoolstate == 30
{txt}(5 real changes made)

{com}. 
. replace highschoolstate = 28 if highschoolstate == 31
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 29 if highschoolstate == 32
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 30 if highschoolstate == 33
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 31 if highschoolstate == 34
{txt}(50 real changes made)

{com}. 
. replace highschoolstate = 32 if highschoolstate == 35
{txt}(4 real changes made)

{com}. 
. replace highschoolstate = 33 if highschoolstate == 36
{txt}(120 real changes made)

{com}. 
. replace highschoolstate = 34 if highschoolstate == 37
{txt}(82 real changes made)

{com}. 
. replace highschoolstate = 35 if highschoolstate == 38
{txt}(2 real changes made)

{com}. 
. replace highschoolstate = 36 if highschoolstate == 39
{txt}(16 real changes made)

{com}. 
. replace highschoolstate = 37 if highschoolstate == 40
{txt}(5 real changes made)

{com}. 
. replace highschoolstate = 38 if highschoolstate == 41
{txt}(15 real changes made)

{com}. 
. replace highschoolstate = 39 if highschoolstate == 42
{txt}(65 real changes made)

{com}. 
. replace highschoolstate = 40 if highschoolstate == 44
{txt}(1 real change made)

{com}. 
. replace highschoolstate = 41 if highschoolstate == 45
{txt}(22 real changes made)

{com}. 
. replace highschoolstate = 42 if highschoolstate == 46
{txt}(3 real changes made)

{com}. 
. replace highschoolstate = 43 if highschoolstate == 47
{txt}(8 real changes made)

{com}. 
. replace highschoolstate = 44 if highschoolstate == 48
{txt}(117 real changes made)

{com}. 
. replace highschoolstate = 45 if highschoolstate == 49
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 46 if highschoolstate == 50
{txt}(29 real changes made)

{com}. 
. replace highschoolstate = 47 if highschoolstate == 51
{txt}(76 real changes made)

{com}. 
. replace highschoolstate = 48 if highschoolstate == 53
{txt}(26 real changes made)

{com}. 
. replace highschoolstate = 49 if highschoolstate == 54
{txt}(0 real changes made)

{com}. 
. replace highschoolstate = 50 if highschoolstate == 55
{txt}(2 real changes made)

{com}. 
. replace highschoolstate = 51 if highschoolstate == 56
{txt}(0 real changes made)

{com}. 
. *create exposurestemreform variable 
. generate exposurestemreform = 0
{txt}
{com}. 
. *label exposurestemreform variable
. label variable exposurestemreform "years of exposure to STEM reform"
{txt}
{com}. 
. *STEM reform is from 2001-2016 for state 1
. replace exposurestemreform = 1 if highschoolstate == 1 & cohort == 1998
{txt}(2 real changes made)

{com}. 
. *There is no STEM reform in state 2
. 
. *STEM reform is from 2011-3014 for state 3
. 
. *STEM reform is from 1994-2014 for state 4
. replace exposurestemreform = 4 if highschoolstate == 4
{txt}(5 real changes made)

{com}. 
. *STEM reform is from 1983-2016 for state 5
. replace exposurestemreform = 4 if highschoolstate == 5
{txt}(130 real changes made)

{com}. 
. *STEM reform is from 2001-2008 for state 6
. replace exposurestemreform = 1 if highschoolstate == 6 & cohort == 1998
{txt}(4 real changes made)

{com}. 
. *STEM reform is from 1983-2014 for state 7
. replace exposurestemreform = 4 if highschoolstate == 7 
{txt}(30 real changes made)

{com}. 
. *STEM reform is from 1984-2016 for state 8
. replace exposurestemreform = 4 if highschoolstate == 8
{txt}(14 real changes made)

{com}. 
. *There is no STEM reform in state 9
. 
. *STEM reform is from 1991-2014 for state 10
. replace exposurestemreform = 4 if highschoolstate == 10
{txt}(43 real changes made)

{com}. 
. *STEM reform is from 1995-2011 for state 11
. replace exposurestemreform = 3 if highschoolstate == 11 & cohort == 1994
{txt}(14 real changes made)

{com}. 
. replace exposurestemreform = 4 if highschoolstate == 11 & cohort > 1994
{txt}(21 real changes made)

{com}. 
. *STEM reform is from 2002-2004 for state 12
. 
. *STEM reform is from 1992-1993 for state 13
. 
. *STEM reform is from 1986-2016 for state 14
. replace exposurestemreform = 4 if highschoolstate == 14 
{txt}(24 real changes made)

{com}. 
. *STEM reform is from 1991-2014 for state 15
. replace exposurestemreform = 4 if highschoolstate == 15
{txt}(49 real changes made)

{com}. 
. *STEM reform is from 2001-2016 for state 16
. replace exposurestemreform = 1 if highschoolstate == 16 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *STEM reform is from 2005-2007 for state 17
. 
. *STEM reform is from 1991-2014 for state 18
. replace exposurestemreform = 4 if highschoolstate == 18
{txt}(3 real changes made)

{com}. 
. *STEM reform is from 2003-2005 for state 19
. 
. *STEM reform is from 1998-2014 for state 20
. replace exposurestemreform = 1 if highschoolstate == 20 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 2 if highschoolstate == 20 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 3 if highschoolstate == 20 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 4 if highschoolstate == 20 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *STEM reform is from 1991-2014 for state 21
. replace exposurestemreform = 4 if highschoolstate == 21
{txt}(37 real changes made)

{com}. 
. *STEM reform is from 1999-2016 for state 22
. replace exposurestemreform = 1 if highschoolstate == 22 & cohort == 1996
{txt}(2 real changes made)

{com}. 
. replace exposurestemreform = 2 if highschoolstate == 22 & cohort == 1997
{txt}(6 real changes made)

{com}. 
. replace exposurestemreform = 3 if highschoolstate == 22 & cohort == 1998
{txt}(4 real changes made)

{com}. 
. *There is no STEM reform in state 23
. 
. *There is no STEM reform in state 24
. 
. *STEM reform is from 1991-2016 for state 25
. replace exposurestemreform = 4 if highschoolstate == 25
{txt}(2 real changes made)

{com}. 
. *STEM reform is from 2003-2015 for state 26
. 
. *STEM reform is from 2007-2016 for state 27
. 
. *STEM reform is from 2000-2012 for state 28
. replace exposurestemreform = 1 if highschoolstate == 28 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 2 if highschoolstate == 28 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *There is no STEM reform in state 29
. 
. *There is no STEM reform in state 30
. 
. *There is no STEM reform in state 31
. 
. *STEM reform is from 1994-2016 for state 32
. replace exposurestemreform = 3 if highschoolstate == 32 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 4 if highschoolstate == 32 & cohort > 1994
{txt}(4 real changes made)

{com}. 
. *STEM reform is from 2000-2016 for state 33
. replace exposurestemreform = 1 if highschoolstate == 33 & cohort == 1997
{txt}(24 real changes made)

{com}. 
. replace exposurestemreform = 2 if highschoolstate == 33 & cohort == 1998
{txt}(21 real changes made)

{com}. 
. *STEM reform is from 2001-2014 for state 34
. replace exposurestemreform = 1 if highschoolstate == 34 & cohort == 1998
{txt}(24 real changes made)

{com}. 
. *STEM reform is from 2001-2014 for state 35
. replace exposurestemreform = 1 if highschoolstate == 35 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *STEM reform is from 2009-2016 for state 36
. 
. *STEM reform is from 1985-2016 for state 37
. replace exposurestemreform = 4 if highschoolstate == 37
{txt}(5 real changes made)

{com}. 
. *There is no STEM reform in state 38
. 
. *STEM reform is from 1984-2008 for state 39
. replace exposurestemreform = 4 if highschoolstate == 39
{txt}(65 real changes made)

{com}. 
. *There is no STEM reform in state 40
. 
. *STEM reform is from 1984-2016 for state 41
. replace exposurestemreform = 4 if highschoolstate == 41
{txt}(22 real changes made)

{com}. 
. *STEM reform is from 2003-2016 for state 42
. 
. *STEM reform is from 1991-2014 for state 43
. replace exposurestemreform = 4 if highschoolstate == 43
{txt}(8 real changes made)

{com}. 
. *STEM reform is from 2001-2016 for state 44
. replace exposurestemreform = 1 if highschoolstate == 44 & cohort == 1998
{txt}(19 real changes made)

{com}. 
. *STEM reform is from 1996-2016 for state 45
. replace exposurestemreform = 2 if highschoolstate == 45 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 3 if highschoolstate == 45 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 4 if highschoolstate == 46 & cohort == 1998
{txt}(4 real changes made)

{com}. 
. *There is no STEM reform in state 46
. 
. *STEM reform is from 2002-2014 for state 47
. 
. *STEM reform is from 1983-2014 for state 48
. replace exposurestemreform = 4 if highschoolstate == 48
{txt}(26 real changes made)

{com}. 
. *STEM reform is from 1991-2014 for state 49
. replace exposurestemreform = 4 if highschoolstate == 49
{txt}(0 real changes made)

{com}. 
. *STEM reform is from 1998-2014 for state 50
. replace exposurestemreform = 1 if highschoolstate == 50 & cohort == 1995
{txt}(1 real change made)

{com}. 
. replace exposurestemreform = 2 if highschoolstate == 50 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 3 if highschoolstate == 50 & cohort == 1997
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 4 if highschoolstate == 50 & cohort == 1998
{txt}(0 real changes made)

{com}. 
. *STEM reform is from 1997-2015 for state 51
. replace exposurestemreform = 1 if highschoolstate == 51 & cohort == 1994
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 2 if highschoolstate == 51 & cohort == 1995
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 3 if highschoolstate == 51 & cohort == 1996
{txt}(0 real changes made)

{com}. 
. replace exposurestemreform = 4 if highschoolstate == 51 & cohort > 1996   
{txt}(0 real changes made)

{com}. 
. save "SATMathIncRankQuantFinalDatasetNoInstruments.dta"
{txt}file SATMathIncRankQuantFinalDatasetNoInstruments.dta saved

{com}. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jcoger\Documents\Essay1\SATMathWork\SATMathIncomeRankQuantileV1\logfiles\SATMathIncRankQuantFinalDatasetNoInstruments.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Aug 2022, 17:07:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}